.pragma library

var itThreats = [
    {
        "id":  "УБИ.001",
        "numeric_id":  1,
        "name":  "Угроза автоматического распространения вредоносного кода в грид-системе",
        "description":  "Угроза заключается в возможности внедрения и запуска вредоносного кода от имени доверенного процесса на любом из ресурсных центров грид-системы и его автоматического распространения на все узлы грид-системы. \nДанная угроза обусловлена слабостями технологии грид-вычислений – высоким уровнем автоматизации при малой администрируемости грид-системы.\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий легального пользователя грид-системы",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Ресурсные центры грид-системы",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.002",
        "numeric_id":  2,
        "name":  "Угроза агрегирования данных, передаваемых в грид-системе",
        "description":  "Угроза заключается в возможности раскрытия нарушителем защищаемой информации путём выявления задействованных в её обработке узлов, сбора, анализа и обобщения данных, перехватываемых в сети передачи данных грид-системы.\nДанная угроза обусловлена слабостью технологии грид-вычислений – использованием незащищённых каналов сети Интернет как транспортной сети грид-системы.\nРеализация данной угрозы возможна при условии наличия у нарушителя:\nсил и средств, достаточных для компенсации чрезвычайной распределённости грид-заданий между узлами грид-системы;\nпривилегий, достаточных для перехвата трафика сети передачи данных между элементами (узлами) грид-системы",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.003",
        "numeric_id":  3,
        "name":  "Угроза использования слабостей криптографических алгоритмов и уязвимостей в программном обеспечении их реализации",
        "description":  "Угроза заключается в возможности выявления слабых мест в криптографических алгоритмах или уязвимостей в реализующем их программном обеспечении.\nДанная угроза обусловлена слабостями криптографических алгоритмов, а также ошибками в программном коде криптографических средств, их сопряжении с системой или параметрах их настройки.\nРеализация угрозы возможна в случае наличия у нарушителя сведений об применяемых в системе средствах шифрования, реализованных в них алгоритмах шифрования и параметрах их настройки",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Метаданные, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.004",
        "numeric_id":  4,
        "name":  "Угроза аппаратного сброса пароля BIOS",
        "description":  "Угроза заключается в возможности сброса паролей, установленных в BIOS/UEFI без прохождения процедуры авторизации в системе путём обесточивания микросхемы BIOS (съёма аккумулятора) или установки перемычки в штатном месте на системной плате (переключение «джампера»).\nДанная угроза обусловлена уязвимостями некоторых системных (материнских) плат – наличием механизмов аппаратного сброса паролей, установленных в BIOS/UEFI.\nРеализация данной угрозы возможна при условии наличия у нарушителя физического доступа к системному блоку компьютера",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное и аппаратное обеспечение BIOS/UEFI",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.005",
        "numeric_id":  5,
        "name":  "Угроза внедрения вредоносного кода в BIOS",
        "description":  "Угроза заключается в возможности заставить BIOS/UEFI выполнять вредоносный код при каждом запуске компьютера, внедрив его в BIOS/UEFI путём замены микросхемы BIOS/UEFI или обновления программного обеспечения BIOS/UEFI на версию, уже содержащую вредоносный код.\nДанная угроза обусловлена слабостями технологий контроля за обновлением программного обеспечения BIOS/UEFI и заменой чипсета BIOS/UEFI.\nРеализация данной угрозы возможна в ходе проведения ремонта и обслуживания компьютера",
        "violator_source":  "Внутренний нарушитель с высоким потенциалом",
        "target_object":  "Микропрограммное и аппаратное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.006",
        "numeric_id":  6,
        "name":  "Угроза внедрения кода или данных",
        "description":  "Угроза заключается в возможности внедрения нарушителем в дискредитируемую информационную систему или IoT-устройство вредоносного кода, который может быть в дальнейшем запущен «вручную» пользователями, автоматически при выполнении определённого условия (наступления определённой даты, входа пользователя в систему и т.п.) или с использованием аутентификационных данных, заданных «по умолчанию», а также в возможности несанкционированного внедрения нарушителем некоторых собственных данных для обработки в дискредитируемую информационную систему, фактически осуществив незаконное использование чужих вычислительных ресурсов, и блокирования работы устройства при выполнении определенных команд.\nДанная угроза обусловлена:\nналичием уязвимостей программного обеспечения;\nслабостями мер антивирусной защиты и разграничения доступа;\nналичием открытого Telnet-порта на IoT-устройстве (только для IoT-устройств).\nРеализация данной угрозы возможна:\nв случае работы дискредитируемого пользователя с файлами, поступающими из недоверенных источников;\nпри наличии у него привилегий установки программного обеспечения;\nв случае неизмененных владельцем учетных данных IoT-устройства (заводских пароля и логина)",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.007",
        "numeric_id":  7,
        "name":  "Угроза воздействия на программы с высокими привилегиями",
        "description":  "Угроза заключается в возможности повышения нарушителем своих привилегий в дискредитированной системе (получения привилегии дискредитированных программ) путём использования ошибок в программах и выполнения произвольного кода с их привилегиями.\nДанная угроза обусловлена слабостями механизма проверки входных данных и команд, а также мер по разграничению доступа.\nРеализация данной угрозы возможна при условиях:\nобладания дискредитируемой программой повышенными привилегиями в системе;\nосуществления дискредитируемой программой приёма входных данных от других программ или от пользователя;\nнарушитель имеет возможность осуществлять передачу данных к дискредитируемой программе",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Информационная система, виртуальная машина, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.008",
        "numeric_id":  8,
        "name":  "Угроза восстановления и/или повторного использования аутентификационной информации",
        "description":  "Угроза заключается в возможности доступа к данным пользователя в результате подбора (например, путём полного перебора или перебора по словарю) аутентификационной информации дискредитируемой учётной записи пользователя в системе, а также путём перехвата и повторного использования хэша пароля, для восстановления сеанса.\nДанная угроза обусловлена следующими недостатками:\nзначительно меньшим объёмом данных хеш-кода аутентификационной информации по сравнению с ней самой (время подбора хеш-кодов меньше времени полного перебора аутентификационной информации); \nслабостями алгоритма расчёта хеш-кода, допускающими его повторное использование для выполнения успешной аутентификации.\nРеализация данной угрозы возможна с помощью специальных программных средств, а также в некоторых случаях – «вручную»",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, микропрограммное обеспечение, учётные данные пользователя",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.009",
        "numeric_id":  9,
        "name":  "Угроза восстановления предыдущей уязвимой версии BIOS",
        "description":  "Угроза заключается в возможности осуществления вынужденного перехода на использование BIOS/UEFI, содержащей уязвимости.\nДанная угроза обусловлена слабостями технологий контроля за обновлением программного обеспечения BIOS/UEFI.\nПри использовании технологии обновления BIOS/UEFI возможно возникновение следующей ситуации (условия, характеризующие ситуацию указаны в хронологическом порядке): \nна компьютере установлена некоторая версия BIOS/UEFI, для которой на момент её работы не известны уязвимости; \nв силу некоторых обстоятельств BIOS/UEFI проходит процедуру обновления, сохраняя при этом предыдущую версию BIOS/UEFI на случай «отката» системы; \nпубликуются данные о существовании уязвимостей в предыдущей версии BIOS/UEFI; \nпроисходит сбой в работе системы, в результате чего текущая (новая) версия BIOS/UEFI становится неработоспособной (например, нарушается её целостность);\nпользователь осуществляет штатную процедуру восстановления работоспособности системы – проводит «откат» системы к предыдущему работоспособному состоянию",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.010",
        "numeric_id":  10,
        "name":  "Угроза выхода процесса за пределы виртуальной машины",
        "description":  "Угроза заключается в возможности запуска вредоносной программой собственного гипервизора, функционирующего по уровню логического взаимодействия ниже компрометируемого гипервизора.\nДанная угроза обусловлена уязвимостями программного обеспечения гипервизора, реализующего функцию изолированной программной среды для функционирующих в ней программ, а также слабостями инструкций аппаратной поддержки виртуализации на уровне процессора.\nРеализация данной угрозы приводит не только к компрометации гипервизора, но и запущенных в созданной им виртуальной среде средств защиты, а, следовательно, к их неспособности выполнять функции безопасности в отношении вредоносных программ, функционирующих под управлением собственного гипервизора",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Информационная система, сетевой узел, носитель информации, объекты файловой системы, учётные данные пользователя, образ виртуальной машины",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.011",
        "numeric_id":  11,
        "name":  "Угроза деавторизации санкционированного клиента беспроводной сети",
        "description":  "Угроза заключается в возможности автоматического разрыва соединения беспроводной точки доступа с санкционированным клиентом беспроводной сети.\nДанная угроза обусловлена слабостью технологий сетевого взаимодействия по беспроводным каналам передачи данных – сведения о МАС-адресах беспроводных клиентов доступны всем участникам сетевого взаимодействия.\nРеализация данной угрозы возможна при условии подключения нарушителем к беспроводной сети устройства, МАС-адрес которого будет полностью совпадать с МАС-адресом дискредитируемого санкционированного клиента",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.012",
        "numeric_id":  12,
        "name":  "Угроза деструктивного изменения конфигурации/среды окружения программ",
        "description":  "Угроза заключается в возможности деструктивного программного воздействия на дискредитируемое приложение путём осуществления манипуляций с используемыми им конфигурационными файлами или библиотеками.\nДанная угроза обусловлена слабостями мер контроля целостности конфигурационных файлов или библиотек, используемых приложениями.\nРеализация данной угрозы возможна в случае наличия у нарушителя прав осуществления записи в файловые объекты, связанные с конфигурацией/средой окружения программы, или возможности перенаправления запросов дискредитируемой программы от защищённых файловых объектов к ложным",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, метаданные, объекты файловой системы, реестр",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.013",
        "numeric_id":  13,
        "name":  "Угроза деструктивного использования декларированного функционала BIOS",
        "description":  "Угроза заключается в возможности неправомерного использования декларированного функционала BIOS/UEFI для нарушения целостности информации, хранимой на внешних носителях информации и в оперативном запоминающем устройстве компьютера.\nДанная угроза обусловлена уязвимостями программного обеспечения BIOS/UEFI, предназначенного для тестирования и обслуживания компьютера (средств проверки целостности памяти, программного обеспечения управления RAID-контроллером и т.п.).\nРеализации данной угрозы может способствовать возможность обновления некоторых BIOS/UEFI без прохождения аутентификации",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.014",
        "numeric_id":  14,
        "name":  "Угроза длительного удержания вычислительных ресурсов пользователями",
        "description":  "Угроза заключается в возможности ограничения нарушителем доступа конечных пользователей к вычислительному ресурсу за счёт принудительного удержания его в загруженном состоянии путём осуществления им многократного выполнения определённых деструктивных действий или эксплуатации уязвимостей программ, распределяющих вычислительные ресурсы между задачами. \nДанная угроза обусловлена слабостями механизмов балансировки нагрузки и распределения вычислительных ресурсов.\nРеализация угрозы возможна в случае, если у нарушителя имеется возможность делать запросы, которые в совокупности требуют больше времени на выполнение, чем запросы пользователя",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, сетевой узел, носитель информации, системное программное обеспечение, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.015",
        "numeric_id":  15,
        "name":  "Угроза доступа к защищаемым файлам с использованием обходного пути",
        "description":  "Угроза заключается в возможности получения нарушителем доступа к скрытым/защищаемым каталогам или файлам посредством различных воздействий на файловую систему (добавление дополнительных символов в указании пути к файлу; обращение к файлам, которые явно не указаны в окне приложения). \nДанная угроза обусловлена слабостями механизма разграничения доступа к объектам файловой системы.\nРеализация данной угрозы возможна при условиях:\nналичие у нарушителя прав доступа к некоторым объектам файловой системы;\nотсутствие проверки вводимых пользователем данных;\nналичие у дискредитируемой программы слишком высоких привилегий доступа к файлам, обработка которых не предполагается с её помощью",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Объекты файловой системы",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.016",
        "numeric_id":  16,
        "name":  "Угроза доступа к локальным файлам сервера при помощи URL",
        "description":  "Угроза заключается в возможности передачи нарушителем дискредитируемому браузеру запроса на доступ к файловой системе пользователя вместо URL-запроса. При этом браузер выполнит этот запрос с правами, которыми он был наделён при запуске, и передаст данные, полученные в результате выполнения этой операции, нарушителю.\nДанная угроза обусловлена слабостями механизма проверки вводимых пользователем запросов, который не делает различий между запросами на доступ к файловой системе и URL-запросами.\nРеализация данной угрозы возможна в случае наличия у нарушителя привилегий на отправку запросов браузеру, функционирующему в дискредитируемой системе",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.017",
        "numeric_id":  17,
        "name":  "Угроза доступа/перехвата/изменения HTTP cookies",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к защищаемой информации (учётным записям пользователей, сертификатам и т.п.), содержащейся в cookies-файлах, во время их хранения или передачи, в режиме чтения (раскрытие конфиденциальности) или записи (внесение изменений для реализации угрозы подмены доверенного пользователя).\nДанная угроза обусловлена слабостями мер защиты cookies-файлов: отсутствием проверки вводимых данных со стороны сетевой службы, использующей cookies-файлы, а также отсутствием шифрования при передаче cookies-файлов.\nРеализация данной угрозы возможна при условиях осуществления нарушителем успешного несанкционированного доступа к cookies-файлам и отсутствии проверки целостности их значений со стороны дискредитируемого приложения",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.018",
        "numeric_id":  18,
        "name":  "Угроза загрузки нештатной операционной системы",
        "description":  "Угроза заключается в возможности подмены нарушителем загружаемой операционной системы путём несанкционированного переконфигурирования в BIOS/UEFI пути доступа к загрузчику операционной системы.\nДанная угроза обусловлена слабостями технологий разграничения доступа к управлению BIOS/UEFI.\nРеализация данной угрозы возможна при условии доступности нарушителю следующего параметра настройки BIOS/UEFI – указания источника загрузки операционной системы",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.019",
        "numeric_id":  19,
        "name":  "Угроза заражения DNS-кеша",
        "description":  "Угроза заключается в возможности перенаправления нарушителем сетевого трафика через собственный сетевой узел путём опосредованного изменения таблиц соответствия IP- и доменных имён, хранимых в DNS-сервере, за счёт генерации лавины возможных ответов на запрос DNS-сервера легальному пользователю или за счёт эксплуатации уязвимостей DNS-сервера. \nДанная угроза обусловлена слабостями механизмов проверки подлинности субъектов сетевого взаимодействия, а также уязвимостями DNS-сервера, позволяющими напрямую заменить DNS-кеш DNS-сервера.\nРеализация данной угрозы возможна в случае наличия у нарушителя привилегий, достаточных для отправки сетевых запросов к DNS-серверу",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.020",
        "numeric_id":  20,
        "name":  "Угроза злоупотребления возможностями, предоставленными потребителям облачных услуг",
        "description":  "Угроза заключается в возможности осуществления потребителем облачных услуг (нарушителем) рассылки спама, несанкционированного доступа к виртуальным машинам других потребителей облачных услуг или осуществления других деструктивных программных воздействий на различные системы с помощью арендованных ресурсов облачного сервера.\nДанная угроза обусловлена тем, что потребитель облачных услуг может устанавливать собственное программное обеспечение на облачный сервер.\nРеализация данной угрозы возможна путём установки и запуска потребителем облачных услуг вредоносного программного обеспечения на облачный сервер. Успешная реализация данной угрозы потребителем облачных услуг оказывает негативное влияние на репутацию поставщика облачных услуг",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Облачная система, виртуальная машина",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.021",
        "numeric_id":  21,
        "name":  "Угроза злоупотребления доверием потребителей облачных услуг",
        "description":  "Угроза заключается в возможности нарушения (случайно или намеренно) защищённости информации потребителей облачных услуг внутренними нарушителями поставщика облачных услуг.\nДанная угроза обусловлена тем, что значительная часть функций безопасности переведена в сферу ответственности поставщика облачных услуг, а также невозможностью принятия потребителем облачных услуг мер защиты от действий сотрудников поставщика облачных услуг.\nРеализация данной угрозы возможна при условии того, что потребители облачных услуг не входят в состав организации, осуществляющей оказание данных облачных услуг (т.е. потребитель действительно передал поставщику собственную информацию для осуществления её обработки)",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Облачная система",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.022",
        "numeric_id":  22,
        "name":  "Угроза избыточного выделения оперативной памяти",
        "description":  "Угроза заключается в возможности выделения значительных ресурсов оперативной памяти для обслуживания запросов вредоносных программ и соответственного снижения объёма ресурсов оперативной памяти, доступных в системе для выделения в ответ на запросы программ легальных пользователей.\nДанная угроза обусловлена наличием слабостей механизма контроля выделения оперативной памяти различным программам.\nРеализация данной угрозы возможна при условии нахождения вредоносного программного обеспечения в системе в активном состоянии",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Аппаратное обеспечение, системное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.023",
        "numeric_id":  23,
        "name":  "Угроза изменения компонентов информационной (автоматизированной) системы",
        "description":  "Угроза заключается в возможности получения нарушителем доступа к сети, файлам, внедрения закладок и т.п. путём несанкционированного изменения состава программных или аппаратных средств информационной системы, что в дальнейшем позволит осуществлять данному нарушителю (или другому - внешнему, обнаружившему несанкционированный канал доступа в систему) несанкционированные действия в данной системе.\nДанная угроза обусловлена слабостями мер контроля за целостностью аппаратной конфигурации информационной системы.\nРеализация данной угрозы возможна при условии успешного получения нарушителем необходимых полномочий в системе и возможности подключения дополнительного периферийного оборудования",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, сервер, рабочая станция, виртуальная машина, системное программное обеспечение, прикладное программное обеспечение, аппаратное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.024",
        "numeric_id":  24,
        "name":  "Угроза изменения режимов работы аппаратных элементов компьютера",
        "description":  "Угроза заключается в возможности изменения нарушителем режимов работы аппаратных элементов компьютера путём несанкционированного переконфигурирования BIOS/UEFI, что позволяет:\nза счёт изменения частоты системной шины, режима передачи данных по каналам связи и т.п. повлиять на общую производительность компьютера или вызвать сбои в его работе;\nза счёт понижения входного напряжения, отключения систем охлаждения временно обеспечить неработоспособность компьютера;\nза счёт задания недопустимых параметров работы устройств (порогового значения отключения устройства при перегреве, входного напряжения и т.п.) привести к физическому выходу из строя отдельных аппаратных элементов компьютера.\nДанная угроза обусловлена слабостями технологий разграничения доступа к управлению BIOS/UEFI.\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий на изменение соответствующих параметров настройки BIOS/UEFI",
        "violator_source":  "Внутренний нарушитель с высоким потенциалом",
        "target_object":  "Микропрограммное и аппаратное обеспечение BIOS/UEFI",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.025",
        "numeric_id":  25,
        "name":  "Угроза изменения системных и глобальных переменных",
        "description":  "Угроза заключается в возможности осуществления нарушителем опосредованного деструктивного программного воздействия на некоторые программы или систему в целом путём изменения используемых дискредитируемыми программами единых системных и глобальных переменных.\nДанная угроза обусловлена слабостями механизма контроля доступа к разделяемой памяти, а также уязвимостями программных модулей приложений, реализующих контроль целостности внешних переменных.\nРеализация данной угрозы возможна при условиях осуществления нарушителем успешного несанкционированного доступа к системным и глобальным переменным и отсутствии проверки целостности их значений со стороны дискредитируемого приложения",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.026",
        "numeric_id":  26,
        "name":  "Угроза искажения XML-схемы",
        "description":  "Угроза заключается в возможности изменения нарушителем алгоритма обработки информации приложениями, функционирующими на основе XML-схем, вплоть до приведения приложения в состояние \"отказ в обслуживании\", путём изменения XML-схемы, передаваемой между клиентом и сервером.\nДанная угроза обусловлена слабостями мер обеспечения целостности передаваемых при клиент-серверном взаимодействии данных, а также слабостями механизма сетевого взаимодействия открытых систем.\nРеализация данной угрозы возможна при условиях осуществления нарушителем успешного несанкционированного доступа к сетевому трафику, передаваемому между клиентом и сервером и отсутствии проверки целостности XML-схемы со стороны дискредитируемого приложения",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.027",
        "numeric_id":  27,
        "name":  "Угроза искажения вводимой и выводимой на периферийные устройства информации",
        "description":  "Угроза заключается в возможности дезинформирования пользователей или автоматических систем управления путём подмены или искажения исходных данных, поступающих от датчиков, клавиатуры или других устройств ввода информации, а также подмены или искажения информации, выводимой на принтер, дисплей оператора или на другие периферийные устройства.\nДанная угроза обусловлена слабостями мер антивирусной защиты и контроля достоверности входных и выходных данных, а также ошибками, допущенными в ходе проведения специальных проверок аппаратных средств вычислительной техники.\nРеализация данной угрозы возможна при условии наличия в дискредитируемой информационной системе вредоносного программного обеспечения (например, виртуальных драйверов устройств) или аппаратных закладок",
        "violator_source":  "Внешний нарушитель с высоким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, аппаратное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.028",
        "numeric_id":  28,
        "name":  "Угроза использования альтернативных путей доступа к ресурсам",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к защищаемой информации в обход штатных механизмов с помощью нестандартных интерфейсов (в том числе доступа через командную строку в обход графического интерфейса).\nДанная угроза обусловлена слабостями мер разграничения доступа к защищаемой информации, слабостями фильтрации входных данных.\nРеализация данной угрозы возможна при условии наличия у нарушителя:\nвозможности ввода произвольных данных в адресную строку;\nсведений о пути к защищаемому ресурсу;\nвозможности изменения интерфейса ввода входных данных",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, объекты файловой системы, прикладное программное обеспечение, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.029",
        "numeric_id":  29,
        "name":  "Угроза использования вычислительных ресурсов суперкомпьютера «паразитными» процессами",
        "description":  "Угроза заключается в возможности существенного снижения производительности вычислительного поля суперкомпьютера и эффективности выполнения на нём текущих параллельных вычислений из-за потребления вычислительных ресурсов суперкомпьютера «паразитными» процессами («процессами-потомками» предыдущих заданий или процессами, запущенными вредоносным программным обеспечением).\nДанная угроза обусловлена слабостями мер очистки памяти от «процессов-потомков» завершённых заданий, а также процессов, запущенных вредоносным программным обеспечением.\nРеализация данной угрозы возможна при условии некорректного завершения выполненных задач или наличия вредоносных процессов в памяти суперкомпьютера в активном состоянии",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Вычислительные узлы суперкомпьютера",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.030",
        "numeric_id":  30,
        "name":  "Угроза использования информации идентификации/аутентификации, заданной по умолчанию",
        "description":  "Угроза заключается в возможности прохождения нарушителем процедуры авторизации на основе полученной из открытых источников\nили от информационного сервиса идентификационной и аутентификационной информации, соответствующей учётной записи «по умолчанию» дискредитируемого объекта защиты.\nДанная угроза обусловлена тем, что во множестве программных и программно-аппаратных средств производителями предусмотрены учётные записи «по умолчанию», предназначенные для первичного входа в систему или тем, что при прохождении на информационном сервисе процедуры регистрации механизм автоматической генерации паролей выдает одинаковые или сходные пароли пользователям с похожими логинами. Более того, на многих устройствах \nидентификационная и аутентификационная информация может быть возвращена к заданной «по умолчанию» после проведения аппаратного сброса параметров системы (функция Reset).\nРеализация данной угрозы возможна при одном из следующих условий:\nналичие у нарушителя сведений о производителе/модели объекта защиты и наличие в открытых источниках сведений об идентификационной и аутентификационной информации, соответствующей учётной записи «по умолчанию» для объекта защиты;\nуспешное завершение нарушителем процедуры выявления данной информации в ходе анализа программного кода дискредитируемого объекта защиты\nналичие у нарушителя сведений о логине используемом при регистрации атакуемым пользователем",
        "violator_source":  "Внутренний нарушитель с низким потенциалом; Внешний нарушитель со средним потенциалом",
        "target_object":  "Средства защиты информации, системное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, программно-аппаратные средства со встроенными функциями защиты",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.031",
        "numeric_id":  31,
        "name":  "Угроза использования механизмов авторизации для повышения привилегий",
        "description":  "Угроза заключается в возможности получения нарушителем доступа к данным и функциям, предназначенным для учётных записей с более высокими чем у нарушителя привилегиями, за счёт ошибок в параметрах настройки средств разграничения доступа. При этом нарушитель для повышения своих привилегий не осуществляет деструктивное программное воздействие на систему, а лишь использует существующие ошибки.\nДанная угроза обусловлена слабостями мер разграничения доступа к программам и файлам.\nРеализация данной угрозы возможна в случае наличия у нарушителя каких-либо привилегий в системе",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.032",
        "numeric_id":  32,
        "name":  "Угроза использования поддельных цифровых подписей BIOS",
        "description":  "Угроза заключается в возможности установки уязвимой версии обновления BIOS/UEFI или версии, содержащей вредоносное программное обеспечение, но имеющей цифровую подпись.\nДанная угроза обусловлена слабостями мер по контролю за благонадёжностью центров выдачи цифровых подписей.\nРеализация данной угрозы возможна при условии выдачи неблагонадёжным центром сертификации цифровой подписи на версию обновления BIOS/UEFI, содержащую уязвимости, или на версию, содержащую вредоносное программное обеспечение (т.е. при осуществлении таким центром подлога), а также подмены нарушителем доверенного источника обновлений",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Микропрограммное и аппаратное обеспечение BIOS/UEFI",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.033",
        "numeric_id":  33,
        "name":  "Угроза использования слабостей кодирования входных данных",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивного информационного воздействия на дискредитируемую систему путём манипулирования значениями входных данных и формой их предоставления (альтернативные кодировки, некорректное расширение файлов и т.п.).\nДанная угроза обусловлена слабостями механизма контроля входных данных. \nРеализация данной угрозы возможна при условиях:\nдискредитируемая система принимает входные данные от нарушителя;\nнарушитель обладает возможностью управления одним или несколькими параметрами входных данных",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, реестр",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.034",
        "numeric_id":  34,
        "name":  "Угроза использования слабостей протоколов сетевого/локального обмена данными",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к передаваемой в системе защищаемой информации за счёт деструктивного воздействия на протоколы сетевого/локального обмена данными в системе путём нарушения правил использования данных протоколов.\nДанная угроза обусловлена слабостями самих протоколов (заложенных в них алгоритмов), ошибками, допущенными в ходе реализации протоколов, или уязвимостями, внедряемыми автоматизированными средствами проектирования/разработки.\nРеализация данной угрозы возможна в случае наличия слабостей в протоколах сетевого/локального обмена данными",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.035",
        "numeric_id":  35,
        "name":  "Угроза использования слабых криптографических алгоритмов BIOS",
        "description":  "Угроза заключается в сложности проверки реальных параметров работы и алгоритмов, реализованных в криптографических средствах BIOS/UEFI. При этом доверие к криптографической защите будет ограничено доверием к производителю BIOS.\nДанная угроза обусловлена сложностью использования собственных криптографических алгоритмов в программном обеспечении BIOS/UEFI.\nВозможность реализации данной угрозы снижает достоверность оценки реального уровня защищённости системы",
        "violator_source":  "Внешний нарушитель с высоким потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.036",
        "numeric_id":  36,
        "name":  "Угроза исследования механизмов работы программы",
        "description":  "Угроза заключается в возможности проведения нарушителем обратного инжиниринга кода программы и дальнейшего исследования его структуры, функционала и состава в интересах определения алгоритма работы программы и поиска в ней уязвимостей.\nДанная угроза обусловлена слабостями механизма защиты кода программы от исследования.\nРеализация данной угрозы возможна в случаях:\nналичия у нарушителя доступа к исходным файлам программы;\nналичия у нарушителя доступа к дистрибутиву программы и отсутствия механизма защиты кода программы от исследования",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.037",
        "numeric_id":  37,
        "name":  "Угроза исследования приложения через отчёты об ошибках",
        "description":  "Угроза заключается в возможности исследования нарушителем алгоритма работы дискредитируемого приложения и его предполагаемой структуры путём анализа генерируемых этим приложением отчётов об ошибках.\nДанная угроза обусловлена размещением защищаемой информации (или информации, обобщение которой может раскрыть защищаемые сведения о системе) в генерируемых отчётах об ошибках.\nРеализация данной угрозы возможна в случае наличия у нарушителя доступа к отчётам об ошибках, генерируемых приложением, и наличия избыточности содержащихся в них данных",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.038",
        "numeric_id":  38,
        "name":  "Угроза исчерпания вычислительных ресурсов хранилища больших данных",
        "description":  "Угроза заключается в возможности временного возникновения состояния типа «отказ в обслуживании» у хранилища больших данных.\nДанная угроза обусловлена постоянным трудно контролируемым заполнением занятого дискового пространства за счёт данных, непрерывно поступающих из различных информационных источников, и слабостями технологий доступа и хранения информации в хранилищах больших данных.\nРеализация данной угрозы возможна при условии мгновенного (текущего) превышения скорости передачи данных над скоростью их сохранения (в силу недостаточности пропускной способности канала связи или скорости выделения свободного пространства и сохранения на него поступающих данных) или при условии временного отсутствия свободного места в хранилище (в силу некорректного управления хранилищем или в результате осуществления нарушителем деструктивного программного воздействия на механизм контроля за заполнением хранилища путём изменения параметров или логики его работы)",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.039",
        "numeric_id":  39,
        "name":  "Угроза исчерпания запаса ключей, необходимых для обновления BIOS",
        "description":  "Угроза заключается в возможности нарушения (невозможности осуществления) процедуры обновления BIOS/UEFI при исчерпании запаса необходимых для её проведения ключей.\nДанная угроза обусловлена ограниченностью набора ключей, необходимых для обновления BIOS/UEFI.\nРеализация данной угрозы возможна путём эксплуатации уязвимостей средств обновления набора ключей, или путём использования нарушителем программных средств перебора ключей",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.040",
        "numeric_id":  40,
        "name":  "Угроза конфликта юрисдикций различных стран",
        "description":  "Угроза заключается в возможности отказа в трансграничной передаче защищаемой информации в рамках оказания облачных услуг в соответствии с требованиями локального законодательства стран, резиденты которых участвуют в оказании облачных услуг.\nДанная угроза обусловлена тем, что в зависимости от особенностей законодательства различных стран, резиденты которых участвуют в оказании облачных услуг, при обеспечении информационной безопасности могут использоваться правовые меры различных юрисдикций.\nРеализация данной угрозы возможна при условии того, что на обеспечение информационной безопасности в ходе оказания облачных услуг накладываются правовые меры различных юрисдикций, противоречащих друг другу в ряде вопросов",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Облачная система",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.041",
        "numeric_id":  41,
        "name":  "Угроза межсайтового скриптинга",
        "description":  "Угроза заключается в возможности внедрения нарушителем участков вредоносного кода на сайт дискредитируемой системы таким образом, что он будет выполнен на рабочей станции просматривающего этот сайт пользователя.\nДанная угроза обусловлена слабостями механизма проверки безопасности при обработке запросов и данных, поступающих от веб-сайта.\nРеализация угрозы возможна в случае, если клиентское программное обеспечение поддерживает выполнение сценариев, а нарушитель имеет возможность отправки запросов и данных в дискредитируемую систему",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.042",
        "numeric_id":  42,
        "name":  "Угроза межсайтовой подделки запроса",
        "description":  "Угроза заключается в возможности отправки нарушителем дискредитируемому пользователю ссылки на содержащий вредоносный код веб-ресурс, при переходе на который автоматически будут выполнены неправомерные вредоносные действия от имени дискредитированного пользователя.\nДанная угроза обусловлена уязвимостями браузеров, которые позволяют выполнять действия без подтверждения или аутентификации со стороны дискредитируемого пользователя.\nРеализация угрозы возможна в случае, если дискредитируемый пользователь сохраняет аутентификационную информацию с помощью браузера",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.043",
        "numeric_id":  43,
        "name":  "Угроза нарушения доступности облачного сервера",
        "description":  "Угроза заключается в возможности прекращения оказания облачных услуг всем потребителям (или группе потребителей) из-за нарушения доступности для них облачной инфраструктуры.\nДанная угроза обусловлена тем, что обеспечение доступности не является специфичным требованием безопасности информации для облачных технологий, и, кроме того, облачные системы реализованы в соответствии с сервис-ориентированным подходом.\nРеализация данной угрозы возможна при переходе одного или нескольких облачных серверов в состояние «отказ в обслуживании». Более того, способность динамически изменять объём предоставляемых потребителям облачных услуг может быть использована нарушителем для реализации угрозы. При этом успешно реализованная угроза в отношении всего лишь одного облачного сервиса позволит нарушить доступность всей облачной системы",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Облачная система, облачный сервер",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.044",
        "numeric_id":  44,
        "name":  "Угроза нарушения изоляции пользовательских данных внутри виртуальной машины",
        "description":  "Угроза заключается в возможности нарушения безопасности пользовательских данных программ, функционирующих внутри виртуальной машины, вредоносным программным обеспечением, функционирующим вне виртуальной машины.\nДанная угроза обусловлена наличием уязвимостей программного обеспечения гипервизора, обеспечивающего изолированность адресного пространства, используемого для хранения пользовательских данных программ, функционирующих внутри виртуальной машины, от несанкционированного доступа со стороны вредоносного программного обеспечения, функционирующего вне виртуальной машины.\nРеализация данной угрозы возможна при условии успешного преодоления вредоносным программным кодом границ виртуальной машины не только за счёт эксплуатации уязвимостей гипервизора, но и путём осуществления такого воздействия с более низких (по отношению к гипервизору) уровней функционирования системы",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Виртуальная машина, гипервизор",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.045",
        "numeric_id":  45,
        "name":  "Угроза нарушения изоляции среды исполнения BIOS",
        "description":  "Угроза заключается в возможности изменения параметров и (или) логики работы программного обеспечения BIOS/UEFI путём программного воздействия из операционной системы компьютера или путём несанкционированного доступа к каналу сетевого взаимодействия серверного сервис-процессора.\nДанная угроза обусловлена слабостями технологий разграничения доступа к BIOS/UEFI, его функциям администрирования и обновления, со стороны операционной системы или каналов связи.\nРеализация данной угрозы возможна:\nсо стороны операционной системы – при условии наличия BIOS/UEFI функционала обновления и (или) управления программным обеспечением BIOS/UEFI из операционной системы;\nсо стороны сети – при условии наличия у дискредитируемого серверного сервис-процессора достаточных привилегий для управления всей системой, включая модификацию BIOS/UEFI серверов системы, и дискредитируемого сервера",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное и аппаратное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.046",
        "numeric_id":  46,
        "name":  "Угроза нарушения процедуры аутентификации субъектов виртуального информационного взаимодействия",
        "description":  "Угроза заключается в возможности подмены субъекта виртуального информационного взаимодействия, а также в возможности возникновения состояния неспособности осуществления такого взаимодействия.\nДанная угроза обусловлена наличием множества различных протоколов взаимной идентификации и аутентификации виртуальных, виртуализованных и физических субъектов доступа, взаимодействующих между собой в ходе передачи данных как внутри одного уровня виртуальной инфраструктуры, так и между её уровнями.\nРеализация данной угрозы возможна в случае возникновения ошибок при проведении аутентификации субъектов виртуального информационного взаимодействия",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, метаданные, учётные данные пользователя",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.047",
        "numeric_id":  47,
        "name":  "Угроза нарушения работоспособности грид-системы при нетипичной сетевой нагрузке",
        "description":  "Угроза заключается в возможности значительного снижения производительности грид-системы, вплоть до временного нарушения её работоспособности при появлении нетипичной сетевой нагрузки (в т.ч. вызванной распределённой DoS-атакой, активностью других пользователей в сети и др.).\nДанная угроза обусловлена слабостью технологий грид-вычислений – производительность грид-системы имеет сильную зависимость от загруженности каналов связи, что является следствием максимальной территориальной распределённости вычислительного модуля грид-системы среди всех типов информационных систем.\nРеализация данной угрозы возможна при условии недостаточного контроля за состоянием отдельных узлов грид-системы со стороны диспетчера задач грид-системы",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Грид-система, сетевой трафик",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.048",
        "numeric_id":  48,
        "name":  "Угроза нарушения технологии обработки информации путём несанкционированного внесения изменений в образы виртуальных машин",
        "description":  "Угроза заключается в возможности осуществления деструктивного программного воздействия на дискредитируемую систему или опосредованного деструктивного программного воздействия через неё на другие системы путём осуществления несанкционированного доступа к образам виртуальных машин.\nДанная угроза обусловлена слабостями мер разграничения доступа к образам виртуальных машин, реализованных в программном обеспечении виртуализации.\nРеализация данной угрозы может привести:\nк нарушению конфиденциальности защищаемой информации, обрабатываемой с помощью виртуальных машин, созданных на основе несанкционированно изменённых образов;\nк нарушению целостности программ, установленных на виртуальных машинах;\nк нарушению доступности ресурсов виртуальных машин;\nк созданию ботнета путём внедрения вредоносного программного обеспечения в образы виртуальных машин, используемые в качестве шаблонов (эталонные образы)",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Образ виртуальной машины, сетевой узел, сетевое программное обеспечение, виртуальная машина",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.049",
        "numeric_id":  49,
        "name":  "Угроза нарушения целостности данных кеша",
        "description":  "Угроза заключается в возможности размещения нарушителем в кеше приложения (например, браузера) или службы (например, DNS или ARP) некорректных (потенциально опасных) данных таким образом, что до обновления кеша дискредитируемое приложение (или служба) будет считать эти данные корректными. \nДанная угроза обусловлена слабостями в механизме контроля целостности данных в кеше.\nРеализация данной угрозы возможна в условиях осуществления нарушителем успешного несанкционированного доступа к данным кеша и отсутствии проверки целостности данных в кеше со стороны дискредитируемого приложения (или службы)",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.050",
        "numeric_id":  50,
        "name":  "Угроза неверного определения формата входных данных, поступающих в хранилище больших данных",
        "description":  "Угроза заключается в возможности искажения информации, сохраняемой в хранилище больших данных, или отказа в проведении сохранения при передаче в него данных в некоторых форматах.\nДанная угроза обусловлена слабостями технологий определения формата входных данных на основе дополнительной служебной информации (заголовки файлов и сетевых пакетов, расширения файлов и т.п.), а также технологий адаптивного выбора и применения методов обработки мультиформатной информации в хранилищах больших данных.\nРеализация данной угрозы возможна при условии, что дополнительная служебная информация о данных по какой-либо причине не соответствует их фактическому содержимому, или в хранилище больших данных не реализованы методы обработки данных получаемого формата",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Хранилище больших данных, метаданные",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.051",
        "numeric_id":  51,
        "name":  "Угроза невозможности восстановления сессии работы на ПЭВМ при выводе из промежуточных состояний питания",
        "description":  "Угроза заключается в возможности потери несохранённых данных, обрабатываемых в предыдущей сессии работы на компьютере, а также в возможности потери времени для возобновления работы на компьютере.\nДанная угроза обусловлена ошибками в реализации программно-аппаратных компонентов компьютера, связанных с обеспечением питания.\nРеализация данной угрозы возможна при условии невозможности выведения компьютера из промежуточных состояний питания («ждущего режима работы», «гибернации» и др.)",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Рабочая станция, носитель информации, системное программное обеспечение, метаданные, объекты файловой системы, реестр",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.052",
        "numeric_id":  52,
        "name":  "Угроза невозможности миграции образов виртуальных машин из-за несовместимости аппаратного и программного обеспечения",
        "description":  "Угроза заключается в возможности возникновения у потребителя облачных услуг непреодолимых сложностей для смены поставщика облачных услуг из-за технических сложностей в реализации процедуры миграции образов виртуальных машин из облачной системы одного поставщика облачных услуг в систему другого.\nДанная угроза обусловлена тем, что каждый поставщик облачных услуг использует для реализации своей деятельности аппаратное и программное обеспечение различных производителей, часть которого может использовать специфические (для данного производителя) инструкции, протоколы, методы, схемы коммутации и другие особенности реализации своего функционала.\nРеализация данной угрозы возможна в случае несовместимости стандартных программных интерфейсов обмена данными (API) для реализации процедуры миграции образов виртуальных машин между различными поставщиками облачных услуг в одном или обоих направлениях.\nТакже данная угроза обуславливает ограничение возможности смены производителей аппаратного и программного обеспечения поставщиком облачных услуг, что может привести к нарушению целостности и доступности информации по вине поставщика облачных услуг",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Облачная инфраструктура, виртуальная машина, аппаратное обеспечение, системное программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.053",
        "numeric_id":  53,
        "name":  "Угроза невозможности управления правами пользователей BIOS",
        "description":  "Угроза заключается в возможности неправомерного использования пользователями декларированного функционала BIOS/UEFI, ориентированного на администраторов.\nДанная угроза обусловлена слабостями технологий разграничения доступа (распределения прав) к функционалу BIOS/UEFI между различными пользователями и администраторами.\nРеализация данной угрозы возможна при условии физического доступа к терминалу и, при необходимости, к системному блоку компьютера",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.054",
        "numeric_id":  54,
        "name":  "Угроза недобросовестного исполнения обязательств поставщиками облачных услуг",
        "description":  "Угроза заключается в возможности раскрытия или повреждения целостности поставщиком облачных услуг защищаемой информации потребителей облачных услуг, невыполнения требований к уровню качества (уровню доступности) предоставляемых потребителям облачных услуг доступа к их программам или иммигрированным в облако информационным системам.\nДанная угроза обусловлена невозможностью непосредственного контроля над действиями сотрудников поставщика облачных услуг со стороны их потребителей.\nРеализация данной угрозы возможна в случаях халатности со стороны сотрудников поставщика облачных услуг, недостаточности должностных и иных инструкций данных сотрудников, недостаточности мер по менеджменту и обеспечению безопасности облачных услуг и т.д.",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, сервер, носитель информации, метаданные, объекты файловой системы",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.055",
        "numeric_id":  55,
        "name":  "Угроза незащищённого администрирования облачных услуг",
        "description":  "Угроза заключается в возможности осуществления опосредованного деструктивного программного воздействия на часть или все информационные системы, функционирующие в облачной среде, путём перехвата управления над облачной инфраструктурой через механизмы удалённого администрирования.\nДанная угроза обусловлена недостаточностью внимания, уделяемого контролю вводимых пользователями облачных услуг данных (в том числе аутентификационных данных), а также уязвимостями небезопасных интерфейсов обмена данными (API), используемых средствами удалённого администрирования.\nРеализация данной угрозы возможна в случае получения нарушителем аутентификационной информации (при их вводе в общественных местах) легальных пользователей, или эксплуатации уязвимостей в средствах удалённого администрирования",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Облачная система, рабочая станция, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.056",
        "numeric_id":  56,
        "name":  "Угроза некачественного переноса инфраструктуры в облако",
        "description":  "Угроза заключается в возможности снижения реального уровня защищённости иммигрирующей в облако информационной системы из-за ошибок, допущенных при миграции в ходе преобразования её реальной инфраструктуры в облачную.\nДанная угроза обусловлена тем, что преобразование даже части инфраструктуры информационной системы в облачную зачастую требует проведения серьёзных изменений в такой инфраструктуре (например, в политиках безопасности и организации сетевого обмена данными).\nРеализация данной угрозы возможна в случае несовместимости программных и сетевых интерфейсов или несоответствий политик безопасности при осуществлении переноса информационной системы в облако",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, иммигрированная в облако, облачная система",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.057",
        "numeric_id":  57,
        "name":  "Угроза неконтролируемого копирования данных внутри хранилища больших данных",
        "description":  "Угроза заключается в сложности контроля за всеми автоматически создаваемыми копиями информации в хранилище больших данных из-за временной несогласованности данных операций.\nДанная угроза обусловлена осуществлением дублирования (дву- или многократного) данных на различных вычислительных узлах, входящих в состав хранилища больших данных, с целью повышения скорости доступа к этим данным при большом количестве запросов чтения/записи. При этом данная операция является внутренней функцией и «непрозрачна» для конечных пользователей и администраторов хранилища больших данных.\nРеализация данной угрозы возможна при условии недостаточности мер по контролю за автоматически создаваемыми копиями информации, применяемых в хранилище больших данных",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Хранилище больших данных, метаданные, защищаемые данные",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.058",
        "numeric_id":  58,
        "name":  "Угроза неконтролируемого роста числа виртуальных машин",
        "description":  "Угроза заключается в возможности ограничения или нарушения доступности виртуальных ресурсов для конечных потребителей облачных услуг путём случайного или несанкционированного преднамеренного создания нарушителем множества виртуальных машин.\nДанная угроза обусловлена ограниченностью объёма дискового пространства, выделенного под виртуальную инфраструктуру, и слабостями технологий контроля процесса создания виртуальных машин.\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на создание виртуальных машин в облачной инфраструктуре",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Облачная система, консоль управления облачной инфраструктурой, облачная инфраструктура",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.059",
        "numeric_id":  59,
        "name":  "Угроза неконтролируемого роста числа зарезервированных вычислительных ресурсов",
        "description":  "Угроза заключается в возможности отказа легальным пользователям в выделении компьютерных ресурсов после осуществления нарушителем неправомерного резервирования всех свободных компьютерных ресурсов (вычислительных ресурсов и ресурсов памяти).\nДанная угроза обусловлена уязвимостями программного обеспечения уровня управления виртуальной инфраструктурой, реализующего функцию распределения компьютерных ресурсов между пользователями.\nРеализация данной угрозы возможна при условии успешного осуществления нарушителем несанкционированного доступа к программному обеспечению уровня управления виртуальной инфраструктурой, реализующему функцию распределения компьютерных ресурсов между пользователями",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, сервер",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.060",
        "numeric_id":  60,
        "name":  "Угроза неконтролируемого уничтожения информации хранилищем больших данных",
        "description":  "Угроза заключается в возможности удаления из хранилища некоторых обрабатываемых данных без уведомления конечного пользователя или администратора.\nДанная угроза обусловлена слабостями механизма автоматического удаления данных, не отвечающих определённым требованиям (предельный «срок жизни» в хранилище, конечная несогласованность с другими данными, создание копии в другом месте и т.п.).\nРеализация данной угрозы возможна при условии недостаточности реализованных в хранилище больших данных мер по контролю за автоматическим удалением данных",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Хранилище больших данных, метаданные, защищаемые данные",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.061",
        "numeric_id":  61,
        "name":  "Угроза некорректного задания структуры данных транзакции",
        "description":  "Угроза заключается в возможности совершения нарушителем (клиентом базы данных) подлога путём прерывания транзакции или подмены идентификатора транзакции. В первом случае происходит неполное выполнение транзакции, а во втором – пользователь форсированно завершает транзакцию, изменяя её ID, и сообщая о том, что транзакция не была проведена, тем самым провоцируя повторное проведение транзакции.\nДанная угроза обусловлена слабостями механизма контроля непрерывности транзакций и целостности данных, передаваемых в ходе транзакции между базой данных и её клиентом",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Сетевой трафик, база данных, сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.062",
        "numeric_id":  62,
        "name":  "Угроза некорректного использования прозрачного прокси-сервера за счёт плагинов браузера",
        "description":  "Угроза заключается в возможности перенаправления или копирования обрабатываемых браузером данных через прозрачный прокси-сервер, подключённый к браузеру в качестве плагина.\nДанная угроза обусловлена слабостями механизма контроля доступа к настройкам браузера.\nРеализация возможна в случае успешного осуществления нарушителем включения режима использования прозрачного прокси-сервера в параметрах настройки браузера, например, в результате реализации угрозы межсайтового скриптинга",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.063",
        "numeric_id":  63,
        "name":  "Угроза некорректного использования функционала программного и аппаратного обеспечения",
        "description":  "Угроза заключается в возможности использования декларированных возможностей программных и аппаратных средств определённым (нестандартным, некорректным) способом с целью деструктивного воздействия на информационную систему и обрабатываемую ею информацию.\nДанная угроза связана со слабостями механизма обработки данных и команд, вводимых пользователями.\nРеализация данной угрозы возможна в случае наличия у нарушителя доступа к программным и аппаратным средствам",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, аппаратное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.064",
        "numeric_id":  64,
        "name":  "Угроза некорректной реализации политики лицензирования в облаке",
        "description":  "Угроза заключается в возможности отказа потребителям облачных услуг в удалённом доступе к арендуемому программному обеспечению (т.е. происходит потеря доступности облачной услуги SaaS) по вине поставщика облачных услуг.\nДанная угроза обусловлена недостаточностью проработки вопроса управления политиками лицензирования использования программного обеспечения различных производителей в облаке.\nРеализация данной угрозы возможна при условии, что политика лицензирования использования программного обеспечения основана на ограничении количества его установок или числа его пользователей, а созданные виртуальные машины с лицензируемым программным обеспечением использованы много раз",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.065",
        "numeric_id":  65,
        "name":  "Угроза неопределённости в распределении ответственности между ролями в облаке",
        "description":  "Угроза заключается в возможности возникновения существенных разногласий между поставщиком и потребителем облачных услуг по вопросам, связанным с определением их прав и обязанностей в части обеспечения информационной безопасности.\nДанная угроза обусловлена отсутствием достаточного набора мер контроля за распределением ответственности между различными ролями в части владения данными, контроля доступа, поддержки облачной инфраструктуры и т. п.\nВозможность реализации данной угрозы повышается в случае использования облачных услуг, предоставляемых другими поставщиками (т.е. в случае использования схемы оказания облачных услуг с участием посредников)",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.066",
        "numeric_id":  66,
        "name":  "Угроза неопределённости ответственности за обеспечение безопасности облака",
        "description":  "Угроза заключается в возможности невыполнения ряда мер по защите информации как поставщиком облачных услуг, так и их потребителем.\nДанная угроза обусловлена отсутствием чёткого разделения ответственности в части обеспечения безопасности информации между потребителем и поставщиком облачных услуг.\nРеализация данной угрозы возможна при условии недостаточности документального разделения сфер ответственности между сторонами участвующими в оказании облачных услуг, а также отсутствия документального определения ответственности за несоблюдение требований безопасности",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Облачная система",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.067",
        "numeric_id":  67,
        "name":  "Угроза неправомерного ознакомления с защищаемой информацией",
        "description":  "Угроза заключается в возможности неправомерного случайного или преднамеренного ознакомления пользователя с информацией, которая для него не предназначена, и дальнейшего её использования для достижения своих или заданных ему другими лицами (организациями) деструктивных целей.\nДанная угроза обусловлена уязвимостями средств контроля доступа, ошибками в параметрах конфигурации данных средств или отсутствием указанных средств.\nРеализация данной угрозы не подразумевает установку и использование нарушителем специального вредоносного программного обеспечения. При этом ознакомление может быть проведено путём просмотра информации с экранов мониторов других пользователей, с отпечатанных документов, путём подслушивания разговоров и др.",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Аппаратное обеспечение, носители информации, объекты файловой системы",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.068",
        "numeric_id":  68,
        "name":  "Угроза неправомерного/некорректного использования интерфейса взаимодействия с приложением",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на API в целях реализации функций, изначально не предусмотренных дискредитируемым приложением (например, использование функций отладки из состава API).\nДанная угроза обусловлена наличием слабостей в механизме проверки входных данных и команд API, используемого программным обеспечением.\nРеализация данной угрозы возможна в условиях наличия у нарушителя доступа к API и отсутствия у дискредитируемого приложения механизма проверки вводимых данных и команд",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, реестр",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.069",
        "numeric_id":  69,
        "name":  "Угроза неправомерных действий в каналах связи",
        "description":  "Угроза заключается в возможности внесения нарушителем изменений в работу сетевых протоколов путём добавления или удаления данных из информационного потока с целью оказания влияния на работу дискредитируемой системы или получения доступа к конфиденциальной информации, передаваемой по каналу связи.\nДанная угроза обусловлена слабостями сетевых протоколов, заключающимися в отсутствии проверки целостности и подлинности получаемых данных. \nРеализация данной угрозы возможна при условии осуществления нарушителем несанкционированного доступа к сетевому трафику",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой трафик",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.070",
        "numeric_id":  70,
        "name":  "Угроза непрерывной модернизации облачной инфраструктуры",
        "description":  "Угроза заключается в возможности занесения в облачную систему уязвимостей и слабостей вместе с добавлением нового программного или аппаратного обеспечения. При этом система, рассматриваемая как защищённая на этапе ввода её в эксплуатацию, уже не может считаться таковой после её модернизации.\nДанная угроза обусловлена тем, что, во-первых, поставщики облачных услуг предоставляют возможность осуществления потребителем облачных услуг выбора и (или) изменения первоначального состава программного обеспечения облачной инфраструктуры в процессе оказания таких услуг, а, во-вторых, при интенсивном подключении новых потребителей модернизация облачной инфраструктуры может проходить несколько раз в год.\nРеализация данной угрозы возможна в случае, если срок до следующей модернизации не превышает срока проведения оценки соответствия системы требованиям безопасности в условиях отсутствия системы менеджмента облачных услуг и обеспечения их безопасности (системы облачного менеджмента)",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Облачная инфраструктура",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.071",
        "numeric_id":  71,
        "name":  "Угроза несанкционированного восстановления удалённой защищаемой информации",
        "description":  "Угроза заключается в возможности осуществления прямого доступа (доступа с уровней архитектуры более низких по отношению к уровню операционной системы) к данным, хранящимся на машинном носителе информации, или восстановления данных по считанной с машинного носителя остаточной информации.\nДанная угроза обусловлена слабостями механизма удаления информации с машинных носителей – информация, удалённая с машинного носителя, в большинстве случаев может быть восстановлена.\nРеализация данной угрозы возможна при следующих условиях:\nудаление информации с машинного носителя происходило без использования способов (методов, алгоритмов) гарантированного стирания данных (например, физическое уничтожение машинного носителя информации);\nтехнологические особенности машинного носителя информации не приводят к гарантированному уничтожению информации при получении команды на стирание данных;\nинформация не хранилась в криптографически преобразованном виде",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Машинный носитель информации",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.072",
        "numeric_id":  72,
        "name":  "Угроза несанкционированного выключения или обхода механизма защиты от записи в BIOS",
        "description":  "Угроза заключается в возможности внедрения в BIOS/UEFI вредоносного программного кода после ошибочного или злонамеренного выключения пользователем механизма защиты BIOS/UEFI от записи, а также в возможности установки неподписанного обновления в обход механизма защиты от записи в BIOS/UEFI.\nДанная угроза обусловлена слабостями мер по разграничению доступа к управлению механизмом защиты BIOS/UEFI от записи, а также уязвимостями механизма обновления BIOS/UEFI, приводящими к переполнению буфера.\nРеализация данной угрозы возможна в одном из следующих условий:\nвыключенном механизме защиты BIOS/UEFI от записи;\nуспешной эксплуатации нарушителем уязвимости механизма обновления BIOS/UEFI, приводящей к переполнению буфера",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное и аппаратное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.073",
        "numeric_id":  73,
        "name":  "Угроза несанкционированного доступа к активному и (или) пассивному виртуальному и (или) физическому сетевому оборудованию из физической и (или) виртуальной сети",
        "description":  "Угроза заключается в возможности изменения вредоносными программами алгоритма работы программного обеспечения сетевого оборудования и (или) параметров его настройки путём эксплуатации уязвимостей программного и (или) микропрограммного обеспечения указанного оборудования.\nДанная угроза обусловлена ограниченностью функциональных возможностей (наличием слабостей) активного и (или) пассивного виртуального и (или) физического сетевого оборудования, входящего в состав виртуальной инфраструктуры, наличием у данного оборудования фиксированного сетевого адреса.\nРеализация данной угрозы возможна при условии наличия уязвимостей в программном и (или) микропрограммном обеспечении сетевого оборудования",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Сетевое оборудование, микропрограммное обеспечение, сетевое программное обеспечение, виртуальные устройства",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.074",
        "numeric_id":  74,
        "name":  "Угроза несанкционированного доступа к аутентификационной информации",
        "description":  "Угроза заключается в возможности извлечения паролей, имён пользователей или других учётных данных из оперативной памяти компьютера или хищения (копирования) файлов паролей (в том числе хранящихся в открытом виде) с машинных носителей информации",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, объекты файловой системы, учётные данные пользователя, реестр, машинные носители информации",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.075",
        "numeric_id":  75,
        "name":  "Угроза несанкционированного доступа к виртуальным каналам передачи",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного перехвата трафика сетевых узлов, недоступных с помощью сетевых технологий, отличных от сетевых технологий виртуализации, путём некорректного использования таких технологий.\nДанная угроза обусловлена слабостями мер контроля потоков, межсетевого экранирования и разграничения доступа, реализованных в отношении сетевых технологий виртуализации (с помощью которых строятся виртуальные каналы передачи данных).\nРеализация данной угрозы возможна при наличии у нарушителя привилегий на осуществление взаимодействия с помощью сетевых технологий виртуализации",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Сетевое программное обеспечение, сетевой трафик, виртуальные устройства",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.076",
        "numeric_id":  76,
        "name":  "Угроза несанкционированного доступа к гипервизору из виртуальной машины и (или) физической сети",
        "description":  "Угроза заключается в возможности приведения нарушителем всей (если гипервизор – один) или части (если используется несколько взаимодействующих между собой гипервизоров) виртуальной инфраструктуры в состояние «отказ в обслуживании» путём осуществления деструктивного программного воздействия на гипервизор из запущенных в созданной им виртуальной среде виртуальных машин, или осуществления воздействия на гипервизор через его подключение к физической вычислительной сети.\nДанная угроза обусловлена наличием множества разнообразных интерфейсов взаимодействия между гипервизором и виртуальной машиной и (или) физической сетью, уязвимостями гипервизора, а также уязвимостями программных средств и ограниченностью функциональных возможностей аппаратных средств, используемых для обеспечения его работоспособности.\nРеализация данной угрозы возможна в одном из следующих случаев:\nналичие у нарушителя привилегий, достаточных для осуществления деструктивного программного воздействия из виртуальных машин;\nналичие у гипервизора активного интерфейса взаимодействия с физической вычислительной сетью",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Гипервизор",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.077",
        "numeric_id":  77,
        "name":  "Угроза несанкционированного доступа к данным за пределами зарезервированного адресного пространства, в том числе выделенного под виртуальное аппаратное обеспечение",
        "description":  "Угроза заключается в возможности нарушения вредоносной программой, функционирующей внутри виртуальной машины, целостности программного кода своей и (или) других виртуальных машин, функционирующих под управлением того же гипервизора, а также изменения параметров её (их) настройки.\nДанная угроза обусловлена наличием слабостей программного обеспечения гипервизора, обеспечивающего изолированность адресного пространства, используемого для хранения не только защищаемой информации и программного кода обрабатывающих её программ, но и программного кода, реализующего виртуальное аппаратное обеспечение (виртуальные устройства обработки, хранения и передачи данных), от несанкционированного доступа со стороны вредоносной программы, функционирующей внутри виртуальной машины.\nРеализация данной угрозы возможна при условии успешного осуществления несанкционированного доступа со стороны вредоносной программы, функционирующей внутри виртуальной машины, к данным, хранящимся за пределами зарезервированного под пользовательские данные адресного пространства данной виртуальной машины",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Сервер, рабочая станция, виртуальная машина, гипервизор, машинный носитель информации, метаданные",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.078",
        "numeric_id":  78,
        "name":  "Угроза несанкционированного доступа к защищаемым виртуальным машинам из виртуальной и (или) физической сети",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на виртуальные машины из виртуальной и (или) физической сети как с помощью стандартных (не виртуальных) сетевых технологий, так и с помощью сетевых технологий виртуализации.\nДанная угроза обусловлена наличием у создаваемых виртуальных машин сетевых адресов и возможностью осуществления ими сетевого взаимодействия с другими субъектами.\nРеализация данной угрозы возможна при условии наличия у нарушителя сведений о сетевом адресе виртуальной машины, а также текущей активности виртуальной машины на момент осуществления нарушителем деструктивного программного воздействия",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Виртуальная машина",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.079",
        "numeric_id":  79,
        "name":  "Угроза несанкционированного доступа к защищаемым виртуальным машинам со стороны других виртуальных машин",
        "description":  "Угроза заключается в возможности осуществления деструктивного программного воздействия на защищаемые виртуальные машины со стороны других виртуальных машин с помощью различных механизмов обмена данными между виртуальными машинами, реализуемых гипервизором и активированных в системе.\nДанная угроза обусловлена слабостями механизма обмена данными между виртуальными машинами и уязвимостями его реализации в конкретном гипервизоре.\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий, достаточных для использования различных механизмов обмена данными между виртуальными машинами, реализованных в гипервизоре и активированных в системе",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Виртуальная машина",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.080",
        "numeric_id":  80,
        "name":  "Угроза несанкционированного доступа к защищаемым виртуальным устройствам из виртуальной и (или) физической сети",
        "description":  "Угроза заключается в возможности удалённого осуществления нарушителем несанкционированного доступа к виртуальным устройствам из виртуальной и (или) физической сети с помощью различных сетевых технологий, используемых для осуществления обмена данными в системе, построенной с использованием технологий виртуализации.\nДанная угроза обусловлена наличием слабостей в сетевых программных интерфейсах гипервизоров, предназначенных для удалённого управления составом и конфигурацией виртуальных устройств, созданных (создаваемых) данными гипервизорами.\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий достаточных для осуществления обмена данными в системе, построенной с использованием технологий виртуализации",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Виртуальные устройства хранения, обработки и передачи данных",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.081",
        "numeric_id":  81,
        "name":  "Угроза несанкционированного доступа к локальному компьютеру через клиента грид-системы",
        "description":  "Угроза заключается в возможности выполнения нарушителем сетевого входа на узел грид-системы с правами одной из учётных записей, соответствующей программным процессам системы управления заданиями, с последующим получением доступа к закрытой части криптографических сертификатов, используемых для установления связи в грид-системе.\nДанная угроза обусловлена наличием уязвимостей в клиенте грид-системы (клиентского программного обеспечения, устанавливаемого в узлах грид-системы), эксплуатация которых позволяет нарушителю осуществлять операции чтения и записи в объектах локальной файловой системы компьютера, отправку сигналов программным процессам (включая сигналы прекращения работы), операции чтения и записи в память программных процессов, соответствующих связующему программному обеспечению и грид-заданиям, открытия сетевых соединений в локальных и внешних узлах грид-системы.\nРеализация данной угрозы возможна при условии внедрения вредоносного программного кода в систему управления заданиями. Фактически наличие в узле грид-системы неизвестного его владельцу программного обеспечения (клиента грид-системы), проводящего неизвестные вычисления, является «черным ящиком», через который (путём эксплуатации уязвимостей или программных закладок) нарушитель может осуществить противоправные действия по отношению к хранящейся в узле грид-системы защищаемой информации (личной информации владельца узла)",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Узлы грид-системы",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.082",
        "numeric_id":  82,
        "name":  "Угроза несанкционированного доступа к сегментам вычислительного поля",
        "description":  "Угроза заключается в возможности осуществления несанкционированного доступа нарушителя к исходным данным, промежуточным и окончательным результатам расчётов других пользователей суперкомпьютера, а также случайное или преднамеренное деструктивное воздействие процессов решения одних задач на процессы и результаты решения других вычислительных задач.\nДанная угроза обусловлена слабостями механизма разграничения доступа субъектов к сегментам вычислительных полей суперкомпьютера.\nРеализация данной угрозы возможна при выполнении задач различных пользователей суперкомпьютера на одном вычислительном поле суперкомпьютера",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Вычислительный узел суперкомпьютера",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.083",
        "numeric_id":  83,
        "name":  "Угроза несанкционированного доступа к системе по беспроводным каналам",
        "description":  "Угроза заключается в возможности получения нарушителем доступа к ресурсам всей дискредитируемой информационной системы через используемые в ее составе беспроводные каналы передачи данных.\nДанная угроза обусловлена слабостями протоколов идентификации/аутентификации (таких как WEP, WPA и WPA2, AES), используемых для доступа к беспроводному оборудованию.\nРеализация данной угрозы возможна при условии наличия у нарушителя специализированного программного обеспечения, реализующего функции эксплуатации уязвимостей протоколов идентификации/аутентификации беспроводных сетей, а также нахождения в точке приема сигналов дискредитируемой беспроводной сети",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, учётные данные пользователя, сетевой трафик, аппаратное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.084",
        "numeric_id":  84,
        "name":  "Угроза несанкционированного доступа к системе хранения данных из виртуальной и (или) физической сети",
        "description":  "Угроза заключается в возможности осуществления деструктивного программного воздействия на виртуальные устройства хранения данных и (или) виртуальные диски (являющиеся как сегментами виртуального дискового пространства, созданного отдельным виртуальным устройством, так и единым виртуальным дисковым пространством, созданным путём логического объединения нескольких виртуальных устройств хранения данных).\nДанная угроза обусловлена наличием слабостей применяемых технологий распределения информации по различным виртуальным устройствам хранения данных и (или) виртуальным дискам, а также слабостей технологии единого виртуального дискового пространства. Указанные слабости связаны с высокой сложностью алгоритмов обеспечения согласованности действий по распределению информации в рамках единого виртуального дискового пространства, а также взаимодействия с виртуальными и физическими каналами передачи данных для обеспечения работы в рамках одного дискового пространства.\nРеализация данной угрозы возможна при условии наличия у нарушителя специальных программных средств, способных эксплуатировать слабости технологий, использованных при построении системы хранения данных (сетевых технологий, технологий распределения информации и др.)",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Виртуальные устройства хранения данных, виртуальные диски",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.085",
        "numeric_id":  85,
        "name":  "Угроза несанкционированного доступа к хранимой в виртуальном пространстве защищаемой информации",
        "description":  "Угроза заключается в возможности нарушения конфиденциальности информации, содержащейся в распределённых файлах, содержащих защищаемую информацию, путём восстановления данных распределённых файлов из их множества отдельных фрагментов с помощью программного обеспечения и информационных технологий по обработке распределённой информации.\nДанная угроза обусловлена тем, что в связи с применением множества технологий виртуализации, предназначенных для работы с данными (распределение данных внутри виртуальных и логических дисков, распределение данных между такими дисками, распределение данных между физическими и виртуальными накопителями единого дискового пространства, выделение областей дискового пространства в виде отдельных дисков и др.), практически все файлы хранятся в виде множества отдельных сегментов.\nРеализация данной угрозы возможна при условии недостаточности или отсутствия мер по обеспечению конфиденциальности информации, хранящейся на отдельных накопителях",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Носитель информации, объекты файловой системы",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.086",
        "numeric_id":  86,
        "name":  "Угроза несанкционированного изменения аутентификационной информации",
        "description":  "Угроза заключается в возможности осуществления неправомерного доступа нарушителем к аутентификационной информации других пользователей с помощью штатных средств операционной системы или специальных программных средств.\nДанная угроза обусловлена наличием слабостей мер разграничения доступа к информации аутентификации.\nРеализация данной угрозы может способствовать дальнейшему проникновению нарушителя в систему под учётной записью дискредитированного пользователя",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, объекты файловой системы, учётные данные пользователя, реестр",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.087",
        "numeric_id":  87,
        "name":  "Угроза несанкционированного использования привилегированных функций BIOS",
        "description":  "Угроза заключается в возможности использования нарушителем потенциально опасных возможностей BIOS/UEFI.\nДанная угроза обусловлена наличием в BIOS/UEFI потенциально опасного функционала",
        "violator_source":  "Внешний нарушитель с высоким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Аппаратное обеспечение, микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.088",
        "numeric_id":  88,
        "name":  "Угроза несанкционированного копирования защищаемой информации",
        "description":  "Угроза заключается в возможности неправомерного получения нарушителем копии защищаемой информации путём проведения последовательности неправомерных действий, включающих: несанкционированный доступ к защищаемой информации, копирование найденной информации на съёмный носитель (или в другое место, доступное нарушителю вне системы).\nДанная угроза обусловлена слабостями механизмов разграничения доступа к защищаемой информации и контроля доступа лиц в контролируемой зоне.\nРеализация данной угрозы возможна в случае отсутствия криптографических мер защиты или снятия копии в момент обработки защищаемой информации в нешифрованном виде",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Объекты файловой системы, машинный носитель информации",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.089",
        "numeric_id":  89,
        "name":  "Угроза несанкционированного редактирования реестра",
        "description":  "Угроза заключается в возможности внесения нарушителем изменений в используемый дискредитируемым приложением реестр, которые влияют на функционирование отдельных сервисов приложения или приложения в целом. При этом под реестром понимается не только реестр операционной системы Microsoft Windows, а любой реестр, используемый приложением. Изменение реестра может быть как этапом при осуществлении другого деструктивного воздействия, так и основной целью.\nДанная угроза обусловлена слабостями механизма контроля доступа, заключающимися в присвоении реализующим его программам слишком высоких привилегий при работе с реестром.\nРеализация данной угрозы возможна в случае получения нарушителем прав на работу с программой редактирования реестра",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, использующее реестр, реестр",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.090",
        "numeric_id":  90,
        "name":  "Угроза несанкционированного создания учётной записи пользователя",
        "description":  "Угроза заключается в возможности создания нарушителем в системе дополнительной учётной записи пользователя и её дальнейшего использования в собственных неправомерных целях (входа в систему с правами этой учётной записи и осуществления деструктивных действий по отношению к дискредитированной системе или из дискредитированной системы по отношению к другим системам).\nДанная угроза обусловлена слабостями механизмов разграничения доступа к защищаемой информации.\nРеализация данной угрозы возможна в случае наличия и прав на запуск специализированных программ для редактирования файлов, содержащих сведения о пользователях системы (при удалённом доступе) или штатных средств управления доступом из состава операционной системы (при локальном доступе)",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.091",
        "numeric_id":  91,
        "name":  "Угроза несанкционированного удаления защищаемой информации",
        "description":  "Угроза заключается в возможности причинения нарушителем экономического, информационного, морального и других видов ущерба собственнику и оператору неправомерно удаляемой информации путём осуществления деструктивного программного или физического воздействия на машинный носитель информации.\nДанная угроза обусловлена недостаточностью мер по обеспечению доступности защищаемой информации в системе, а равно и наличием уязвимостей в программном обеспечении, реализующим данные меры.\nРеализация данной угрозы возможна в случае получения нарушителем системных прав на стирание данных или физического доступа к машинному носителю информации на расстояние, достаточное для оказания эффективного деструктивного воздействия",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Метаданные, объекты файловой системы, реестр",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.092",
        "numeric_id":  92,
        "name":  "Угроза несанкционированного удалённого внеполосного доступа к аппаратным средствам",
        "description":  "Угроза заключается в возможности получения нарушителем привилегий управления системой путём использования удалённого внеполосного (по независимому вспомогательному каналу TCP/IP) доступа.\nДанная угроза обусловлена невозможностью контроля за механизмом, реализующего функции удалённого доступа на аппаратном уровне, на уровне операционной системы, а также независимостью от состояния питания аппаратных устройств, т.к. данный механизм предусматривает процедуру удалённого включения/выключения аппаратных устройств.\nРеализация данной угрозы возможна в условиях:\nналичия в системе аппаратного обеспечения, поддерживающего технологию удалённого внеполосного доступа;\nналичия подключения системы к сетям общего пользования (сети Интернет)",
        "violator_source":  "Внешний нарушитель с высоким потенциалом",
        "target_object":  "Информационная система, аппаратное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.093",
        "numeric_id":  93,
        "name":  "Угроза несанкционированного управления буфером",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к данным, содержащимся в буфере обмена, в интересах ознакомления с хранящейся там информацией или осуществления деструктивного программного воздействия на систему (например, переполнение буфера для выполнения произвольного вредоносного кода).\nДанная угроза обусловлена слабостями в механизме разграничения доступа к буферу обмена, а также слабостями в механизмах проверки вводимых данных.\nРеализация данной угрозы возможна в случае осуществления нарушителем успешного несанкционированного доступа к сегменту оперативной памяти дискредитируемого объекта, в котором расположен буфер обмена",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.094",
        "numeric_id":  94,
        "name":  "Угроза несанкционированного управления синхронизацией и состоянием",
        "description":  "Угроза заключается в возможности изменения нарушителем последовательности действий, выполняемых дискредитируемыми приложениями, использующими в своей работе технологии управления процессами на основе текущего времени и состояния информационной системы (например, текущих значений глобальных переменных, наличия запущенных процессов и др.), или в возможности модификации настроек и изменения режимов работы промышленных роботов, приводящих к вмешательству в производственный процесс и хищению хранящейся в памяти роботов информации (исходного кода, параметров продукции и др.).\nДанная угроза основана на слабостях механизма управления синхронизацией и состоянием, позволяющих нарушителю вносить изменения в его работу в определённые промежутки времени, или отсутствии механизмов аутентификации и авторизации.\nРеализация данной угрозы возможна при условии наличия у нарушителя возможности:\nконтролировать состояние дискредитируемого приложения (этапы выполнения алгоритма) или промышленных роботов;\nотслеживать моменты времени, когда дискредитируемое приложение временно прерывает свою работу с глобальными данными;\nвыполнить деструктивные действия в определённые моменты времени (например, внести изменения в файл с данными или изменить содержимое ячейки памяти)",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.095",
        "numeric_id":  95,
        "name":  "Угроза несанкционированного управления указателями",
        "description":  "Угроза заключается в возможности выполнения нарушителем произвольного вредоносного кода от имени дискредитируемого приложения или приведения дискредитируемого приложения в состояние «отказ в обслуживании» путём изменения указателей на ячейки памяти, содержащие определённые данные, используемые дискредитируемым приложением.\nДанная угроза связана с уязвимостями в средствах разграничения доступа к памяти и контроля целостности содержимого ячеек памяти.\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий на изменение указателей, используемых дискредитируемым приложением",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.096",
        "numeric_id":  96,
        "name":  "Угроза несогласованности политик безопасности элементов облачной инфраструктуры",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивных программных воздействий как в отношении поставщиков, так и потребителей облачных услуг.\nДанная угроза обусловлена недостаточностью проработки вопроса управления политиками безопасности элементов облачной инфраструктуры вследствие значительной распределённости облачной инфраструктуры.\nРеализация данной угрозы возможна при условии использования различных политик безопасности, несогласованных между собой (например, одно средство защиты может отказать в доступе, а другое – предоставить доступ)",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, облачная система",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.097",
        "numeric_id":  97,
        "name":  "Угроза несогласованности правил доступа к большим данным",
        "description":  "Угроза заключается в возможности предоставления ошибочного неправомерного доступа к защищаемой информации или, наоборот, возможности отказа в доступе к защищаемой информации легальным пользователям в силу ошибок, допущенных при делегировании им привилегий другими легальными пользователями хранилища больших данных.\nДанная угроза обусловлена недостаточностью мер по разграничению и согласованию доступа к информации различных пользователей в хранилище больших данных.\nРеализация данной угрозы возможна при условии использования различных политик безопасности, несогласованных между собой (например, одно средство защиты может отказать в доступе, а другое – предоставить доступ)",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Хранилище больших данных",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.098",
        "numeric_id":  98,
        "name":  "Угроза обнаружения открытых портов и идентификации привязанных к ним сетевых служб",
        "description":  "Угроза заключается в возможности определения нарушителем состояния сетевых портов дискредитируемой системы (т.н. сканирование портов) для получения сведений о возможности установления соединения с дискредитируемой системой по данным портам, конфигурации самой системы и установленных средств защиты информации, а также других сведений, позволяющих нарушителю определить по каким портам деструктивные программные воздействия могут быть осуществлены напрямую, а по каким – только с использованием специальных техник обхода межсетевых экранов.\nДанная угроза связана с уязвимостями и ошибками конфигурирования средств межсетевого экранирования и фильтрации сетевого трафика, используемых в дискредитируемой системе.\nРеализация данной угрозы возможна при условии наличия у нарушителя подключения к дискредитируемой вычислительной сети и специализированного программного обеспечения, реализующего функции сканирования портов и анализа сетевого трафика",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.099",
        "numeric_id":  99,
        "name":  "Угроза обнаружения хостов",
        "description":  "Угроза заключается в возможности сканирования нарушителем вычислительной сети для выявления работающих сетевых узлов. \nДанная угроза связана со слабостями механизмов сетевого взаимодействия, предоставляющих клиентам сети открытую техническую информацию о сетевых узлах, а также с уязвимостями и ошибками конфигурирования средств межсетевого экранирования и фильтрации сетевого трафика, используемых в дискредитируемой системе.\nРеализация данной угрозы возможна при условии наличия у нарушителя подключения к дискредитируемой вычислительной сети и специализированного программного обеспечения, реализующего функции анализа сетевого трафика",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.100",
        "numeric_id":  100,
        "name":  "Угроза обхода некорректно настроенных механизмов аутентификации",
        "description":  "Угроза заключается в возможности получения нарушителем привилегий в системе без прохождения процедуры аутентификации за счёт выполнения действий, нарушающих условия корректной работы средств аутентификации (например, ввод данных неподдерживаемого формата).\nДанная угроза обусловлена в случае некорректных значений параметров конфигурации средств аутентификации и/или отсутствием контроля входных данных.\nРеализация данной угрозы возможна при условии наличия ошибок в заданных значениях параметров настройки механизмов аутентификации",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.101",
        "numeric_id":  101,
        "name":  "Угроза общедоступности облачной инфраструктуры",
        "description":  "Угроза заключается в возможности осуществления несанкционированного доступа к защищаемой информации одного потребителя облачных услуг со стороны другого.\nДанная угроза обусловлена тем, что из-за особенностей облачных технологий потребителям облачных услуг приходится совместно использовать одну и ту же облачную инфраструктуру.\nРеализация данной угрозы возможна в случае допущения ошибок при разделении элементов облачной инфраструктуры между потребителями облачных услуг, а также при изоляции их ресурсов и обособлении данных друг от друга",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Объекты файловой системы, аппаратное обеспечение, облачный сервер",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.102",
        "numeric_id":  102,
        "name":  "Угроза опосредованного управления группой программ через совместно используемые данные",
        "description":  "Угроза заключается в возможности опосредованного изменения нарушителем алгоритма работы группы программ, использующих одновременно общие данные, через перехват управления над одной из них (ячейки оперативной памяти, глобальные переменные, файлы конфигурации и др.).\nДанная угроза обусловлена наличием слабостей в механизме контроля внесённых изменений в общие данные каждой из программ в группе.\nРеализация данной угрозы возможна в случае успешного перехвата нарушителем управления над одной из программ в группе программ, использующих общие данные",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.103",
        "numeric_id":  103,
        "name":  "Угроза определения типов объектов защиты",
        "description":  "Угроза заключается в возможности проведения нарушителем анализа выходных данных дискредитируемой системы с помощью метода, позволяющего определить точные значения параметров и свойств, однозначно присущих дискредитируемой системе (данный метод известен как «fingerprinting», с англ. «дактилоскопия»). Использование данного метода не наносит прямого вреда дискредитируемой системе. Однако сведения, собранные таким образом, позволяют нарушителю выявить слабые места дискредитируемой системы, которые могут быть использованы в дальнейшем при реализации других угроз.\nДанная угроза обусловлена ошибками в параметрах конфигурации средств межсетевого экранирования, а также с отсутствием механизмов контроля входных и выходных данных.\nРеализация данной угрозы возможна в случае наличия у нарушителя сведений о взаимосвязи выходных данных с конфигурацией дискредитируемой системы (документация на программные средства, стандарты передачи данных, спецификации и т.п.)",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.104",
        "numeric_id":  104,
        "name":  "Угроза определения топологии вычислительной сети",
        "description":  "Угроза заключается в возможности определения нарушителем состояния сетевых узлов дискредитируемой системы (т.н. сканирование сети) для получения сведений о топологии дискредитируемой вычислительной сети, которые могут быть использованы в дальнейшем при попытках реализации других угроз.\nДанная угроза связана со слабостями механизмов сетевого взаимодействия, предоставляющих клиентам сети открытую техническую информацию о сетевых узлах, а также с уязвимостями средств межсетевого экранирования (алгоритма работы и конфигурации правил фильтрации сетевого трафика).\nРеализация данной угрозы возможна в случае наличия у нарушителя возможности подключения к исследуемой вычислительной сети и наличием специализированного программного обеспечения, реализующего функцию анализа сетевого трафика",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.105",
        "numeric_id":  105,
        "name":  "Угроза отказа в загрузке входных данных неизвестного формата хранилищем больших данных",
        "description":  "Угроза заключается в возможности отказа хранилищем больших данных в приёме входных данных неизвестного формата от легального пользователя.\nДанная угроза обусловлена отсутствием в хранилище больших данных механизма самостоятельной (автоматической) адаптации к новым форматам данных.\nРеализация данной угрозы возможна при условии поступления запроса на загрузку в хранилище входных данных неизвестного формата",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Хранилище больших данных, метаданные",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.106",
        "numeric_id":  106,
        "name":  "Угроза отказа в обслуживании системой хранения данных суперкомпьютера",
        "description":  "Угроза заключается в возможности значительного замедления работы терминальных сессий всех пользователей суперкомпьютера, вплоть до достижения всем суперкомпьютером состояния «отказ в обслуживании» при превышении максимально достижимой нагрузки на параллельную файловую систему суперкомпьютера.\nДанная угроза обусловлена значительным повышением числа и объёма сохраняемых на накопитель данных для некоторых вычислительных задач.\nРеализация данной угрозы возможна при условии интенсивного файлового ввода-вывода в кластерной файловой подсистеме суперкомпьютера, основанной на использовании параллельной файловой системы",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Система хранения данных суперкомпьютера",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.107",
        "numeric_id":  107,
        "name":  "Угроза отключения контрольных датчиков",
        "description":  "Угроза заключается в возможности обеспечения нарушителем информационной изоляции системы безопасности путём прерывания канала связи с контрольными датчиками, следящими за параметрами состояния системы, или нарушения работы самих датчиков. При этом система перестанет реагировать как на инциденты безопасности (если отключённые датчики являлись частью системы безопасности, например, датчики движения), так и на другие типы инцидентов (например, при отключении датчиков пожарной сигнализации, повышения давления в гидроагрегатах и др.).\nДанная угроза обусловлена слабостями мер защиты информации в автоматизированных системах управления технологическими процессами, а также наличием уязвимостей в программном обеспечении, реализующим данные меры.\nРеализация данной угрозы возможна при условии получения доступа (физического или программного) к линиям связи системы безопасности с контрольными датчиками или к самим датчикам",
        "violator_source":  "Внешний нарушитель с высоким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.108",
        "numeric_id":  108,
        "name":  "Угроза ошибки обновления гипервизора",
        "description":  "Угроза заключается в возможности дискредитации нарушителем функционирующих на базе гипервизора защитных механизмов, предотвращающих несанкционированный доступ к образам виртуальных машин, из-за ошибок его обновления.\nДанная угроза обусловлена зависимостью функционирования каждого виртуального устройства и каждого виртуализированного субъекта доступа, а также всей виртуальной инфраструктуры (или её части, если используется более одного гипервизора) от работоспособности гипервизора.\nРеализация данной угрозы возможна при условии возникновения ошибок в процессе обновления гипервизора:\nсбоев в процессе его обновления;\nобновлений, в ходе которых внедряются новые ошибки в код гипервизора;\nобновлений, в ходе которых в гипервизор внедряется программный код, вызывающий несовместимость гипервизора со средой его функционирования;\nдругих инцидентов безопасности информации",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, гипервизор",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.109",
        "numeric_id":  109,
        "name":  "Угроза перебора всех настроек и параметров приложения",
        "description":  "Угроза заключается в возможности получения нарушителем доступа к дополнительному скрытому функционалу (информация о котором не была опубликована разработчиком) или приведению системы в состояние «отказ в обслуживании» при задании нарушителем некоторых параметров конфигурации программы, достигая таких значений параметров путём перебора всех возможных комбинаций.\nДанная угроза обусловлена уязвимостями программного обеспечения, проявляющимися при его неправильной конфигурации.\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий на изменение конфигурации программного обеспечения. При реализации данной угрозы, в отличии от других подобных угроз, нарушитель действует «вслепую» – простым путём перебора всевозможных комбинаций",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, реестр",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.110",
        "numeric_id":  110,
        "name":  "Угроза перегрузки грид-системы вычислительными заданиями",
        "description":  "Угроза заключается в возможности снижения пропускной способность ресурсных центров при отправке большого количества заданий одним пользователем (нарушителем) случайно или намеренно, что может сделать невозможной постановку заданий другими пользователями грид-системы в очередь на выполнение.\nДанная угроза обусловлена слабостями мер по контролю в грид-системе за количеством вычислительных заданий, запускаемых пользователями грид-системы.\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на постановку заданий в очередь на выполнение грид-системой",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Ресурсные центры грид-системы",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.111",
        "numeric_id":  111,
        "name":  "Угроза передачи данных по скрытым каналам",
        "description":  "Угроза заключается в возможности осуществления нарушителем неправомерного вывода защищаемой информации из системы, а также передаче управляющих команд путём её нестандартного (незаметного, скрытого) размещения в легитимно передаваемых по сети (или сохраняемых на отчуждаемые носители) открытых данных путём её маскирования под служебные протоколы, сокрытия в потоке других данных (стеганография), использования скрытых пикселей («пикселей отслеживания») и т.п.\nДанная угроза обусловлена недостаточностью мер защиты информации от утечки, а также контроля потоков данных.\nРеализация данной угрозы возможна при:\nналичии у нарушителя прав в дискредитируемой системе на установку специализированного программного обеспечения, реализующего функции внедрения в пакеты данных, формируемых для передачи в системе, собственной информации;\nдоступа к каналам передачи данных;\nпосещении пользователем сайтов в сети Интернет и открытия электронных писем, содержащих скрытые пиксели",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.112",
        "numeric_id":  112,
        "name":  "Угроза передачи запрещённых команд на оборудование с числовым программным управлением",
        "description":  "Угроза заключается в возможности повреждения нарушителем исполнительных механизмов, заготовки и (или) обрабатывающего инструмента оборудования с числовым программным управлением путём передачи на него команд, приводящих к перемещению обрабатывающего инструмента за допустимые пределы (т.е. команд, запрещённых для оборудования с числовым программным управлением).\nДанная угроза обусловлена слабостями мер по защите оборудования с числовым программным управлением от выполнения запрещённых команд.\nРеализация данной угрозы возможна при наличии у нарушителя привилегий на передачу команд на оборудование с числовым программным управлением или возможности изменения команд, передаваемых легальным пользователем",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.113",
        "numeric_id":  113,
        "name":  "Угроза перезагрузки аппаратных и программно-аппаратных средств вычислительной техники",
        "description":  "Угроза заключается в возможности сброса пользователем (нарушителем) состояния оперативной памяти (обнуления памяти) путём случайного или намеренного осуществления перезагрузки отдельных устройств, блоков или системы в целом.\nДанная угроза обусловлена свойством оперативной памяти обнулять своё состояние при выключении и перезагрузке.\nРеализация данной угрозы возможна как аппаратным способом (нажатием кнопки), так и программным (локально или удалённо) при выполнении следующих условий:\nналичие в системе открытых сессий работы пользователей;\nналичие у нарушителя прав в системе (или физической возможности) на осуществление форсированной перезагрузки",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, аппаратное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.114",
        "numeric_id":  114,
        "name":  "Угроза переполнения целочисленных переменных",
        "description":  "Угроза заключается в возможности приведения нарушителем дискредитируемого приложения к сбоям в работе путём подачи на его входные интерфейсы данных неподдерживаемого формата или выполнения с его помощью операции, в результате которой будут получены данные неподдерживаемого дискредитируемым приложением формата.\nДанная угроза обусловлена уязвимостями программного обеспечения, связанными с недостаточной проверкой такими приложениями корректности входных данных, а также тем, что операторы любого программного обеспечения способны правильно обрабатывать только определённые типы данных (например, только целые или только положительные числа).\nРеализация данной угрозы возможна при условии наличия у нарушителя:\nсведений о номенклатуре поддерживаемых дискредитируемым приложением форматов входных (или обрабатываемых) данных;\nвозможности взаимодействия с входным интерфейсом дискредитируемого приложения",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.115",
        "numeric_id":  115,
        "name":  "Угроза перехвата вводимой и выводимой на периферийные устройства информации",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информации, вводимой и выводимой на периферийные устройства, путём перехвата данных, обрабатываемых контроллерами периферийных устройств.\nДанная угроза обусловлена недостаточностью мер защиты информации от утечки и контроля потоков данных, а также невозможностью осуществления защиты вводимой и выводимой на периферийные устройства информации с помощью криптографических средств (т.к. представление пользователям системы информации должно осуществляться в доступном для понимания виде).\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий на установку и запуск специализированных вредоносных программ, реализующих функции «клавиатурных шпионов» (для получения нарушителем паролей пользователей), виртуальных драйверов принтеров (перехват документов, содержащих защищаемую информацию) и др.",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, аппаратное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.116",
        "numeric_id":  116,
        "name":  "Угроза перехвата данных, передаваемых по вычислительной сети",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к сетевому трафику дискредитируемой вычислительной сети в пассивном («прослушивание» трафика) или активном (подмена пакетов, изменение их содержимого) режиме для сбора и анализа сведений (например, аутентификационной информации), которые могут быть использованы в дальнейшем для реализации других угроз, оставаясь при реализации данной угрозы невидимым (скрытным) получателем перехватываемых данных. Кроме того, нарушитель может проводить исследования других типов потоков данных, например, радиосигналов.\nДанная угроза обусловлена слабостями механизмов сетевого взаимодействия, предоставляющими сторонним пользователям открытые данные о дискредитируемой системе, а также ошибками конфигурации сетевого программного обеспечения.\nРеализация данной угрозы возможна в следующих условиях:\nналичие у нарушителя доступа к дискредитируемой вычислительной сети;\nнеспособность технологий, с помощью которых реализована передача данных, предотвратить возможность осуществления скрытного прослушивания потока данных",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.117",
        "numeric_id":  117,
        "name":  "Угроза перехвата привилегированного потока",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к потоку данных, созданного приложением с дополнительными привилегиями (к привилегированному потоку данных), путём синхронного (вызов привилегированной функции, возвращающей неправильное значение) или асинхронного (создание обратных вызовов, манипулирование указателями и т.п.) деструктивного программного воздействия на него.\nДанная угроза обусловлена уязвимостями программного обеспечения, использующего в своей работе участки кода, исполняемого с дополнительными правами, наследуемыми создаваемыми привилегированными потоками (наличие ошибочных указателей, некорректное освобождение памяти и т.п.).\nРеализация данной угрозы возможна в следующих условиях:\nв дискредитируемом приложении существуют участки кода, требующие исполнения с правами, превышающими права обычных пользователей;\nнарушитель обладает привилегиями, позволяющими вносить изменения во входные данные дискредитируемого приложения",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.118",
        "numeric_id":  118,
        "name":  "Угроза перехвата привилегированного процесса",
        "description":  "Угроза заключается в возможности получения нарушителем права управления процессом, обладающим высокими привилегиями (например, унаследованными от пользователя или группы пользователей, выполняющих роль администраторов дискредитируемой системы), для выполнения произвольного вредоносного кода с правами дискредитированного процесса.\nДанная угроза обусловлена уязвимостями программного обеспечения, выполняющего функции разграничения доступа (в алгоритме или параметрах конфигурации), приводящими к некорректному распределению прав доступа внутри древа наследуемых процессов.\nРеализация данной угрозы возможна при выполнении одного из условий:\nуспешного введения нарушителем некорректных данных, приводящих к переполнению буфера или к реализации некоторых типов программных инъекций;\nналичия у нарушителя привилегий на запуск системных утилит, предназначенных для управления процессами",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.119",
        "numeric_id":  119,
        "name":  "Угроза перехвата управления гипервизором",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информационным, программным и вычислительным ресурсам, зарезервированным и управляемым гипервизором, за счёт получения нарушителем права управления гипервизором путём эксплуатации уязвимостей консоли управления гипервизором.\nДанная угроза обусловлена наличием у консоли управления гипервизором программных интерфейсов взаимодействия с другими субъектами доступа (процессами, программами) и, как следствие, возможностью несанкционированного доступа к данной консоли (программа уровня виртуализации), а также недостаточностью мер по разграничению доступа к данной консоли.\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на осуществление взаимодействия с консолью управления гипервизором",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, гипервизор, консоль управления гипервизором",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.120",
        "numeric_id":  120,
        "name":  "Угроза перехвата управления средой виртуализации",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информационным, программным и вычислительным ресурсам, зарезервированным и управляемым всеми гипервизорами, реализующими среду виртуализации, за счёт получения нарушителем права управления этими гипервизорами путём эксплуатации уязвимостей консоли средства управления виртуальной инфраструктурой.\nДанная угроза обусловлена наличием у консоли средства управления виртуальной инфраструктурой, реализуемого в рамках одной из виртуальных машин, программных интерфейсов взаимодействия с другими субъектами доступа (процессами, программами) и, как следствие, возможностью несанкционированного доступа к данной консоли (программа уровня управления виртуализации), а также недостаточностью мер по разграничению доступа к данной консоли.\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на осуществление взаимодействия с консолью средства управления виртуальной инфраструктурой",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Информационная система, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.121",
        "numeric_id":  121,
        "name":  "Угроза повреждения системного реестра",
        "description":  "Угроза заключается в возможности нарушения доступности части функционала или всей информационной системы из-за повреждения используемого в её работе реестра вследствие некорректного завершения работы операционной системы (неконтролируемая перезагрузка, возникновения ошибок в работе драйверов устройств и т.п.), нарушения целостности файлов, содержащих в себе данные реестра, возникновения ошибок файловой системы носителя информации или вследствие осуществления нарушителем деструктивного программного воздействия на файловые объекты, содержащие реестр.\nДанная угроза обусловлена слабостями мер контроля доступа к файлам, содержащим данные реестра, мер резервирования и контроля целостности таких файлов, а также мер восстановления работоспособности реестра из-за сбоев в работе операционной системы.\nРеализация данной угрозы возможна при одном из условий:\nвозникновения ошибок в работе отдельных процессов или всей операционной системы;\nналичии у нарушителя прав доступа к реестру или файлам, содержащим в себе данные реестра",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Объекты файловой системы, реестр",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.122",
        "numeric_id":  122,
        "name":  "Угроза повышения привилегий",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на дискредитируемый процесс (или систему) или на другие процессы (или системы) от его (её) имени путём эксплуатации неправомерно полученных нарушителем дополнительных прав на управление дискредитированным объектом.\nДанная угроза обусловлена уязвимостями программного обеспечения, выполняющего функции разграничения доступа (в алгоритме или параметрах конфигурации).\nРеализация данной угрозы возможна при наличии у нарушителя программного обеспечения (типа «эксплойт»), специально разработанного для реализации данной угрозы в дискредитируемой системе",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, сетевое программное обеспечение, информационная система",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.123",
        "numeric_id":  123,
        "name":  "Угроза подбора пароля BIOS",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к настройкам BIOS/UEFI путём входа в консоль BIOS/UEFI по паролю, подобранному программно или «вручную» с помощью методов тотального перебора вариантов или подбора по словарю.\nДанная угроза обусловлена слабостями механизма аутентификации, реализуемого в консолях BIOS/UEFI.\nРеализация данной угрозы возможна в одном из следующих случаев:\nнарушитель может осуществить физический доступ к компьютеру и имеет возможность его перезагрузить;\nнарушитель обладает специальным программным средством перебора паролей BIOS/UEFI и привилегиями в системе на установку и запуск таких средств",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.124",
        "numeric_id":  124,
        "name":  "Угроза подделки записей журнала регистрации событий",
        "description":  "Угроза заключается в возможности внесения нарушителем изменений в журналы регистрации событий безопасности дискредитируемой системы (удаление компрометирующих нарушителя записей или подделка записей о не произошедших событиях) для введения в заблуждение её администраторов или сокрытия следов реализации других угроз.\nДанная угроза обусловлена недостаточностью мер по разграничению доступа к журналу регистрации событий безопасности.\nРеализация данной угрозы возможна в одном из следующих случаев:\nтехнология ведения журналов регистрации событий безопасности предполагает возможность их редактирования и нарушитель обладает необходимыми для этого привилегиями;\nтехнология ведения журналов регистрации событий безопасности не предполагает возможность их редактирования, но нарушитель обладает привилегиями, необходимыми для осуществления записи в файлы журналов, а также специальными программными средствами, способными обрабатывать файлы журналов используемого в дискредитируемой системе формата",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.125",
        "numeric_id":  125,
        "name":  "Угроза подключения к беспроводной сети в обход процедуры аутентификации",
        "description":  "Угроза заключается в возможности осуществления нарушителем перехвата трафика беспроводной сети или других неправомерных действий путём легализации нарушителем собственного подключения к беспроводной сети в полуавтоматическом режиме (например, WPS) без ввода ключа шифрования.\nДанная угроза обусловлена слабостями процедуры аутентификации беспроводных устройств в ходе полуавтоматического подключения.\nРеализация данной угрозы возможна при условии наличия у нарушителя физического доступа к беспроводной точке доступа, поддерживающей полуавтоматический режим подключения",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.126",
        "numeric_id":  126,
        "name":  "Угроза подмены беспроводного клиента или точки доступа",
        "description":  "Угроза заключается в возможности получения нарушителем аутентификационной или другой защищаемой информации, передаваемой в ходе автоматического подключения точек беспроводного доступа или клиентского программного обеспечения к доверенным субъектам сетевого взаимодействия, подменённым нарушителем.\nДанная угроза обусловлена слабостями механизма аутентификации субъектов сетевого взаимодействия при беспроводном доступе.\nРеализация данной угрозы возможна в случае размещения нарушителем клиента или точки беспроводного доступа со специально сформированными параметрами работы (такими как MAC-адрес, название, используемый стандарт передачи данных и т.п.) в зоне доступности для дискредитируемых устройств беспроводного доступа",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, аппаратное обеспечение, точка беспроводного доступа",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.127",
        "numeric_id":  127,
        "name":  "Угроза подмены действия пользователя путём обмана",
        "description":  "Угроза заключается в возможности нарушителя выполнения неправомерных действий в системе от имени другого пользователя с помощью методов социальной инженерии (обмана пользователя, навязывание ложных убеждений) или технических методов (использование прозрачных кнопок, подмена надписей на элементах управления и др.)\nДанная угроза обусловлена слабостями интерфейса взаимодействия с пользователем или ошибками пользователя.\nРеализация данной угрозы возможна при условии наличия у дискредитируемого пользователя прав на проведение нужных от него нарушителю операций",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.128",
        "numeric_id":  128,
        "name":  "Угроза подмены доверенного пользователя",
        "description":  "Угроза заключается в возможности нарушителя выдавать себя за легитимного пользователя и выполнять приём/передачу данных от его имени. Данную угрозу можно охарактеризовать как «имитация действий клиента».\nДанная угроза обусловлена слабостями технологий сетевого взаимодействия, зачастую не позволяющими выполнить проверку подлинности источника/получателя информации.\nРеализация данной угрозы возможна при наличии у нарушителя подключения к вычислительной сети, а также сведений о конфигурации сетевых устройств, типе используемого программного обеспечения и т.п.",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.129",
        "numeric_id":  129,
        "name":  "Угроза подмены резервной копии программного обеспечения BIOS",
        "description":  "Угроза заключается в возможности опосредованного внедрения нарушителем в BIOS/UEFI дискредитируемого компьютера вредоносного кода, путём ожидания или создания необходимости выполнения процедуры восстановления предыдущей версии программного обеспечения BIOS/UEFI, предварительно подменённой нарушителем.\nДанная угроза обусловлена недостаточностью мер разграничения доступа и контроля целостности резервных копий программного обеспечения BIOS/UEFI.\nРеализация данной угрозы возможна в следующих условиях:\nнарушитель успешно подменил резервную копию программного обеспечения BIOS/UEFI;\nвозникла необходимость восстановления предыдущей версии программного обеспечения BIOS/UEFI (данное условие может произойти как случайно, так и быть спровоцировано нарушителем)",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное и аппаратное обеспечение BIOS/UEFI",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.130",
        "numeric_id":  130,
        "name":  "Угроза подмены содержимого сетевых ресурсов",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к защищаемым данным пользователей сети или проведения различных мошеннических действий путём скрытной подмены содержимого хранящихся (сайты, веб-страницы) или передаваемых (электронные письма, сетевые пакеты) по сети данных.\nДанная угроза обусловлена слабостями технологий сетевого взаимодействия, зачастую не позволяющими выполнить проверку подлинности содержимого электронного сообщения.\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на доступ к сетевым ресурсам и отсутствии у пользователя сети мер по обеспечению их целостности",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Прикладное программное обеспечение, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.131",
        "numeric_id":  131,
        "name":  "Угроза подмены субъекта сетевого доступа",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к защищаемым данным пользователей сети или проведения различных мошеннических действий путём скрытной подмены в отправляемых дискредитируемым пользователем сетевых запросах сведений об отправителе сообщения. Данную угрозу можно охарактеризовать как «имитация действий сервера».\nДанная угроза обусловлена слабостями технологий сетевого взаимодействия, зачастую не позволяющими выполнить проверку подлинности источника информации.\nРеализация данной угрозы возможна при условии успешной выдачи себя нарушителем за законного отправителя (например, с помощью ложных фишинговых веб-сайтов). Ключевое отличие от «угрозы подмены содержимого сетевых ресурсов» заключается в том, что в данном случае нарушитель не изменяет оригинального содержимого электронного ресурса (веб-сайта, электронного письма), а только служебные сведения",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Прикладное программное обеспечение, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.132",
        "numeric_id":  132,
        "name":  "Угроза получения предварительной информации об объекте защиты",
        "description":  "Угроза заключается в возможности раскрытия нарушителем защищаемых сведений о состоянии защищённости дискредитируемой системы, её конфигурации и потенциальных уязвимостях и др., путём проведения мероприятий по сбору и анализу доступной информации о системе.\nДанная угроза обусловлена наличием уязвимостей в сетевом программном обеспечении, позволяющим получить сведения о конфигурации отдельных программ или системы в целом (отсутствие контроля входных данных, наличие открытых сетевых портов, неправильная настройка политик безопасности и т.п.).\nРеализация данной угрозы возможна при условии получения информации о дискредитируемой системе с помощью хотя бы одного из следующих способов изучения дискредитируемой системы:\nанализ реакций системы на сетевые (в т.ч. синтаксически неверные или нестандартные) запросы к открытым в системе сетевым сервисам, которые могут стать причиной вызова необработанных исключений с подробными сообщениями об ошибках, содержащих защищаемую информацию (о трассировке стека, о конфигурации системы, о маршруте прохождения сетевых пакетов)\nанализ реакций системы на строковые URI-запросы (в т.ч. неверные SQL-запросы, альтернативные пути доступа к файлам).\nДанная угроза отличается от угрозы перехвата данных и других угроз сбора данных тем, что нарушитель активно опрашивает дискредитируемую систему, а не просто за ней наблюдает",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение, сетевой трафик, прикладное программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.133",
        "numeric_id":  133,
        "name":  "Угроза получения сведений о владельце беспроводного устройства",
        "description":  "Угроза заключается в возможности раскрытия нарушителем сведений о географических перемещениях дискредитируемого пользователя в определённые промежутки времени, в том числе выявить место его работы, проживания и т.п. Получение таких сведений может использоваться нарушителем в дальнейшем для реализации угроз в информационных системах, доступ к которым имеет дискредитируемый пользователь.\nДанная угроза обусловлена слабостью защиты идентификационной информации беспроводных точек доступа при их подключении к сети Интернет.\nРеализация данной угрозы возможна при условии наличия у нарушителя доступа к идентификационными данным стационарных точек беспроводного доступа, с которыми в автоматическом режиме осуществляет взаимодействие беспроводное устройство дискредитируемого пользователя",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, метаданные",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.134",
        "numeric_id":  134,
        "name":  "Угроза потери доверия к поставщику облачных услуг",
        "description":  "Угроза заключается в возможности снижения уровня защищённости и допущения дополнительных ошибок в обеспечении безопасности защищаемой в облачной системе информации из-за невосполнимого оттока у поставщика облачных услуг необходимых ресурсов в связи с потерей потребителями облачных услуг доверия к их поставщику.\nДанная угроза обусловлена тем, что из-за обнародования фактов об инцидентах информационной безопасности, связанных с поставщиком облачных услуг, происходит потеря доверия к такому поставщику со стороны потребителей облачных услуг, и, как следствие, возникает необходимость лавинообразного выделения поставщиком облачных услуг ресурсов (человеческих, технических, финансовых) для решения возникающих в данной ситуации задач (множественные консультации пользователей, экстренный пересмотр политик безопасности, модернизация системы защиты и др.), что не только может вызвать нехватку ресурсов для обеспечения текущего уровня защищённости информации, но и спровоцировать допуск «в спешке» новых ошибок.\nРеализация данной угрозы возможна в случае обнародования единичных или множественных фактов об инцидентах информационной безопасности, связанных с поставщиком облачных услуг, повлёкших значительные убытки для его клиентов",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Объекты файловой системы, информационная система, иммигрированная в облако",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.135",
        "numeric_id":  135,
        "name":  "Угроза потери и утечки данных, обрабатываемых в облаке",
        "description":  "Угроза заключается в возможности нарушения конфиденциальности, целостности и доступности защищаемой информации потребителей облачных услуг, обрабатываемой в облачной системе.\nДанная угроза обусловлена слабостями мер защиты информации, обрабатываемой в облачной системе.\nРеализация данной угрозы возможна в случае допущения поставщиком (некорректный выбор или настройка средств защиты) или потребителем (потеря пароля, электронного ключа, вход с небезопасной консоли) облачных услуг ошибок при обеспечении безопасности защищаемой информации",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, метаданные, объекты файловой системы",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.136",
        "numeric_id":  136,
        "name":  "Угроза потери информации вследствие несогласованности работы узлов хранилища больших данных",
        "description":  "Угроза заключается в возможности допуска ошибок при копировании защищаемой информации при распределённом хранении данных на различных узлах хранилища больших данных вследствие несогласованности их работы, влекущих за собой невозможность осуществления легальным пользователем доступа к блокам или ко всей защищаемой информации.\nДанная угроза обусловлена слабостями механизмов репликации данных, реализованных в узлах хранилища больших данных.\nРеализация данной угрозы возможна в условиях отключения или выведения из строя одного или нескольких узлов за счёт специальных программных воздействий на узлы хранилища больших данных, а также возникновения технических или программных сбоев в работе их компонентов",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, узлы хранилища больших данных",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.137",
        "numeric_id":  137,
        "name":  "Угроза потери управления облачными ресурсами",
        "description":  "Угроза заключается в возможности нарушения договорных обязательств со стороны поставщика облачных услуг в отношении их потребителя из-за значительной сложности построения эффективной системы управления облачными ресурсами облачной системы, особенно использующей облачные ресурсы других поставщиков облачных услуг.\nДанная угроза обусловлена сложностью определения логического и физического местоположения облачных ресурсов, недостаточностью мер физического контроля доступа к хранилищам данных, резервного копирования и др., а также необходимостью учёта особенностей законодательства в области защиты информации стран, резидентами которых являются поставщики облачных услуг, выполняющих роль субподрядчиков по оказанию заказанных облачных услуг.\nРеализация данной угрозы возможна при условии, что выполнение требований к функционалу облачной системы затрудняется (или становится невозможным) из-за правовых норм других стран, участвующих в трансграничной передаче облачного трафика",
        "violator_source":  "Внешний нарушитель с высоким потенциалом",
        "target_object":  "Сетевой трафик, объекты файловой системы",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.138",
        "numeric_id":  138,
        "name":  "Угроза потери управления собственной инфраструктурой при переносе её в облако",
        "description":  "Угроза заключается в возможности допуска ошибок в управлении инфраструктурой системы потребителя облачных услуг, иммигрированной в облако, со стороны поставщика облачных услуг из-за отсутствия у него сведений об особенностях управления конкретной системы, а также из-за отсутствия у потребителя облачных услуг, обладающего такими сведениями, возможности проводить весь комплекс работ по управлению инфраструктурой собственной системы в связи с её иммиграцией в облако.\nДанная угроза обусловлена невозможностью достоверной оценки потребителем облачных услуг реального уровня защищённости, обеспечиваемого поставщиком облачных услуг в отношении защищаемой информации потребителя облачных услуг, в связи с закрытостью для потребителей сведений о применяемых поставщиком облачных услуг технологиях, программных и технических решениях, а также конкретных параметрах настроек средств защиты информации.\nРеализация данной угрозы возможна в случаях передачи поставщику облачных услуг части функций управления системой потребителя облачных услуг (при миграции части или всей системы в облако)",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Информационная система, иммигрированная в облако, системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.139",
        "numeric_id":  139,
        "name":  "Угроза преодоления физической защиты",
        "description":  "Угроза заключается в возможности осуществления нарушителем практически любых деструктивных действий в отношении дискредитируемой информационной системы при получении им физического доступа к аппаратным средствам вычислительной техники системы путём преодоления системы контроля физического доступа, организованной в здании предприятия.\nДанная угроза обусловлена уязвимостями в системе контроля физического доступа (отсутствием замков в помещении, ошибками персонала и т.п.).\nРеализация данной угрозы возможна при условии успешного применения нарушителем любого из методов проникновения на объект (обман персонала, взлом замков и др.)",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Сервер, рабочая станция, носитель информации, аппаратное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.140",
        "numeric_id":  140,
        "name":  "Угроза приведения системы в состояние «отказ в обслуживании»",
        "description":  "Угроза заключается в возможности отказа дискредитированной системой в доступе легальным пользователям при лавинообразном увеличении числа сетевых соединений с данной системой или при использовании недостатков реализации сетевых протоколов.\nДанная угроза обусловлена тем, что для обработки каждого сетевого запроса системой потребляется часть её ресурсов, а также слабостями сетевых технологий, связанными с ограниченностью скорости обработки потоков сетевых запросов, и недостаточностью мер контроля за управлением соединениями и ошибками реализации сетевых протоколов.\nРеализация данной угрозы возможна при условии превышения объёма запросов над объёмами доступных для их обработки ресурсов дискредитируемой системы или наличия ошибок реализации сетевых протоколов (например, формирование IP-адреса версии 6 на основе MAC-адреса, определение доступности IP-адреса, использование функции контроля целостности PPP-интерфейса и др.)",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, сетевой узел, системное программное обеспечение, сетевое программное обеспечение, сетевой трафик, телекоммуникационное устройство",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.141",
        "numeric_id":  141,
        "name":  "Угроза привязки к поставщику облачных услуг",
        "description":  "Угроза заключается в возможности возникновения трудно решаемых (или даже неразрешимых) проблем технического, организационного, юридического или другого характера, препятствующих осуществлению потребителем облачных услуг смены их поставщика.\nДанная угроза обусловлена отсутствием совместимости между форматами данных и программными интерфейсами, используемыми в облачных инфраструктурах различных поставщиков облачных услуг.\nРеализация данной угрозы возможна при условии использования поставщиком облачных услуг нестандартного программного обеспечения или формата образов виртуальных машин и отсутствием средств преобразования образа виртуальной машины из используемого им формата в другой (используемый другим поставщиком)",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, иммигрированная в облако, системное программное обеспечение, сетевое программное обеспечение, сетевой трафик, объекты файловой системы",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.142",
        "numeric_id":  142,
        "name":  "Угроза приостановки оказания облачных услуг вследствие технических сбоев",
        "description":  "Угроза заключается в возможности снижения качества облачных услуг (или даже отказа в их оказании конечным потребителям) из-за возникновения технических сбоев хотя бы у одного из поставщиков облачных услуг (входящих в цепь посредников при оказании облачных услуг их конечному потребителю), а также из-за возникновения существенных задержек или потерь в каналах передачи данных, арендуемых потребителем или поставщиками облачных услуг.\nДанная угроза обусловлена слабостями процедуры контроля за выполнением технического обслуживания и соблюдением режимов функционирования технических средств облачной информационной системы.\nРеализация данной угрозы возможна при условии отсутствия механизмов резервирования средств обработки, хранения и передачи информации, входящих в состав облачной информационной системы",
        "violator_source":  "",
        "target_object":  "Системное программное обеспечение, аппаратное обеспечение, канал связи",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.143",
        "numeric_id":  143,
        "name":  "Угроза программного выведения из строя средств хранения, обработки и (или) ввода/вывода/передачи информации",
        "description":  "Угроза заключается в возможности прерывания нарушителем технологии обработки информации в дискредитируемой системе путём осуществления деструктивного программного (локально или удалённо) воздействия на средства хранения (внешних, съёмных и внутренних накопителей), обработки (процессора, контроллера устройств и т.п.) и (или) ввода/вывода/передачи информации (клавиатуры и др.), в результате которого объект защиты перейдёт в состояние «отказ в обслуживании». При этом вывод его из этого состояния может быть невозможен путём перезагрузки системы, а потребует проведения ремонтно-восстановительных работ.\nДанная угроза обусловлена наличием уязвимостей микропрограммного обеспечения средств хранения, обработки и (или) ввода/вывода/передачи информации, а также невозможности длительного нахождения средств хранения, обработки и (или) ввода/вывода/передачи информации в режиме предельно допустимых значений (частота системной шины, центрального процессора, количества обращений на чтение и/или запись и другие параметры).\nРеализация данной угрозы возможна при наличии у нарушителя прав на отправку команды или специально сформированных входных данных на средства хранения, обработки и (или) ввода/вывода/передачи информации",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Носитель информации, микропрограммное обеспечение, аппаратное обеспечение, телекоммуникационное устройство",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.144",
        "numeric_id":  144,
        "name":  "Угроза программного сброса пароля BIOS",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к настройкам BIOS/UEFI после перезагрузки компьютера путём ввода «пустого» пароля.\nДанная угроза обусловлена слабостями мер разграничения доступа в операционной системе к функции сброса пароля BIOS/UEFI.\nРеализация данной угрозы возможна при условиях:\nналичия в программном обеспечении BIOS/UEFI активного интерфейса функции программного сброса пароля непосредственно из-под операционной системы;\nналичия у нарушителя специальных программных средств, реализующих сброс пароля, а также прав в операционной системе для установки и запуска данных средств",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.145",
        "numeric_id":  145,
        "name":  "Угроза пропуска проверки целостности программного обеспечения",
        "description":  "Угроза заключается в возможности внедрения нарушителем в дискредитируемую систему вредоносного программного обеспечения путём обманного перенаправления запросов пользователя или его программ на собственный сетевой ресурс, содержащий вредоносное программное обеспечение, для его «ручной» или «автоматической» загрузки с последующей установкой в дискредитируемую систему от имени пользователя или его программ.\nДанная угроза обусловлена слабостями механизмов проверки целостности файлов программного обеспечения и/или проверки подлинности источника их получения.\nРеализация данной угрозы возможна при условии успешного использования обманных техник одного из следующих методов:\n«ручного метода» – нарушитель, используя обманные механизмы, убеждает пользователя перейти по ссылке на сетевой ресурс нарушителя, что приводит к запуску вредоносного кода на компьютере пользователя, или убеждает пользователя самостоятельно загрузить и установить вредоносную программу (например, под видом игры или антивирусного средства);\n«автоматического метода» – нарушитель осуществляет деструктивное воздействие переадресацию функции автоматического обновления дискредитируемой программы на собственный вредоносный сервер",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.146",
        "numeric_id":  146,
        "name":  "Угроза прямого обращения к памяти вычислительного поля суперкомпьютера",
        "description":  "Угроза заключается в возможности осуществления процессом нарушителя, функционирующем в вычислительном поле суперкомпьютера, считывания защищаемых данных из оперативной памяти, выделенной для параллельного (дискредитируемого) процесса, с использованием операций удалённого прямого доступа к памяти.\nДанная угроза обусловлена слабостями протокола прямого доступа к оперативной памяти, с помощью которого выполняется обращение к сегменту памяти, выделенному для удалённого параллельного процесса, функционирующего в вычислительном поле суперкомпьютера.\nРеализация данной угрозы возможна при условии успешного осуществления нарушителем доступа к входным/выходным данным параллельных процессов в вычислительном поле суперкомпьютера",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Вычислительные узлы суперкомпьютера, каналы передачи данных суперкомпьютера, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.147",
        "numeric_id":  147,
        "name":  "Угроза распространения несанкционированно повышенных прав на всю грид-систему",
        "description":  "Угроза заключается в возможности автоматического распространения на всю грид-систему несанкционированно полученных нарушителем на одном узле привилегий.\nДанная угроза обусловлена наличием уязвимостей в клиентском программном обеспечении грид-системы и слабостями в механизме назначения прав пользователям, реализованном в связующем программном обеспечении.\nРеализация данной угрозы возможна при условии успешного повышения нарушителем своих прав на одном узле грид-системы",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Ресурсные центры грид-системы, узлы грид-системы, грид-система, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.148",
        "numeric_id":  148,
        "name":  "Угроза сбоя автоматического управления системой разграничения доступа хранилища больших данных",
        "description":  "Угроза заключается в возможности возникновения ситуаций, связанных c ошибками автоматического назначения пользователям прав доступа (наделение дополнительными полномочиями, ошибочное наследование, случайное восстановление «неактивных» учётных записей т.п.).\nДанная угроза обусловлена слабостями мер контроля за большим количеством (от тысячи, а в некоторых случаях и до нескольких миллионов) учётных записей пользователей со стороны администраторов безопасности.\nРеализация данной угрозы возможна при условии возникновения сбоев или ошибок в работе системы разграничения доступа хранилища больших данных",
        "violator_source":  "",
        "target_object":  "Информационная система, система разграничения доступа хранилища больших данных",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.149",
        "numeric_id":  149,
        "name":  "Угроза сбоя обработки специальным образом изменённых файлов",
        "description":  "Угроза заключается в возможности осуществления нарушителем различных неправомерных действий от имени дискредитированных приложений путём вызова сбоя в их работе за счёт внесения изменений в обрабатываемые дискредитируемыми программами файлы или их метаданные.\nДанная угроза обусловлена слабостями механизма проверки целостности обрабатываемых файлов и корректности, содержащихся в них данных.\nРеализация данной угрозы возможна в условиях:\nналичия у нарушителя сведений о форматах и значениях файлов, вызывающих сбой функционирования дискредитированных приложений при их обработке;\nуспешно созданном в дискредитируемой системе механизме перехвата управления над обработкой нарушителем программного сбоя",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Метаданные, объекты файловой системы, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.150",
        "numeric_id":  150,
        "name":  "Угроза сбоя процесса обновления BIOS",
        "description":  "Угроза заключается в возможности выведения из строя компьютера из-за внесения критических ошибок в программное обеспечение BIOS/UEFI в результате нарушения процесса его обновления.\nДанная угроза обусловлена слабостями технологий контроля за обновлением программного обеспечения BIOS/UEFI.\nРеализация данной угрозы возможна в ходе проведения ремонта и обслуживания компьютера как при установке корректной/совместимой версии обновления (из-за сбоев, помех и т.п.), так и при установке повреждённой/несовместимой версии обновления (из-за отсутствия механизма проверки целостности и совместимости)",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Микропрограммное и аппаратное обеспечение BIOS/UEFI, каналы связи",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.151",
        "numeric_id":  151,
        "name":  "Угроза сканирования веб-сервисов, разработанных на основе языка описания WSDL",
        "description":  "Угроза заключается в возможности получения нарушителем сведений о текущей конфигурации веб-служб и наличии в ней уязвимостей путём исследования WSDL-интерфейса веб-сервера.\nДанная угроза обусловлена недостаточностью мер по обеспечению конфиденциальности информации, реализованных в WSDL-сервисах, предоставляющих подробные сведения о портах, службах и соединениях, доступных пользователям.\nРеализация данной угрозы возможна при наличии у нарушителя сетевого доступа к исследуемому сетевому ресурсу и специальных программных средств сканирования сети",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевое программное обеспечение, сетевой узел",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.152",
        "numeric_id":  152,
        "name":  "Угроза удаления аутентификационной информации",
        "description":  "Угроза заключается в возможности отказа легитимным пользователям в доступе к информационным ресурсам, а также в возможности получения нарушителем привилегий дискредитированного пользователя за счёт сброса (обнуления, удаления) его аутентификационной информации.\nДанная угроза обусловлена слабостями политики разграничения доступа к аутентификационной информации и средствам работы с учётными записями пользователей.\nРеализация данной угрозы возможна при выполнении одного из следующих условий:\nштатные средства работы с учётными записями пользователей обладают функционалом сброса аутентификационной информации, и нарушитель получил привилегии в дискредитируемой системе на использование данных средств;\nнарушитель обладает специальным программным обеспечением, реализующим функцию сброса аутентификационной информации, и получил привилегии в дискредитируемой системе на использование данных средств",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, микропрограммное обеспечение, учётные данные пользователя",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.153",
        "numeric_id":  153,
        "name":  "Угроза усиления воздействия на вычислительные ресурсы пользователей при помощи сторонних серверов",
        "description":  "Угроза заключается в возможности осуществления нарушителем опосредованного деструктивного программного воздействия на дискредитируемую систему большим объёмом сетевого трафика, генерируемого сторонними серверами в ответ на сетевые запросы нарушителя, сформированные от имени дискредитируемой системы. Генерируемый сторонними серверами сетевой трафик значительно превышает объём сетевых запросов, формируемых нарушителем.\nДанная угроза обусловлена слабостями мер межсетевого экранирования дискредитируемой информационной системы, мер контроля подлинности сетевых запросов на сторонних серверах, а также слабостями модели взаимодействия открытых систем.\nРеализация данной угрозы возможна при условии наличия у нарушителя:\nсведений о сторонних серверах с недостаточными мерами контроля подлинности сетевых запросов;\nсведений о сетевом адресе дискредитируемой системы;\nспециального программного обеспечения, реализующего функции генерации сетевых пакетов",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, сетевой узел, системное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.154",
        "numeric_id":  154,
        "name":  "Угроза установки уязвимых версий обновления программного обеспечения BIOS",
        "description":  "Угроза заключается в возможности внесения уязвимостей в программное обеспечение BIOS/UEFI в ходе его обновления, которые могут быть использованы в дальнейшем для приведения компьютера в состояние «отказ в обслуживании», несанкционированного изменения конфигурации BIOS/UEFI или выполнения вредоносного кода при каждом запуске компьютера.\nДанная угроза обусловлена слабостями мер контроля отсутствия уязвимостей в только что вышедших версиях обновления программного обеспечения BIOS/UEFI.\nРеализация данной угрозы возможна в ходе проведения ремонта и обслуживания компьютера",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Микропрограммное обеспечение BIOS/UEFI",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.155",
        "numeric_id":  155,
        "name":  "Угроза утраты вычислительных ресурсов",
        "description":  "Угроза заключается в возможности отказа легитимному пользователю в выделении ресурсов для обработки его запросов из-за исчерпания нарушителем свободных ресурсов в системе, осуществлённого путём их несанкционированного исключения из общего пула ресурсов на основе техник «утечки ресурсов» или «выделения ресурсов».\nДанная угроза обусловлена слабостями механизма контроля за распределением вычислительных ресурсов между пользователями, а также мер межсетевого экранирования дискредитируемой информационной системы и контроля подлинности сетевых запросов на сторонних серверах.\nРеализация данной угрозы возможна при условии наличия у нарушителя:\nсведений о формате и параметрах деструктивных воздействий на систему, приводящих к исключению («утечки» или «выделению») свободных ресурсов из общего пула ресурсов дискредитируемой системы;\nпривилегий, достаточных для осуществления деструктивных воздействий («утечки» или «выделения») в дискредитируемой системе;\nотсутствие у администраторов возможности: для техники «утечки ресурсов» – перезагрузки системы во время отправки нарушителем большого числа запросов на выделение ресурсов, а для техники «выделения ресурсов» – форсированного освобождения ресурсов, выделенных по запросам вредоносных процессов",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Информационная система, сетевой узел, носитель информации, системное программное обеспечение, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.156",
        "numeric_id":  156,
        "name":  "Угроза утраты носителей информации",
        "description":  "Угроза заключается в возможности раскрытия информации, хранящейся на утерянном носителе (в случае отсутствия шифрования данных), или её потери (в случае отсутствия резервной копий данных).\nДанная угроза обусловлена слабостями мер регистрации и учёта носителей информации, а также мер резервирования защищаемых данных.\nРеализация данной угрозы возможна вследствие халатности сотрудников",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Носитель информации",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.157",
        "numeric_id":  157,
        "name":  "Угроза физического выведения из строя средств хранения, обработки и (или) ввода/вывода/передачи информации",
        "description":  "Угроза заключается в возможности умышленного выведения из строя внешним нарушителем средств хранения, обработки и (или) ввода/вывода/передачи информации, что может привести к нарушению доступности, а в некоторых случаях и целостности защищаемой информации.\nДанная угроза обусловлена слабостями мер контроля физического доступа к средствам хранения, обработки и (или) ввода/вывода/передачи информации.\nРеализация данной угрозы возможна при условии получения нарушителем физического доступа к носителям информации (внешним, съёмным и внутренним накопителям), средствам обработки информации (процессору, контроллерам устройств и т.п.) и средствам ввода/вывода информации (клавиатура и т.п.)",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сервер, рабочая станция, носитель информации, аппаратное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.158",
        "numeric_id":  158,
        "name":  "Угроза форматирования носителей информации",
        "description":  "Угроза заключается в возможности утраты хранящейся на форматируемом носителе информации, зачастую без возможности её восстановления, из-за преднамеренного или случайного выполнения процедуры форматирования носителя информации.\nДанная угроза обусловлена слабостью мер ограничения доступа к системной функции форматирования носителей информации.\nНа реализацию данной угрозы влияют такие факторы как:\nвремя, прошедшее после форматирования;\nтип носителя информации;\nтип файловой системы носителя;\nинтенсивность взаимодействия с носителем после форматирования и др.",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Носитель информации",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.159",
        "numeric_id":  159,
        "name":  "Угроза «форсированного веб-браузинга»",
        "description":  "Угроза заключается в возможности получения нарушителем доступа к защищаемой информации, выполнения привилегированных операций или осуществления иных деструктивных воздействий на некорректно защищённые компоненты веб-приложений.\nДанная угроза обусловлена слабостями (или отсутствием) механизма проверки корректности вводимых данных на веб-серверах.\nРеализация данной угрозы возможна при условии успешной реализации «ручного ввода» в адресную строку веб-браузера определённых адресов веб-страниц и осуществления принудительного перехода по древу веб-сайта к страницам, ссылки на которые явно не указаны на веб-сайте",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.160",
        "numeric_id":  160,
        "name":  "Угроза хищения средств хранения, обработки и (или) ввода/вывода/передачи информации",
        "description":  "Угроза заключается в возможности осуществления внешним нарушителем кражи компьютера (и подключённых к нему устройств), USB-накопителей, оптических дисков или других средств хранения, обработки, ввода/вывода/передачи информации.\nДанная угроза обусловлена слабостями мер контроля физического доступа к средствам хранения, обработки и (или) ввода/вывода/передачи информации.\nРеализация данной угрозы возможна при условии наличия у нарушителя физического доступа к носителям информации (внешним, съёмным и внутренним накопителям), средствам обработки информации (процессору, контроллерам устройств и т.п.) и средствам ввода/вывода информации (клавиатура и т.п.)",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сервер, рабочая станция, носитель информации, аппаратное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.161",
        "numeric_id":  161,
        "name":  "Угроза чрезмерного использования вычислительных ресурсов суперкомпьютера в ходе интенсивного обмена межпроцессорными сообщениями",
        "description":  "Угроза заключается в возможности возникновения ситуации типа «отказ в обслуживании» со стороны вычислительного поля суперкомпьютера.\nДанная угроза обусловлена слабостями мер контроля за распределением вычислительных ресурсов суперкомпьютера при обработке задачи несколькими процессорами.\nРеализация данной угрозы возможна при условии выполнения суперкомпьютером специфичных вычислительных задач, в ходе которых генерируются межпроцессорные сообщения с большой интенсивностью",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Вычислительные узлы суперкомпьютера",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.162",
        "numeric_id":  162,
        "name":  "Угроза эксплуатации цифровой подписи программного кода",
        "description":  "Угроза заключается в возможности повышения нарушителем привилегий в системах, использующих цифровую подпись кода в качестве связующей информации между программой и её привилегиями, путём дискредитации механизма подписывания программного кода.\nДанная угроза обусловлена слабостями в механизме подписывания программного кода.\nРеализация данной угрозы возможна при следующих условиях:\nдискредитируемый программный код написан с помощью фреймворка (framework), поддерживающего подписывание программного кода;\nдискредитируемый программный код подписан вендором (поставщиком программного обеспечения);\nнарушитель имеет возможность внедрить программный код в дискредитируемый компьютер",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, прикладное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.163",
        "numeric_id":  163,
        "name":  "Угроза перехвата исключения/сигнала из привилегированного блока функций",
        "description":  "Угроза заключается в возможности нарушителя получить права на доступ к защищаемой информации путём перехвата исключений/сигналов, сгенерированных участком программного кода, исполняемого с повышенными привилегиями (привилегированным блоком функций) и содержащего команды по управлению защищаемой информацией.\nДанная угроза обусловлена тем, что вызов программных функций в привилегированном режиме подразумевает отключение для них механизмов разграничения доступа.\nРеализация данной угрозы возможна при следующих условиях:\nдискредитируемая программа, написана на языке программирования, поддерживающего механизм привилегированных блоков (например, Java);\nв дискредитируемой программе вызов привилегированных блоков осуществлён небезопасным способом (использовано публичное объявление внутренних функций, использована генерация исключений из привилегированного блока);\nнарушитель обладает правами, достаточными для перехвата программных исключений в системе",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.164",
        "numeric_id":  164,
        "name":  "Угроза распространения состояния «отказ в обслуживании» в облачной инфраструктуре",
        "description":  "Угроза заключается в возможности распространения негативных последствий от реализации угроз на физическом или виртуальном уровне облачной инфраструктуры на уровни управления и оркестровки, а также на все информационные системы, развёрнутые на базе дискредитированной облачной инфраструктуры.\nДанная угроза обусловлена невозможностью функционирования информационных систем в облаке при некорректной работе самой облачной инфраструктуры, а также зависимостью работоспособности верхних уровней облачной инфраструктуры от работоспособности нижних.\nРеализация данной угрозы возможна в случае приведения облачной инфраструктуры на физическом или виртуальном уровне облачной инфраструктуры в состояние «отказ в обслуживании»",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Облачная инфраструктура, созданная с использованием технологий виртуализации",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.165",
        "numeric_id":  165,
        "name":  "Угроза включения в проект не достоверно испытанных компонентов",
        "description":  "Угроза заключается в возможности нарушения безопасности защищаемой информации вследствие выбора для применения в системе компонентов не в соответствии с их заданными проектировщиком функциональными характеристиками, надёжностью, наличием сертификатов и др.\nДанная угроза обусловлена недостаточностью мер по контролю за ошибками в ходе проектирования систем, связанных с безопасностью.\nРеализация данной угрозы возможна при условии выбора для применения в системе компонентов по цене, разрекламированности и др.",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение, техническое средство, информационная система, ключевая система информационной инфраструктуры",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.166",
        "numeric_id":  166,
        "name":  "Угроза внедрения системной избыточности",
        "description":  "Угроза заключается в возможности снижения скорости обработки данных (т.е. доступности) компонентами программного обеспечения (или системы в целом) из-за внедрения в него (в неё) избыточных компонентов (изначально ненужных или необходимость в которых отпала при внесении изменений в проект).\nДанная угроза обусловлена недостаточностью мер по контролю за ошибками в ходе проектирования систем, связанных с безопасностью.\nРеализация данной угрозы возможна при условии внесения изменений в перечень задач, решаемых проектируемым программным обеспечением (проектируемой системой)",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение, информационная система, ключевая система информационной инфраструктуры",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.167",
        "numeric_id":  167,
        "name":  "Угроза заражения компьютера при посещении неблагонадёжных сайтов",
        "description":  "Угроза заключается в возможности нарушения безопасности защищаемой информации вредоносными программами, скрытно устанавливаемыми при посещении пользователями системы с рабочих мест (намеренно или при случайном перенаправлении) сайтов с неблагонадёжным содержимым и запускаемыми с привилегиями дискредитированных пользователей.\nДанная угроза обусловлена слабостями механизмов фильтрации сетевого трафика и антивирусного контроля на уровне организации.\nРеализация данной угрозы возможна при условии посещения пользователями системы с рабочих мест сайтов с неблагонадёжным содержимым",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.168",
        "numeric_id":  168,
        "name":  "Угроза «кражи» учётной записи доступа к сетевым сервисам",
        "description":  "Угроза заключается в возможности неправомерного ознакомления нарушителем с защищаемой информацией пользователя путём получения информации идентификации/аутентификации, соответствующей учётной записи доступа пользователя к сетевым сервисам (социальной сети, облачным сервисам и др.), с которой связан неактивный/несуществующий адрес электронной почты.\nДанная угроза обусловлена недостаточностью мер контроля за активностью/существованием ящиков электронной почты.\nРеализация данной угрозы возможна при условиях:\nналичия статуса «свободен для занимания» у адреса электронной почты, с которым связана учётная запись доступа пользователя к сетевым сервисам (например, если пользователь указал при регистрации несуществующий адрес или долго не обращался к почтовому ящику, вследствие чего, его отключили);\nналичия у нарушителя сведений об адресе электронной почты, с которым связана учётная запись дискредитируемого пользователя для доступа к сетевым сервисам",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.169",
        "numeric_id":  169,
        "name":  "Угроза наличия механизмов разработчика",
        "description":  "Угроза заключается в возможности перехвата управления программой за счёт использования отладочных механизмов (специальных программных функций или аппаратных элементов, помогающих проводить тестирование и отладку средств во время их разработки).\nДанная угроза обусловлена недостаточностью мер по контролю за ошибками в ходе разработки средств защиты информации.\nРеализация данной угрозы возможна при условии, что в программе не удалены отладочные механизмы",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение, техническое средство",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.170",
        "numeric_id":  170,
        "name":  "Угроза неправомерного шифрования информации",
        "description":  "Угроза заключается в возможности фактической потери доступности защищаемых данных из-за их несанкционированного криптографического преобразования нарушителем с помощью известного только ему секретного ключа.\nДанная угроза обусловлена наличием слабостей в антивирусной защите, а также в механизмах разграничения доступа.\nРеализация данной угрозы возможна при условии успешной установки нарушителем на дискредитируемый компьютер средства криптографического преобразования информации, а также успешного обнаружения (идентификации) нарушителем защищаемых файлов",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Объект файловой системы",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.171",
        "numeric_id":  171,
        "name":  "Угроза скрытного включения вычислительного устройства в состав бот-сети",
        "description":  "Угроза заключается в возможности опосредованного осуществления нарушителем деструктивного воздействия на информационные системы с множества вычислительных устройств (компьютеров, мобильных технических средств и др.), подключённых к сети Интернет, за счёт захвата управления такими устройствам путём несанкционированной установки на них:\nвредоносного ПО типа Backdoor для обеспечения нарушителя возможностью удалённого доступа/управления дискредитируемым вычислительным устройством;\nклиентского ПО для включения в ботнет и использования созданного таким образом ботнета в различных противоправных целях (рассылка спама, проведение атак типа «отказ в обслуживании» и др.).\nДанная угроза обусловлена уязвимостями в сетевом программном обеспечении и слабостями механизмов антивирусного контроля и межсетевого экранирования.\nРеализация данной угрозы возможна при условии наличия выхода с дискредитируемого вычислительного устройства в сеть Интернет",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевой узел, сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.172",
        "numeric_id":  172,
        "name":  "Угроза распространения «почтовых червей»",
        "description":  "Угроза заключается в возможности нарушения безопасности защищаемой информации пользователя вредоносными программами, скрытно устанавливаемыми при получении пользователями системы электронных писем, содержащих вредоносную программу типа «почтовый червь», а также невольного участия в дальнейшем противоправном распространении вредоносного кода.\nДанная угроза обусловлена слабостями механизмов антивирусного контроля.\nРеализация данной угрозы возможна при условии наличия у дискредитируемого пользователя электронного почтового ящика, а также наличия в его адресной книге хотя бы одного адреса другого пользователя",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.173",
        "numeric_id":  173,
        "name":  "Угроза «спама» веб-сервера",
        "description":  "Угроза заключается в возможности неправомерного осуществления нарушителем массовой рассылки коммерческих, политических, мошеннических и иных сообщений на веб-сервер без запроса со стороны дискредитируемых веб-серверов.\nДанная угроза обусловлена уязвимостями механизмов фильтрации сообщений, поступающих из сети Интернет.\nРеализация данной угрозы возможна при условии наличия в дискредитируемом веб-сервере активированного функционала, реализующего различные почтовые сервера, службы доставки мгновенных сообщений, блоги, форумы, аукционы веб-магазинов, онлайн-сервисы отправки SMS-сообщений, онлайн-сервисы голосования и др.",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.174",
        "numeric_id":  174,
        "name":  "Угроза «фарминга»",
        "description":  "Угроза заключается в возможности неправомерного ознакомления нарушителем с защищаемой информацией (в т.ч. идентификации/аутентификации) пользователя путём скрытного перенаправления пользователя на поддельный сайт (выглядящий одинаково с оригинальным), на котором от дискредитируемого пользователя требуется ввести защищаемую информацию.\nДанная угроза обусловлена уязвимостями DNS-сервера, маршрутизатора.\nРеализация данной угрозы возможна при условии наличия у нарушителя:\nсведений о конкретных сайтах, посещаемых пользователем, на которых требуется ввод защищаемой информации;\nсредств создания и запуска поддельного сайта;\nспециальных программных средств типа «эксплойт», реализующих перенаправление пользователя на поддельный сайт.\nКроме того, угрозе данного типа подвержены подлинные сайты, не требующие установления безопасного соединения перед вводом информации ограниченного доступа",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Рабочая станция, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.175",
        "numeric_id":  175,
        "name":  "Угроза «фишинга»",
        "description":  "Угроза заключается в возможности неправомерного ознакомления нарушителем с защищаемой информацией (в т.ч. идентификации/аутентификации) пользователя путём убеждения его с помощью методов социальной инженерии (в т.ч. посылкой целевых писем (т.н. spear-phishing attack), с помощью звонков с вопросом об открытии вложения письма, имитацией рекламных предложений (fake offers) или различных приложений (fake apps)) зайти на поддельный сайт (выглядящий одинаково с оригинальным), на котором от дискредитируемого пользователя требуется ввести защищаемую информацию или открыть заражённое вложение в письме.\nДанная угроза обусловлена недостаточностью знаний пользователей о методах и средствах «фишинга».\nРеализация данной угрозы возможна при условии наличия у нарушителя:\nсведений о конкретных сайтах, посещаемых пользователем, на которых требуется ввод защищаемой информации;\nсредств создания и запуска поддельного сайта;\nсведений о контактах пользователя с доверенной организацией (номер телефона, адрес электронной почты и др.).\nДля убеждения пользователя раскрыть информацию ограниченного доступа (или открыть вложение в письмо) наиболее часто используются поддельные письма от администрации какой-либо организации, с которой взаимодействует пользователь (например, банк)",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Рабочая станция, сетевое программное обеспечение, сетевой трафик",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.176",
        "numeric_id":  176,
        "name":  "Угроза нарушения технологического/производственного процесса из-за временны́х задержек, вносимых средством защиты",
        "description":  "Угроза заключается в возможности приведения системы в состояние «отказ в обслуживании» или нарушения штатного режима функционирования из-за временной задержки в системах реального времени, вносимой в процессы передачи и обработки защищаемой информации средствами защиты информации, вызванной необходимостью обработки передаваемой/обрабатываемой информации на предмет выявления и нейтрализации угроз безопасности информации.\nНа реализацию данной угрозы влияет не только номенклатура применяемых средств защиты информации, параметры их настройки, объём передаваемой/обрабатываемой информации, а также текущая активность внешних нарушителей, программные воздействия которых обрабатываются средствами защиты информации",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Средство защиты информации",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.177",
        "numeric_id":  177,
        "name":  "Угроза неподтверждённого ввода данных оператором в систему, связанную с безопасностью",
        "description":  "Угроза заключается в возможности возникновения ошибок в работе системы вследствие отсутствия (или игнорирования) процедуры обнаружения и исправления ошибок в данных, вводимых во время работы самим оператором, до активизации управляемого оборудования. Кроме того, к реализации данной угрозы могут привести некорректно реализованные (или отсутствующие) средства реагирования на неправильные, самопроизвольные действия оператора, средства учёта нижних/верхних пределов скорости и направления реакции оператора, схемы реагирования на двойное нажатие клавиш при вводе обычных и критических данных, процедуры формирования временных пауз с возможностью выбора разных ответов (да/нет и т.п.).\nРеализуемость данной угрозы зависит от требований, предъявляемых к процедурам обнаружения и исправления ошибок во вводимых данных в систему, связанную с безопасностью, а также разницей между этими требованиями и фактическим уровнем обнаружения и исправления ошибок",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение, сетевое программное обеспечение, прикладное программное обеспечение, аппаратное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.178",
        "numeric_id":  178,
        "name":  "Угроза несанкционированного использования системных и сетевых утилит",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на систему за счёт использования имеющихся или предварительно внедрённых стандартных (известных и обычно не определяемых антивирусными программами как вредоносных) системных и сетевых утилит, предназначенных для использования администратором для диагностики и обслуживания системы (сети).\nРеализация данной угрозы возможна при условиях:\nналичие в системе стандартных системных и сетевых утилит или успешное их внедрение нарушителем в систему и сокрытие (с использованием существующих архивов, атрибутов «скрытый» или «только для чтения» и др.);\nналичие у нарушителя привилегий на запуск таких утилит",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.179",
        "numeric_id":  179,
        "name":  "Угроза несанкционированной модификации защищаемой информации",
        "description":  "Угроза заключается в возможности нарушения целостности защищаемой информации путём осуществления нарушителем деструктивного физического воздействия на машинный носитель информации или деструктивного программного воздействия (в т.ч. изменение отдельных бит или полное затирание информации) на данные, хранящиеся на нём.\nРеализация данной угрозы возможна в случае получения нарушителем системных прав на запись данных или физического доступа к машинному носителю информации на расстояние, достаточное для оказания эффективного деструктивного воздействия",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Объекты файловой системы",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.180",
        "numeric_id":  180,
        "name":  "Угроза отказа подсистемы обеспечения температурного режима",
        "description":  "Угроза заключается в возможности повреждения части компонентов системы или системы в целом вследствие выхода температурного режима их работы из заданных требований из-за возникновения отказа входящих в неё подсистем вентиляции и температурных приборов.\nРеализация данной угрозы возможна как вследствие естественных техногенных причин, так и путём проведения определённых мероприятий нарушителем, направленных на удалённое отключение/вывод из строя компонентов подсистемы обеспечения температурного режима",
        "violator_source":  "Внутренний нарушитель с низким потенциалом; Внешний нарушитель со средним потенциалом",
        "target_object":  "Технические средства воздушного кондиционирования, включая трубопроводные системы для циркуляции охлаждённого воздуха в ЦОД, программируемые логические контроллеры, распределённые системы контроля, управленческие системы и другие программные средства контроля",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.181",
        "numeric_id":  181,
        "name":  "Угроза перехвата одноразовых паролей в режиме реального времени",
        "description":  "Угроза заключается в возможности получения нарушителем управления критическими операциями пользователя путём перехвата одноразовых паролей, высылаемых системой автоматически, и использования их для осуществления неправомерных действий до того, как истечёт их срок действия (обычно, не более 5 минут).\nРеализация данной угрозы возможна при выполнении следующих условий:\nналичие у нарушителя сведений об информации идентификации/аутентификации дискредитируемого пользователя условно-постоянного действия;\nуспешное осуществление нарушителем перехвата трафика между системой и пользователем",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.182",
        "numeric_id":  182,
        "name":  "Угроза физического устаревания аппаратных компонентов",
        "description":  "Угроза заключается в возможности нарушения функциональности системы, связанной с безопасностью, вследствие отказов аппаратных компонентов этой системы из-за их физического устаревания (ржавление, быстрый износ, окисление, загрязнение, отслаивание, шелушение и др.), обусловленного влиянием физической окружающей среды (влажности, пыли, коррозийных субстанций).\nВозможность реализации данной угрозы возрастает при использовании пользователями технических средств в условиях, не удовлетворяющих требованиям заданных их производителем",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Аппаратное средство",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.183",
        "numeric_id":  183,
        "name":  "Угроза перехвата управления автоматизированной системой управления технологическими процессами",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информационной инфраструктуре за счёт получения нарушителем права управления входящей в её состав автоматизированной системой управления технологическими процессами путём эксплуатации уязвимостей её программного обеспечения или слабостей технологических протоколов передачи данных. \nДанная угроза обусловлена наличием у автоматизированной системы управления технологическими процессами программных сетевых интерфейсов взаимодействия и, как следствие, возможностью несанкционированного доступа к данной системе, а также недостаточностью мер фильтрации сетевого трафика и антивирусной защиты.\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на осуществление взаимодействия с автоматизированной системой управления технологическими процессами. Реализация данной угрозы может привести к:\nблокированию или искажению (некорректность выполнения) алгоритмов отработки заданий управления технологическими процессами, непосредственного управления оборудованием предприятия;\nнарушению штатного хода технологических процессов;\nчастичному или полному останову технологических процессов без (или с) выхода(-ом) оборудования из строя;\nаварийной ситуации в критической системе информационной инфраструктуры",
        "violator_source":  "Внешний нарушитель с высоким потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение автоматизированной системы управления технологическими процессами",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.184",
        "numeric_id":  184,
        "name":  "Угроза агрегирования данных, обрабатываемых с помощью мобильного устройства",
        "description":  "Угроза заключается в возможности осуществления нарушителем сбора и анализа информации, обрабатываемой с помощью мобильного устройства, за счёт использования специального программного обеспечения, встраиваемого пользователем в системное программное обеспечение мобильного устройства, а также встраиваемого в мобильные программы под видом программной платформы для их разработки другими компаниями.\nДанная угроза обусловлена наличием в мобильном устройстве множества каналов передачи данных, а также сложностью контроля потоков информации в таком устройстве.\nРеализация данной угрозы возможна при условии использования мобильных устройств пользователями. В качестве собираемой информации могут выступать:\nперсональные данные пользователя и контактирующих с ним лиц (пол, возраст, религиозные и политические взгляды и др.);\nинформация ограниченного доступа (история браузера, список контактов пользователя, история звонков и др.);\nданные об окружающей среде (текущее местоположение мобильного устройства, маршруты движения, наличие беспроводных сетей в радиусе доступа);\nвидеоданные, снимаемые видеокамерами мобильного устройства;\nаудиоданные, снимаемые микрофоном устройства",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Мобильное устройство",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.185",
        "numeric_id":  185,
        "name":  "Угроза несанкционированного изменения параметров настройки средств защиты информации",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного изменения параметров настройки средства защиты информации. Данная угроза обусловлена слабостями мер разграничения доступа к конфигурационным файлам средства защиты информации. Реализация данной угрозы возможна при условии получения нарушителем прав доступа к программному интерфейсу управления средством защиты информации, а также при наличии у нарушителя сведений о структуре и формате файлов конфигурации средства защиты информации",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Средство защиты информации",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.186",
        "numeric_id":  186,
        "name":  "Угроза внедрения вредоносного кода через рекламу, сервисы и контент",
        "description":  "Угроза заключается в возможности внедрения нарушителем в информационную систему вредоносного кода посредством рекламы, сервисов и (или) контента (т.е. убеждения пользователя системы активировать ссылку, код и др.) при посещении пользователем системы сайтов в сети Интернет или установкой программ с функцией показа рекламы.\nДанная угроза обусловлена слабостями механизмов фильтрации сетевого трафика и антивирусного контроля на уровне организации.\nРеализация данной угрозы возможна при условии посещения пользователями системы с рабочих мест сайтов в сети Интернет",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.187",
        "numeric_id":  187,
        "name":  "Угроза несанкционированного воздействия на средство защиты информации",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к программной среде управления средством защиты информации и изменения режима его функционирования.\nУгроза обусловлена наличием у средств защиты информации программной среды управления и взаимодействия с пользователями системы.\nРеализация данной угрозы возможна при условии получения нарушителем прав доступа к программному интерфейсу управления средством защиты информации",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Средство защиты информации",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.188",
        "numeric_id":  188,
        "name":  "Угроза подмены программного обеспечения",
        "description":  "Угроза заключается в возможности осуществления нарушителем внедрения в систему вредоносного программного обеспечения за счёт загрузки и установки вредоносного программного обеспечения, скрытого под видом легитимного свободно распространяемого программного обеспечения.\nДанная угроза обусловлена наличием у пользователя прав для установки программного обеспечения из сети Интернет.\nРеализация данной угрозы возможна при скачивании программного обеспечения в сети Интернет",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Прикладное программное обеспечение, сетевое программное обеспечение, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.189",
        "numeric_id":  189,
        "name":  "Угроза маскирования действий вредоносного кода",
        "description":  "Угроза заключается в возможности сокрытия в системе действий вредоносного кода за счет применения специальных механизмов маскирования кода (архивирование, изменение формата данных и др.), которые препятствуют его дальнейшему анализу.\nДанная угроза обусловлена наличием способов маскирования программного кода, не учтенных сигнатурными базами средств защиты информации, а также механизмов операционной системы, позволяющих осуществить поиск модулей средств защиты информации.\nРеализация данной угрозы возможна при условии использования в системе устаревших версий средств защиты информации",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Системное программное обеспечение, сетевое программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.190",
        "numeric_id":  190,
        "name":  "Угроза внедрения вредоносного кода за счет посещения зараженных сайтов в сети Интернет",
        "description":  "Угроза заключается в возможности осуществления нарушителем внедрения вредоносного кода в компьютер пользователя при посещении зараженных сайтов. Нарушитель выявляет наиболее посещаемые пользователем сайты, затем их взламывает и внедряет в них вредоносный код. Данная угроза обусловлена слабостями мер антивирусной защиты, а также отсутствием правил межсетевого экранирования. Реализация данной угрозы возможна при:\nнеограниченном доступе пользователя в сеть Интернет;\nналичии у нарушителя сведений о сайтах, посещаемых пользователем",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Сетевое программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.191",
        "numeric_id":  191,
        "name":  "Угроза внедрения вредоносного кода в дистрибутив программного обеспечения",
        "description":  "Угроза заключается в возможности осуществления нарушителем заражения системы путем установки недоверенного дистрибутива, в который внедрен вредоносный код. Данная угроза обусловлена слабостями мер антивирусной защиты. Реализация данной угрозы возможна при: применении пользователем сторонних дистрибутивов; отсутствии антивирусной проверки перед установкой дистрибутива",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Прикладное программное обеспечение, сетевое программное обеспечение, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.192",
        "numeric_id":  192,
        "name":  "Угроза использования уязвимых версий программного обеспечения",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивного воздействия на систему путём эксплуатации уязвимостей программного обеспечения. Данная угроза обусловлена слабостями механизмов анализа программного обеспечения на наличие уязвимостей. Реализация данной угрозы возможна при отсутствии проверки перед применением программного обеспечения на наличие в нем уязвимостей или использованием программного обеспечения, поддержка которого была прекращена производителем",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Прикладное программное обеспечение, сетевое программное обеспечение, системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.193",
        "numeric_id":  193,
        "name":  "Угроза утечки информации за счет применения вредоносным программным обеспечением алгоритмов шифрования трафика",
        "description":  "Угроза заключается в возможности утечки информации за счет применения вредоносным программным обеспечением алгоритмов шифрования трафика, скрывающих сам факт передачи данных.\nДанная угроза обусловлена слабостями мер защиты информации при хранении, обработке и передаче информационных ресурсов.\nРеализация данной угрозы возможна: \nпри условии успешного внедрения в дискредитируемую систему указанного вредоносного программного обеспечения;\nпри отсутствии или недостаточной реализации мер межсетевого экранирования",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Информационные ресурсы, объекты файловой системы",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.194",
        "numeric_id":  194,
        "name":  "Угроза несанкционированного использования привилегированных функций мобильного устройства",
        "description":  "Угроза заключается в возможности снятия нарушителем предустановленных производителем ограничений на конфигурирование привилегированных функций мобильного устройства. Данная угроза обусловлена наличием уязвимостей в операционных системах мобильного устройства, позволяющих получить доступ к настройкам привилегированных функций. \nРеализация данной угрозы возможна при получении нарушителем доступа к мобильному устройству",
        "violator_source":  "Внешний нарушитель с высоким потенциалом",
        "target_object":  "Мобильное устройство",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.195",
        "numeric_id":  195,
        "name":  "Угроза удаленного запуска вредоносного кода в обход механизмов защиты операционной системы",
        "description":  "Угроза заключается в возможности удаленного запуска вредоносного кода за счет создания приложений, использующих обход механизмов защиты, встроенных в операционную систему.\nДанная угроза обусловлена ошибками в процессорах (например, ошибками в процессоре Intel поколения Haswell), позволяющими за счет создания специальных приложений осуществлять обход механизмов защиты, встроенных в операционную систему (например, механизма ASLR).\nРеализация данной угрозы возможна при: инициировании коллизии в таблице целевых буферов - с ее помощью можно узнать участки памяти, где находятся конкретные фрагменты кода;\nсоздании приложения, использующего эти фрагменты кода для обхода механизма защиты;\nзапуске данного приложения в связке с эксплойтом какой-либо уязвимости самой операционной системы для создания возможности удаленного запуска вредоносного кода",
        "violator_source":  "Внешний нарушитель с высоким потенциалом",
        "target_object":  "Стационарные и мобильные устройства (компьютеры и ноутбуки) (аппаратное устройство)",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.196",
        "numeric_id":  196,
        "name":  "Угроза контроля вредоносной программой списка приложений, запущенных на мобильном устройстве",
        "description":  "Угроза заключается в возможности использования вредоносной программы для контроля списка приложений, запущенных на мобильном устройстве.\nДанная угроза обусловлена недостаточностью мер по антивирусной защите, что позволяет выполнить неконтролируемый запуск вредоносных программ (отсутствие контроля разрешенного программного обеспечения). Реализация данной угрозы возможна при условии, что вредоносная программа внедрена на мобильном устройстве и непреднамеренно запущена самим пользователем",
        "violator_source":  "Внешний нарушитель с высоким потенциалом",
        "target_object":  "Мобильное устройство (аппаратное устройство)",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.197",
        "numeric_id":  197,
        "name":  "Угроза хищения аутентификационной информации из временных файлов cookie",
        "description":  "Угроза заключается в возможности хищения с использованием вредоносной программы аутентификационной информации пользователей, их счетов, хранящейся во временных файлах cookie, и передачи этой информации нарушителям через открытый RDP-порт.\nДанная угроза обусловлена недостаточностью мер антивирусной защиты, что позволяет выполнить неконтролируемый запуск вредоносного программного обеспечения (отсутствие контроля разрешенного программного обеспечения).\nКроме того, данная угроза обусловлена непринятием мер по стиранию остаточной информации из временных файлов (очистке временных файлов).\nРеализация данной угрозы возможна при условии, что на атакуемом компьютере открыт RDP-порт",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Информация, хранящаяся на компьютере во временных файлах (программное обеспечение)",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.198",
        "numeric_id":  198,
        "name":  "Угроза скрытной регистрации вредоносной программой учетных записей администраторов",
        "description":  "Угроза заключается в возможности скрытного создания внедренной вредоносной программой учетных записей с правами администратора с целью последующего их использования для несанкционированного доступа к пользовательской информации и к настройкам программного обеспечения, установленного на инфицированном компьютере.\nДанная угроза обусловлена недостаточностью мер по антивирусной защите, что позволяет выполнить неконтролируемый запуск вредоносного программного обеспечения (отсутствие контроля разрешенного программного обеспечения).\nКроме того, данная угроза обусловлена недостаточностью мер по разграничению доступа (контроль создания учетных записей пользователей).\nРеализация данной угрозы возможна при условии, что на атакуемом компьютере открыт RDP-порт",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Система управления доступом, встроенная в операционную систему компьютера (программное обеспечение)",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.199",
        "numeric_id":  199,
        "name":  "Угроза перехвата управления мобильного устройства при использовании виртуальных голосовых ассистентов",
        "description":  "Угроза заключается в возможности управления мобильным устройством и запущенными на нем приложениями от имени легального пользователя за счет передачи этих команд через виртуальных голосовых ассистентов (например, через Siri для IPhone).\nДанная угроза обусловлена проблемами аутентификации пользователя, в частности по Voice ID. Голосовой ассистент не может быть полностью уверен в том, что обращающийся к нему голос принадлежит владельцу устройства, поэтому для удобства пользователей и гарантии срабатывания устанавливается низкая чувствительность Voice ID. Это позволяет нарушителю использовать записанную на диктофон речь владельца мобильного устройства. Реализация данной угрозы возможна при условии, что виртуальный голосовой ассистент находится в активном состоянии (то есть, не отключен) и установлена низкая чувствительность голосового идентификатора",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Мобильное устройство и запущенные на  нем приложения (программное обеспечение, аппаратное устройство)",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.200",
        "numeric_id":  200,
        "name":  "Угроза хищения информации с мобильного устройства при использовании виртуальных голосовых ассистентов",
        "description":  "Угроза заключается в возможности хищения данных пользователя с его мобильного устройства через виртуальных голосовых ассистентов (например, через Siri для IPhone).\nДанная угроза обусловлена проблемами аутентификации пользователя, в частности по Voice ID. Голосовой ассистент не может быть полностью уверен в том, что обращающейся к нему голос принадлежит владельцу устройства, поэтому для удобства пользователей и гарантии срабатывания устанавливается низкая чувствительность Voice ID. Это позволяет нарушителю использовать записанную на диктофон речь владельца мобильного устройства. Реализация данной угрозы возможна при условии, что виртуальный голосовой ассистент находится в активном состоянии (то есть не отключен) и установлена низкая чувствительность голосового идентификатора",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Данные пользователя мобильного устройства (аппаратное устройство)",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.201",
        "numeric_id":  201,
        "name":  "Угроза утечки пользовательских данных при использовании функций автоматического заполнения аутентификационной информации в браузере",
        "description":  "Угроза заключается в возможности утечки пользовательских данных за счет использования реализованной в браузерах функции автоматического заполнение форм авторизации.\nРеализация данной угрозы обусловлена хранением в браузерах в открытом виде пользовательских данных, используемых для автозаполнения форм авторизации.\nРеализация данной угрозы возможна при условии, что пользователь использует браузер, в котором реализована и активирована функция автоматического заполнения форм авторизации",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Аутентификационные данные пользователя (программное обеспечение)",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.202",
        "numeric_id":  202,
        "name":  "Угроза несанкционированной установки приложений на мобильные устройства",
        "description":  "Угроза заключается в возможности установки приложений на виртуальные машины мобильных устройств, работающих под управлением операционной системы Android, несанкционированно запущенных внедренной вредоносной программой. Вредоносная программа запускает виртуальную машину на мобильном устройстве, размещает (устанавливает) в этой виртуальной машине неограниченное количество приложений.\nДанная угроза обусловлена недостаточностью мер по контролю за запуском прикладного программного обеспечения, что позволяет выполнить неконтролируемый запуск вредоносного прикладного программного обеспечения по факту совершения пользователем различных действий в системе (например, при попытке закрытия пользователем нежелательной рекламы).\nРеализация данной угрозы возможна при условии наличия на мобильном устройстве вредоносной программы, способной запустить виртуальную машину и установить в эту виртуальную машину приложение",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Мобильные устройства (аппаратное устройство, программное обеспечение)",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.203",
        "numeric_id":  203,
        "name":  "Угроза утечки информации с неподключенных к сети Интернет компьютеров",
        "description":  "Угроза заключается в возможности хищения данных с неподключенных к сети Интернет компьютеров за счет компрометации их аппаратных элементов или устройств коммутационного оборудования (например, маршрутизаторов), оснащенных LED-индикаторами, фиксации мерцания этих индикаторов и расшифровки полученных результатов.\nРеализация данной угрозы обусловлена тем, что существует возможность несанкционированного получения управления этими индикаторами (с помощью специальной прошивки или повышения привилегий и выполнения вредоносного кода), позволяющего передавать информацию путем ее преобразования в последовательность сигналов индикаторов компьютеров и коммутационного оборудования.\nРеализация данной угрозы возможна при условии, что злоумышленником получен физический доступ к компрометируемому компьютеру или коммутационному оборудованию для установки средства визуального съема сигналов LED-индикаторов",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.204",
        "numeric_id":  204,
        "name":  "Угроза несанкционированного изменения вредоносной программой значений параметров программируемых логических контроллеров",
        "description":  "Угроза заключается в возможности несанкционированного изменения вредоносной программой значений параметров контроля и управления исполнительными устройствами в программируемых логических контроллерах после ее проникновения и авторизации на данных устройствах.\nРеализация угрозы обусловлена возможностью вредоносной программы обнаруживать в сети программируемые логические контроллеры, проникать и функционировать в операционной системе программируемых логических контроллеров, а также недостатками механизмов аутентификации.\nРеализация данной угрозы возможна при условии, что существует возможность доступа к элементам автоматизированной системы управления технологическими процессами по сети Интернет",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Аппаратное устройство",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.205",
        "numeric_id":  205,
        "name":  "Угроза нарушения работы компьютера и блокирования доступа к его данным из-за некорректной работы установленных на нем средств защиты",
        "description":  "Угроза заключается в возможности нарушения работы компьютера и отказа в доступе к его данным за счет ошибочного блокирования средством защиты информации файлов.\nРеализация данной угрозы обусловлена тем, что на компьютере установлено средство защиты информации, реализующее функцию блокирования файлов",
        "violator_source":  "Внешний нарушитель с низким потенциалом",
        "target_object":  "Аппаратное устройство, программное обеспечение",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.206",
        "numeric_id":  206,
        "name":  "Угроза отказа в работе оборудования из-за изменения геолокационной информации о нем",
        "description":  "Угроза заключается в прекращении работы оборудования с ЧПУ, вызванном изменением геолокационной информации о данном оборудовании. Угроза обусловлена геолокационной привязкой оборудования с ЧПУ к конкретной географической координате при пуско-наладочных работах. Угроза реализуется при условии перемещения оборудования с ЧПУ и приводит к невозможности его дальнейшей эксплуатации",
        "violator_source":  "Внешний нарушитель с высоким потенциалом",
        "target_object":  "Аппаратное устройство",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.207",
        "numeric_id":  207,
        "name":  "Угроза несанкционированного доступа к параметрам настройки оборудования за счет использования «мастер-кодов» (инженерных паролей)",
        "description":  "Угроза заключается в несанкционированном получении доступа к параметрам настройки информации в оборудовании с ЧПУ посредством использования специальных «мастер-кодов» (инженерных паролей), «жестко прописанных» (не изменяемых путем конфигурирования) в программном обеспечении данного оборудования. Угроза обусловлена необходимостью проведения ремонтных работ при сбоях в ПО оборудования с ЧПУ представителями производителя",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Аппаратное устройство, программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.208",
        "numeric_id":  208,
        "name":  "Угроза нецелевого использования вычислительных ресурсов средства вычислительной техники",
        "description":  "Угроза заключается в возможности использования вычислительных ресурсов средств вычислительной техники для осуществления сторонних вычислительных процессов.\nУгроза реализуется за счет внедрения в средства вычислительной техники вредоносной программы, содержащей код, реализующий использования вычислительных ресурсов для своих нужд (в частности, для майнинга криптовалюты).\nДанная угроза обусловлена недостаточностью следующих мер защиты информации:\nмер по антивирусной защите, что позволяет выполнить установку и запуск вредоносной программы;\nмер по ограничению программной среды, что позволяют нарушителю осуществлять бесконтрольный запуск программных компонентов.",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом; Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Средство вычислительной техники, мобильное устройство",
        "confidentiality":  false,
        "integrity":  false,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.209",
        "numeric_id":  209,
        "name":  "Угроза несанкционированного доступа к защищаемой памяти _x000D_\nядра процессора",
        "description":  "Угроза заключается в возможности получения доступа к защищенной памяти из программы, не обладающей соответствующими правами, в результате эксплуатации уязвимостей, позволяющих преодолеть механизм разграничения доступа, реализуемый центральным процессором.\nРеализация данной угрозы обусловлена наличием уязвимостей, связанных с ошибкой контроля доступа к памяти, основанных на спекулятивном выполнении инструкций процессора. Ошибка контроля доступа обусловлена следующими факторами:\n1) отсутствие проверки прав доступа процесса к читаемым областям при спекулятивном выполнении операций, в том числе при чтении из оперативной памяти;\n2) отсутствие очистки кэша от результатов ошибочного спекулятивного исполнения;\n3) хранение данных ядра операционной системы в адресном пространстве процесса.\nРеализация данной угрозы возможна из-за наличия процессоров, имеющих аппаратные уязвимости и отсутствия соответствующих обновлений",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Аппаратное устройство",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.210",
        "numeric_id":  210,
        "name":  "Угроза нарушения работы информационной системы, вызванного обновлением используемого в ней программного обеспечения",
        "description":  "Угроза заключается в возможном нарушении функционирования программных, программно-аппаратных элементов информационной системы или информационной системы в целом из-за некорректной работы установленных обновлений (патчей) системного программного обеспечения.\nУгроза обусловлена наличием критических ошибок, дефектов, уязвимостей в используемом программном обеспечении информационной системы.\nРеализация данной угрозы возможна при условии установки обновлений на программно-аппаратные компоненты информационной системы",
        "violator_source":  "Внутренний нарушитель с высоким потенциалом",
        "target_object":  "Аппаратное устройство, микропрограммное, системное и прикладное программное обеспечение",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.211",
        "numeric_id":  211,
        "name":  "Угроза использования непроверенных пользовательских данных при формировании конфигурационного файла, используемого программным обеспечением администрирования информационных систем",
        "description":  "Угроза заключается в возможности деструктивного воздействия на информационную систему и обрабатываемую ею информацию в результате работы программного обеспечения, используемого для администрирования информационных систем.\nДанная угроза связана со слабостями процедуры проверки пользовательских данных, используемых при формировании конфигурационного файла для программного обеспечения администрирования информационных систем.\nРеализация данной угрозы возможна в случае, если в информационной системе используется программное обеспечение администрирования информационных систем, которое в качестве исходных данных использует конфигурационные файлы, сформированные на основе пользовательских данных",
        "violator_source":  "Внутренний нарушитель с низким потенциалом",
        "target_object":  "Системное программное обеспечение",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.212",
        "numeric_id":  212,
        "name":  "Угроза перехвата управления информационной системой",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информационным, программным и вычислительным ресурсам информационной системы в результате подмены средств централизованного управления информационной системой или её компонентами.\nДанная угроза обусловлена наличием у средств централизованного управления программных интерфейсов взаимодействия с другими субъектами доступа (процессами, программами) и, как следствие, возможностью несанкционированного доступа к данным средствам централизованного управления, а также недостаточностью мер по разграничению доступа к ним.\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на осуществление взаимодействия со средствами централизованного управления",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Инфраструктура информационных систем",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.213",
        "numeric_id":  213,
        "name":  "Угроза обхода многофакторной аутентификации",
        "description":  "Угроза заключается в возможности обхода многофакторной аутентификации путем внедрения вредоносного кода в дискредитируемую систему и компоненты, участвующие в процедуре многофакторной аутентификации.\nДанная угроза обусловлена:\nналичием уязвимостей программного обеспечения;\nслабостями мер антивирусной защиты и разграничения доступа.\nРеализация данной угрозы возможна:\nв случае работы дискредитируемого пользователя с файлами, поступающими из недоверенных источников;\nпри наличии у него привилегий установки программного обеспечения",
        "violator_source":  "Внешний нарушитель с высоким потенциалом",
        "target_object":  "Системное программное обеспечение, микропрограммное обеспечение, учетные данные пользователя",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.214",
        "numeric_id":  214,
        "name":  "Угроза несвоевременного выявления и реагирования компонентами информационной (автоматизированной) системы (в том числе средствами защиты информации) на события безопасности информации",
        "description":  "Угроза заключается в пропуске и/или значительной временной задержке определения (выявления) событий безопасности информации, что приводит к отсутствию реакции на попытки несанкционированного доступа в информационную (автоматизированную) систему, на внедрение вредоносных программ.\nДанная угроза обусловлена некорректной настройкой компонентов информационной (автоматизированной) системы и/или средств защиты информации, а также отсутствием таких компонентов и/или средств защиты информации.\nРеализация данной угрозы возможна при отсутствии мер защиты, связанных с мониторингом, сбором и анализом данных о событиях информационной безопасности (отсутствием мер регистрации событий безопасности)",
        "violator_source":  "Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение, каналы связи (передачи) данных",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.215",
        "numeric_id":  215,
        "name":  "Угроза несанкционированного доступа к системе при помощи сторонних сервисов",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на дискредитируемую систему с использованием сторонних легитимных сервисов (социальных сетей, мессенджеров, репозиториев кода и т.п.), используемых в качестве посредника.\nРеализация данной угрозы возможна если дискредитируемая система уже скомпрометирована.",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение (программы)",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.216",
        "numeric_id":  216,
        "name":  "Угроза получения несанкционированного доступа к приложениям, установленным на Smart-картах",
        "description":  "Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к приложениям, установленным на Smart-картах путем отправки специально сформированных команд управления (например, специально сформированных SMS-сообщений, отправленных на SIM-карту).\nДанная угроза обусловлена наличием уязвимостей в приложениях, устанавливаемых на Smart-карты.\nРеализация данной угрозы возможна при использовании Smart-карт типа Java Card",
        "violator_source":  "Внешний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение (программы)",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.217",
        "numeric_id":  217,
        "name":  "Угроза использования скомпрометированного доверенного источника обновлений программного обеспечения",
        "description":  "Угроза заключается в возможности внедрения вредоносного кода в информационную систему за счет использования скомпрометированных доверенных источников обновлений программного обеспечения.\nРеализация данной угрозы возможна при использовании скомпрометированных доверенных серверов обновлений программного обеспечения",
        "violator_source":  "Внутренний нарушитель со средним потенциалом; Внешний нарушитель со средним потенциалом",
        "target_object":  "Информационная система, файлы",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.218",
        "numeric_id":  218,
        "name":  "Угроза раскрытия информации о модели машинного обучения",
        "description":  "Угроза заключается в возможности раскрытия нарушителем информации о модели машинного обучения, используемой в информационной (автоматизированной) системе.\nДанная угроза обусловлена слабостями разграничения доступа в информационных (автоматизированных) системах, использующих машинное обучение.\nРеализация данной угрозы возможна при наличии у нарушителя непосредственного доступа к модели машинного обучения",
        "violator_source":  "Внешний нарушитель с высоким потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение (программы), использующее машинное обучение; модели машинного обучения",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Архивная"
    },
    {
        "id":  "УБИ.219",
        "numeric_id":  219,
        "name":  "Угроза хищения обучающих данных",
        "description":  "Угроза заключается в возможности хищения нарушителем обучающих данных, используемых в информационной (автоматизированной) системе, реализующей технологии искусственного интеллекта.\nДанная угроза обусловлена слабостями разграничения доступа к обучающим данным, используемым в информационной (автоматизированной) системе.\nРеализация данной угрозы возможна при наличии у нарушителя непосредственного доступа к обучающим данным",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение (программы), использующее машинное обучение; обучающие данные машинного обучения",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Архивная"
    },
    {
        "id":  "УБИ.220",
        "numeric_id":  220,
        "name":  "Угроза нарушения функционирования («обхода») средств, реализующих технологии искусственного интеллекта",
        "description":  "Угроза заключается в возможности нарушения функционирования («обхода») нарушителем средств, реализующих технологии искусственного интеллекта.\nДанная угроза обусловлена следующими причинами:\n- отсутствие в обучающей выборке необходимых данных;\n- наличием недостатков модели машинного обучения;",
        "violator_source":  "Внешний нарушитель с высоким потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение (программы), реализующие технологии искусственного интеллекта",
        "confidentiality":  true,
        "integrity":  false,
        "availability":  false,
        "status":  "Архивная"
    },
    {
        "id":  "УБИ.221",
        "numeric_id":  221,
        "name":  "Угроза модификации модели машинного обучения путем искажения («отравления») обучающих данных",
        "description":  "Угроза заключается в возможности модификации (искажения) модели машинного обучения, используемой в информационной (автоматизированной) системе, реализующей технологии искусственного интеллекта.\nДанная угроза обусловлена:\n- недостатками реализации процесса машинного обучения;\n- недостатками устройства алгоритмов машинного обучения.\nРеализация данной угрозы возможна при наличии у нарушителя возможности воздействовать на процесс машинного обучения",
        "violator_source":  "Внешний нарушитель с высоким потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Программное обеспечение (программы), использующее машинное обучение; модели машинного обучения; обучающие данные машинного обучения",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  false,
        "status":  "Архивная"
    },
    {
        "id":  "УБИ.222",
        "numeric_id":  222,
        "name":  "Угроза подмены модели машинного обучения",
        "description":  "Угроза заключается в возможности подмены нарушителем модели машинного обучения, используемой в информационной (автоматизированной) системе, реализующей технологии искусственного интеллекта.\nДанная угроза обусловлена слабостями разграничения доступа в информационных (автоматизированных) системах, использующих машинное обучение.\nРеализация данной угрозы возможна при наличии у нарушителя непосредственного доступа к модели машинного обучения",
        "violator_source":  "Внутренний нарушитель с высоким потенциалом",
        "target_object":  "Программное обеспечение (программы), использующее машинное обучение; модели машинного обучения",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  false,
        "status":  "Архивная"
    },
    {
        "id":  "УБИ.223",
        "numeric_id":  223,
        "name":  "Угроза несанкционированного доступа к контейнерам, предоставляющего пользователям расширенные привилегии",
        "description":  "Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия путем получения повышенных привилегий при несанкционированном использовании docker-контейнера.\nДанная угроза обусловлена наличием у docker-контейнеров повышенных привилегий для работы в системе.\nРеализация данной угрозы возможна при условии наличия у нарушителя доступа к docker-контейнеру и привилегий, достаточных для работы с ним",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Docker-контейнер",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.224",
        "numeric_id":  224,
        "name":  "Угроза нарушения целостности (подмены) контейнеров",
        "description":  "Угроза заключается в возможности запуска нарушителем собственного docker-контейнера, функционирующего по уровню логического воздействия ниже компрометируемого docker-контейнера.\nДанная угроза обусловлена уязвимостями программного обеспечения docker-контейнера, реализующего функцию изолированной программной среды для функционирующих в ней программ, а также слабостями инструкций аппаратной поддержки контейнеризации на уровне процессора.\nРеализация данной угрозы приводит не только к компрометации docker-контейнера, но и запущенных в созданной им среде средств защиты",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Информационная система, сетевой узел, носитель информации, объекты файловой системы, учетные данные пользователя, образ docker-контейнера",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.225",
        "numeric_id":  225,
        "name":  "Угроза нарушения изоляции контейнеров",
        "description":  "Угроза заключается в возможности нарушения целостности изолированного программного кода своего и (или) других docker-контейнеров, а также параметров его (их) настроек.\nДанная угроза обусловлена наличием уязвимостей программного кода службы контейнеризации, обеспечиваемого изолированность программной среды и защиты от несанкционированного доступа со стороны нарушителя.\nРеализация данной угрозы возможна при условии осуществления успешно реализованного несанкционированного доступа со стороны нарушителя и (или) вредоносной программы к docker-контейнеру.",
        "violator_source":  "Внешний нарушитель с низким потенциалом; Внутренний нарушитель с низким потенциалом",
        "target_object":  "Сервер, рабочая станция, docker-контейнер, машинный носитель информации, метаданные",
        "confidentiality":  false,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.226",
        "numeric_id":  226,
        "name":  "Угроза внедрения вредоносного программного обеспечения в контейнеры",
        "description":  "Угроза заключается в возможности нарушителя внедрения вредоносного программного обеспечения в существующий docker-контейнер для дальнейшего деструктивного воздействия на объекты системы.\nДанная угроза обусловлена наличием уязвимостей программного кода службы контейнеризации, обеспечиваемого изолированность программной среды и защиты от несанкционированного доступа со стороны нарушителя.\nРеализация данной угрозы возможна при условии успешного преодоления вредоносным программным кодом границ docker-контейнера за счет эксплуатации уязвимостей службы контейнеризации и воздействия с других уровней функционирования системы.",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Docker-контейнер",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    },
    {
        "id":  "УБИ.227",
        "numeric_id":  227,
        "name":  "Угроза модификации (подмены) образов контейнеров",
        "description":  "Угроза заключается в возможности осуществления деструктивного программного воздействия на дискредитируемую систему или опосредованного деструктивного программного воздействия через нее на другие системы путем осуществления несанкционированного доступа к образам docker-контейнеров.\nДанная угроза обусловлена слабостями мер разграничения доступа к образам docker-контейнеров, реализованных в программном обеспечении контейнеризации.\nРеализация данной угрозы может привести к нарушению конфиденциальности информации, целостности программного обеспечения и доступности ресурсов docker-контейнеров, а также создания ботнета путем внедрения вредоносного программного обеспечения в образы docker-контейнеров, используемых в качестве шаблонов.",
        "violator_source":  "Внешний нарушитель со средним потенциалом; Внутренний нарушитель со средним потенциалом",
        "target_object":  "Образ docker-контейнера, сетевой узел, сетевое программное обеспечение, docker-контейнер",
        "confidentiality":  true,
        "integrity":  true,
        "availability":  true,
        "status":  "Опубликована"
    }
];

var asutpCatalog = {
    "objects":  [
                    {
                        "id":  "4355d946-a082-4bbc-a75d-a0c38ead8397",
                        "code":  "ОА.001",
                        "title":  "Автоматизированное рабочее место оператора (диспетчера)",
                        "description":  "Офисные или промышленные компьютеры, предназначенные для реализации функций диспетчерского контроля и управления технологическим процессом; обеспечения человеко-машинного интерфейса; отображения значений основных параметров технологического процесса. АРМ обмениваются информацией с программируемыми логическими контроллерами (ПЛК) нижнего уровня АСУ ТП либо через SCADA-серверы (если таковые имеются), либо напрямую (в случае, если установленная на них SCADA-система имеет возможность получения данных непосредственно от ПЛК)",
                        "default_criticality":  3,
                        "category":  "Workstation"
                    },
                    {
                        "id":  "f850493c-5ad0-451d-83f7-67992836f7ab",
                        "code":  "ОА.002",
                        "title":  "Автоматизированное рабочее место инженера (инженерная станция)",
                        "description":  "Офисные или промышленные компьютеры, предназначенные для создания и отладки специального прикладного программного обеспечения АРМ управления ТП, SCADA-серверов или ПЛК, которая может быть подключена к ЛВС АСУ ТП как постоянно, так и периодически (на время планово-предупредительного ремонта, перенастройки ПЛК, SCADA-серверов и т.д.)",
                        "default_criticality":  4,
                        "category":  "Workstation"
                    },
                    {
                        "id":  "8be30587-544b-411e-96c8-83c1dc1fee29",
                        "code":  "ОА.003",
                        "title":  "Промышленный сервер",
                        "description":  "Совокупность средств вычислительной техники и программных средств, предназначенная для сбора и хранения данных с программируемых логических контроллеров и передачи технологической информации на АРМ оператора",
                        "default_criticality":  4,
                        "category":  "Server"
                    },
                    {
                        "id":  "5eb1325e-63a3-431c-9a83-1886c5f22d09",
                        "code":  "ОА.004",
                        "title":  "Сервер архивов",
                        "description":  "Совокупность средств вычислительной техники и программных средств, обеспечивающая хранение информации о ходе технологического процесса, а также о действиях АСУ ТП и ее составляющих, непосредственно не участвующая в процессе управления технологическим процессом",
                        "default_criticality":  3,
                        "category":  "Server"
                    },
                    {
                        "id":  "a24dd8a6-a936-4434-a87c-9999e75fd9b9",
                        "code":  "ОА.005",
                        "title":  "Панель оператора",
                        "description":  "Специализированное вычислительное устройство отображения человеко-машинного интерфейса, изготовленное в виде сенсорного экрана и используемое для отображение основных значений параметров технологического процесса, управления автоматизированными устройствами или записи и считывания параметров в другие приборы в составе АСУ ТП, а также для приема и передачи на ПЛК управляющих воздействий оператора и приема уставок управления",
                        "default_criticality":  3,
                        "category":  "Field Device"
                    },
                    {
                        "id":  "fed42c8b-93c7-4174-9b73-294c12ffdac0",
                        "code":  "ОА.006",
                        "title":  "Программируемый логический контроллер",
                        "description":  "Специальные программно-аппаратные комплексы, осуществляющие автоматический сбор, обработку и передачу информации на верхний уровень, поступающей с датчиков, а также выдачу управляющих воздействий на исполнительные механизмы на основании алгоритмов и программ, заданных ему программистом. ПЛК обмениваются информацией по промышленной сети с элементами диспетчерского уровня",
                        "default_criticality":  4,
                        "category":  "Controller"
                    },
                    {
                        "id":  "bcdc0d1c-e838-4849-8129-6cf0dbad49c6",
                        "code":  "ОА.007",
                        "title":  "Программируемый логический контроллер системы противоаварийной защиты",
                        "description":  "Специальные программно-аппаратные комплексы, осуществляющие безаварийный останов технологического процесса (его участка) в случае возникновения различных нештатных ситуаций, при которых значения параметров технологического процесса выходят за установленные аварийные границы",
                        "default_criticality":  4,
                        "category":  "Controller"
                    },
                    {
                        "id":  "becccd61-7bf5-4afa-b38c-fcbc998d9a82",
                        "code":  "ОА.008",
                        "title":  "Датчики и исполнительные механизмы",
                        "description":  "Программно-аппаратные компоненты, позволяющие передавать технологическую информацию с помощью протоколов передачи данных",
                        "default_criticality":  2,
                        "category":  "Field Device"
                    },
                    {
                        "id":  "765d6309-be4f-4fa0-b0ac-0c63a26cda9b",
                        "code":  "ОА.009",
                        "title":  "Съемный носитель информации",
                        "description":  "Автономное устройство, предназначенное для записи и хранения данных (флэш-накопители, оптические диски, съемные жесткие диски и т.д.)",
                        "default_criticality":  4,
                        "category":  "Removable Media"
                    },
                    {
                        "id":  "9d311a40-300e-4648-a125-dcb3a935ef6c",
                        "code":  "ОА.010",
                        "title":  "Устройство промышленного интернета-вещей",
                        "description":  "Программно-техническое средство, использующее датчики и API-интерфейсы для связи и обмена данными в сети",
                        "default_criticality":  2,
                        "category":  "IoT"
                    },
                    {
                        "id":  "260b4b1d-6cc7-4a4d-9e3a-d954db624489",
                        "code":  "ОА.011",
                        "title":  "Активное сетевое оборудование",
                        "description":  "Оборудование, содержащее электронные схемы, получающее питание от электрической сети или других источников питания и выполняющее функции преобразования, усиления и передачи сигналов, а также обрабатывающее техническую информацию, перенаправляя и распределяя потоки в соответствии с встроенными алгоритмами. К активному сетевому оборудованию относятся: маршрутизаторы, коммутаторы, медиаконвертеры, трансиверы, мосты, шлюзы, ретрансляторы, сетевые адаптеры и проч.",
                        "default_criticality":  3,
                        "category":  "Network"
                    },
                    {
                        "id":  "61c25512-c48c-4193-baea-5f6678d5759d",
                        "code":  "ОА.012",
                        "title":  "Средства защиты информации",
                        "description":  "Программное или программно-техническое средство, предназначенное для предотвращения или существенного затруднения несанкционированного доступа к информации",
                        "default_criticality":  4,
                        "category":  "Security"
                    },
                    {
                        "id":  "8961a9e3-51e9-4167-a33f-9eb37b597afd",
                        "code":  "ОА.013",
                        "title":  "Мобильное устройство",
                        "description":  "Мобильный программно-технический комплекс, предназначенный для автоматизации определенного вида деятельности (например, планшетные компьютеры, смартфоны)",
                        "default_criticality":  2,
                        "category":  "Mobile"
                    },
                    {
                        "id":  "ac1b2973-9750-4093-b159-407c90755265",
                        "code":  "ОА.014",
                        "title":  "Оборудование (станок) с ЧПУ",
                        "description":  "Оборудование с ЧПУ предназначено для автоматического управления обработкой материала и мониторинга процесса обработки в реальном времени.",
                        "default_criticality":  3,
                        "category":  "Network"
                    }
                ],
    "threats":  [
                    {
                        "id":  "41683af3-eccb-4cbb-885c-aceba22a3e6d",
                        "code":  "УТП:01",
                        "title":  "Угроза утечки информации",
                        "description":  "Угроза заключается в возможности противоправного получения либо передачи информации (конфиденциальной, конфигурационной, аутентификационной, управляющей, измерительной и др.). Например, утечка значений параметров технологического процесса с автоматизированного рабочего места оператора технологическим процессом"
                    },
                    {
                        "id":  "cc419fd2-0524-450e-89cd-2c23d223c9db",
                        "code":  "УТП:02",
                        "title":  "Угроза получения информационных ресурсов из недоверенного или скомпрометированного источника",
                        "description":  "Угроза заключается в возможности нарушения функционирования автоматизированной системы управления технологическим процессом и (или) внедрения в ее состав вредоносных программных или программно-аппаратных средств в результате получения компонентов программного обеспечения или его обновлений из недоверенных или скомпрометированных источников. Например, загрузка обновлений, содержащих программные закладки"
                    },
                    {
                        "id":  "830bcfe2-6223-496f-a151-a6b6a38c28ca",
                        "code":  "УТП:03",
                        "title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП",
                        "description":  "Угроза заключается в возможности получения удаленного доступа к информационным ресурсам автоматизированной системы управления технологическим процессом с использованием штатных средств удаленного доступа, предоставляемых компонентами автоматизированной системы управления технологическим процессом, и (или) проведения сетевой атаки. Например, использование сервисов и ресурсов корпоративной сети предприятия для получения доступа к компонентам АСУ ТП"
                    },
                    {
                        "id":  "9361848c-14b7-46ca-9b32-212b7155a26e",
                        "code":  "УТП:04",
                        "title":  "Угроза несанкционированного доступа",
                        "description":  "Угроза заключается в возможности получения доступа к информационным ресурсам, нарушающего установленные в автоматизированной системе управления технологическим процессом правила разграничения доступа, с использованием штатных средств, предоставляемых компонентами автоматизированной системы управления технологическим процессом. Например, несанкционированный доступ к информации, хранимой на файловом хранилище."
                    },
                    {
                        "id":  "f978e564-3734-4e26-b246-04176b47fd01",
                        "code":  "УТП:05",
                        "title":  "Угроза несанкционированной модификации (искажения)",
                        "description":  "Угроза заключается в возможности изменения содержания или формы представления обрабатываемой в автоматизированной системе управления технологическим процессом информации (конфигурационной, аутентификационной, управляющей, измерительной и др.), нарушающего установленный в автоматизированной системе управления технологическим процессом порядок обработки информации и правила разграничения доступа. Например, искажение отображаемой средствами человеко-машинного интерфейса информации"
                    },
                    {
                        "id":  "840b97b3-3f2a-479e-8ca1-1f5c365e35a7",
                        "code":  "УТП:06",
                        "title":  "Угроза несанкционированной подмены",
                        "description":  "Угроза заключается в возможности внедрения ложного или подмены существующего компонента автоматизированной системы управления технологическим процессом и (или) обрабатываемой с его использованием информации. Например, несанкционированная загрузка в ПЛК некорректных значений переменных"
                    },
                    {
                        "id":  "dff16d6c-fa76-4860-8e37-bd846c965bed",
                        "code":  "УТП:07",
                        "title":  "Угроза удаления информационных ресурсов",
                        "description":  "Угроза заключается в возможности удаления обрабатываемой в автоматизированной системе управления технологическим процессом информации (конфиденциальной, конфигурационной, аутентификационной, управляющей, измерительной и др.), нарушающего установленные в автоматизированной системе управления технологическим процессом правила разграничения доступа. Например, удаление файлов проектов управления и контроля"
                    },
                    {
                        "id":  "72fe0f9d-593b-4464-9bca-6c225ec9945c",
                        "code":  "УТП:08",
                        "title":  "Угроза отказа в обслуживании",
                        "description":  "Угроза заключается в недоступности автоматизированной системы управления технологическим процессом или ее компонентов и (или) приостановлении оказания услуг или предоставления сервисов для авторизованных пользователей (в том числе до перезагрузки или проведения восстановительных работ). Например, вывод из строя (отказ в обслуживании) модуля ввода-вывода"
                    },
                    {
                        "id":  "39c64161-b0fb-4be8-b164-06b0c94070ab",
                        "code":  "УТП:09",
                        "title":  "Угроза нарушения функционирования (работоспособности)",
                        "description":  "Угроза заключается в возможности нарушения штатного функционирования компонентов автоматизированной системы управления технологическим процессом и (или) задержке (замедлении) времени обработки информации. Например, выключение или перезагрузка ПЛК за счет несанкционированной отправки специального сетевого пакета"
                    },
                    {
                        "id":  "7da7d27d-b5c3-44ee-b935-8b61dfe48196",
                        "code":  "УТП:10",
                        "title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления",
                        "description":  "Угроза заключается в возможности сбора нарушителем данных о конфигурации АСУ ТП, учетных записях пользователей, применяемом программных и программно-аппаратных средствах, перечнях открытых портов и запущенных сервисов, возможных уязвимостей программного обеспечения, используемых протоколах передачи данных и другой информации, необходимой для реализации компьютерной атаки. Например, сканирование технологической сети для определения доступных хостов"
                    }
                ],
    "methods":  [
                    {
                        "id":  "e291df12-3314-4d2d-b247-d5c60b25639a",
                        "code":  "СПА.01.001",
                        "title":  "Эксплуатация известных уязвимостей",
                        "group":  "Эксплуатация уязвимостей"
                    },
                    {
                        "id":  "5624bdc1-aa0f-4c67-8780-1a44ad5f7c18",
                        "code":  "СПА.01.002",
                        "title":  "Эксплуатация уязвимостей «нулевого дня»",
                        "group":  "Эксплуатация уязвимостей"
                    },
                    {
                        "id":  "8505e356-5bce-4210-933d-322b6560fc96",
                        "code":  "СПА.02.001",
                        "title":  "Использование недостатков, связанных с неполнотой проверки вводимых (входных) данных",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "3ff938af-0874-4afb-bf2e-5847058bb753",
                        "code":  "СПА.02.002",
                        "title":  "Использование недостатков, связанных с управлением учетными данными",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "02aeb703-896c-4d8c-8f95-cc0784697b02",
                        "code":  "СПА.02.003",
                        "title":  "Использование недостатков, связанных с отсутствием проверки достоверности отправителя и/или получателя",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "8fb3f58e-49ba-4ab3-8a21-503e58efb231",
                        "code":  "СПА.02.006",
                        "title":  "Использование недостатков, связанных с использованием нестойкой криптографии",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "c0b4f402-c863-47db-bd50-34740fc8da7f",
                        "code":  "СПА.02.007",
                        "title":  "Использование недостатков, связанных с некорректной настройкой сетевого доступа",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "e7e51ec4-637e-4af1-9901-64bf4393f219",
                        "code":  "СПА.02.008",
                        "title":  "Использование недостатков, связанных с некорректной настройкой сетевого доступа",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "3633e354-aee8-4089-b137-8b2641317dba",
                        "code":  "СПА.02.009",
                        "title":  "Использование недостатков конфигурации, связанных с отсутствием проверки сертификата сети (для беспроводных сетей)",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "84a12dab-ace3-447b-809b-da41ecdc32ab",
                        "code":  "СПА.02.010",
                        "title":  "Использование недостатков конфигурации сетевого оборудования, связанных с отсутствием или некорректной фильтрацией трафика",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "37c804ea-9382-43f5-aada-6d1f205440e2",
                        "code":  "СПА.02.011",
                        "title":  "Использование недостатков, связанных с некорректной настройкой прав доступа",
                        "group":  "Использование недостатков конфигурации"
                    },
                    {
                        "id":  "4a7491e9-d696-4989-9fb6-726479cefa67",
                        "code":  "СПА.03.001",
                        "title":  "Эксплуатация недостатков незащищенных протоколов передачи данных",
                        "group":  "Использование недостатков архитектуры"
                    },
                    {
                        "id":  "7f7aa5aa-3707-486f-b15a-b04e3ecb7440",
                        "code":  "СПА.03.002",
                        "title":  "Эксплуатация недостатков децентрализованного и неконтролируемого подключения к сети Интернет",
                        "group":  "Использование недостатков архитектуры"
                    },
                    {
                        "id":  "c59b9e9d-9040-432b-aed8-6930c0955102",
                        "code":  "СПА.04.001",
                        "title":  "Внедрение вредоносного программного обеспечения через электронную почту",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "0aa78c62-7fc9-4e46-9089-c14d8adcff11",
                        "code":  "СПА.04.002",
                        "title":  "Внедрение вредоносного программного обеспечения через съемные носители информации",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "a6035594-21fd-42c2-b020-2dded86ab5d8",
                        "code":  "СПА.04.003",
                        "title":  "Внедрение вредоносного программного обеспечения через посещение сайтов",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "42e43941-8e61-4a60-a0af-6e1065a18aac",
                        "code":  "СПА.04.004",
                        "title":  "Внедрение вредоносного программного обеспечения через сетевое взаимодействие",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "644b2593-ac36-4dc5-9edb-03a0bb4a6742",
                        "code":  "СПА.04.005",
                        "title":  "Внедрение вредоносного программного обеспечения через средства удаленного управления/доступа",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "0f21dcfe-04e0-46ea-9f42-9c6b88fce1bf",
                        "code":  "СПА.04.006",
                        "title":  "Внедрение вредоносного программного обеспечения через средства установки/обновления программного обеспечения",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "9f31a472-cd8f-4b23-9328-8554335c5d18",
                        "code":  "СПА.04.007",
                        "title":  "Внедрение вредоносного программного обеспечения через формы приема файлов",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "8d9c22a9-7b55-4ad3-9796-ccf9cee784c6",
                        "code":  "СПА.04.008",
                        "title":  "Внедрение вредоносного программного обеспечения через файлообменные ресурсы (FTP, SMB и т.п.)",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "d79d66d5-fd90-4713-a736-fb1e121e4aed",
                        "code":  "СПА.04.009",
                        "title":  "Внедрение вредоносного программного обеспечения через мессенджеры, системы видеоконференцсвязи",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "509f8e12-7cae-488b-8eaa-98176f8cf3b5",
                        "code":  "СПА.04.010",
                        "title":  "Внедрение вредоносного программного обеспечения через скомпрометированные обновления программного обеспечения или операционной системы",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "908c8576-da66-49b1-b9b4-664207daa5ee",
                        "code":  "СПА.04.011",
                        "title":  "Внедрение вредоносного ПО через компрометацию инфраструктуры подрядчика, среды сборки разработчика (подрядчика) и (или) службы технической поддержки",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "c67a0c3a-9a4b-4878-b7f7-6c4e74375836",
                        "code":  "СПА.04.012",
                        "title":  "Внедрение вредоносного ПО через установку приложений из магазина приложений",
                        "group":  "Внедрение вредоносного программного обеспечения"
                    },
                    {
                        "id":  "4d839eed-94b6-4f10-bce0-8f2f398eeae4",
                        "code":  "СПА.05.001",
                        "title":  "Внедрение закладок в прикладное программное обеспечение",
                        "group":  "Внедрение программных и аппаратных закладок"
                    },
                    {
                        "id":  "64fa823c-c5b6-44c0-9f04-51a6fa1de032",
                        "code":  "СПА.05.002",
                        "title":  "Внедрение закладок, являющихся драйверами устройств",
                        "group":  "Внедрение программных и аппаратных закладок"
                    },
                    {
                        "id":  "9d7d32f6-82cf-4b7f-a4dd-e429cec3fdbd",
                        "code":  "СПА.05.003",
                        "title":  "Внедрение закладок, имитирующих интерфейсы служебных программ",
                        "group":  "Внедрение программных и аппаратных закладок"
                    },
                    {
                        "id":  "6d71af11-3102-4912-ba63-89f2a7a835c3",
                        "code":  "СПА.05.004",
                        "title":  "Внедрение аппаратных закладок",
                        "group":  "Внедрение программных и аппаратных закладок"
                    },
                    {
                        "id":  "b2554efd-efd6-41da-a124-efec3834b562",
                        "code":  "СПА.05.005",
                        "title":  "Внедрение закладок в системное программное обеспечение",
                        "group":  "Внедрение программных и аппаратных закладок"
                    },
                    {
                        "id":  "c9f35175-eea0-43ba-bacb-21c6e38dc9be",
                        "code":  "СПА.05.006",
                        "title":  "Внедрение закладок в системы Out-of-Band управления (Intel ME, iDrac, iLo etc)",
                        "group":  "Внедрение программных и аппаратных закладок"
                    },
                    {
                        "id":  "2029a512-cd3f-4541-9ac8-c595d993a23e",
                        "code":  "СПА.05.007",
                        "title":  "Внедрение закладок в микропрограммное обеспечение",
                        "group":  "Внедрение программных и аппаратных закладок"
                    },
                    {
                        "id":  "1c035e7f-19ce-4c59-8e2e-3e36ec9fb191",
                        "code":  "СПА.05.008",
                        "title":  "Внедрение закладок в код веб-приложения",
                        "group":  "Внедрение программных и аппаратных закладок"
                    },
                    {
                        "id":  "5fb98fa1-1bb0-4afa-85d2-f89185a40cca",
                        "code":  "СПА.06.001",
                        "title":  "Использование недекларированных возможностей аппаратных средств",
                        "group":  "Использование недекларированных возможностей"
                    },
                    {
                        "id":  "e2281d87-1dac-4943-968f-278335853361",
                        "code":  "СПА.06.002",
                        "title":  "Использование недекларированных возможностей операционных систем",
                        "group":  "Использование недекларированных возможностей"
                    },
                    {
                        "id":  "4b02e349-6182-41d6-8f51-739556a3761c",
                        "code":  "СПА.06.003",
                        "title":  "Использование недекларированных возможностей прикладного программного обеспечения",
                        "group":  "Использование недекларированных возможностей"
                    },
                    {
                        "id":  "0b683015-0415-4eb3-82c7-3ebbeae21d4c",
                        "code":  "СПА.07.001",
                        "title":  "Прослушивание интерфейсов сети",
                        "group":  "Прослушивание (захват) сетеого трафика"
                    },
                    {
                        "id":  "9c8cdb45-8cae-4ea0-9e89-ba17a88e8d9d",
                        "code":  "СПА.07.002",
                        "title":  "Подключение устройства перехвата в разрыв канала передачи данных",
                        "group":  "Прослушивание (захват) сетеого трафика"
                    },
                    {
                        "id":  "4fe324cb-0304-4e3d-81d6-a1de7c90ddd3",
                        "code":  "СПА.07.003",
                        "title":  "Атаки на уровне каналов и сети, приводящие к изменению маршрутов",
                        "group":  "Прослушивание (захват) сетеого трафика"
                    },
                    {
                        "id":  "cd9e614f-61b7-4e98-b5e1-29457c700a6f",
                        "code":  "СПА.07.004",
                        "title":  "Перенаправление трафика",
                        "group":  "Прослушивание (захват) сетеого трафика"
                    },
                    {
                        "id":  "42909f92-86b7-4769-82aa-dd54de5cc790",
                        "code":  "СПА.07.005",
                        "title":  "Прослушивание широковещательного трафика",
                        "group":  "Прослушивание (захват) сетеого трафика"
                    },
                    {
                        "id":  "968975ee-3290-45a7-8140-f4f209c62800",
                        "code":  "СПА.07.006",
                        "title":  "Врезка в линию связи считывающего устройства не вразрыв (физическое подключение к проводам)",
                        "group":  "Прослушивание (захват) сетеого трафика"
                    },
                    {
                        "id":  "707168af-d5ae-48d6-b627-2be6a6c81c92",
                        "code":  "СПА.07.007",
                        "title":  "Зеркалирование трафика",
                        "group":  "Прослушивание (захват) сетеого трафика"
                    },
                    {
                        "id":  "7e9b7eab-960a-4479-bcd9-455fa63347c7",
                        "code":  "СПА.08.001",
                        "title":  "Обнаружение открытых портов",
                        "group":  "Сканирование сетевой инфраструктуры"
                    },
                    {
                        "id":  "d900446a-f773-4ea8-b397-70b80ac88e73",
                        "code":  "СПА.08.002",
                        "title":  "Обнаружение сетевых служб",
                        "group":  "Сканирование сетевой инфраструктуры"
                    },
                    {
                        "id":  "9c514c29-d3b4-40fc-a550-5cdff7692932",
                        "code":  "СПА.08.003",
                        "title":  "Обнаружение устройств",
                        "group":  "Сканирование сетевой инфраструктуры"
                    },
                    {
                        "id":  "79b432bd-a045-4ddc-97a2-e23b30feab30",
                        "code":  "СПА.08.004",
                        "title":  "Идентификация программного обеспечения и его версий с целью поиска уязвимостей",
                        "group":  "Сканирование сетевой инфраструктуры"
                    },
                    {
                        "id":  "195f39b3-ecf5-4875-baa2-03a95cf5867c",
                        "code":  "СПА.08.005",
                        "title":  "Идентификация пользователей",
                        "group":  "Сканирование сетевой инфраструктуры"
                    },
                    {
                        "id":  "671e6528-c5f4-4c1f-9a1c-c454c8b9f024",
                        "code":  "СПА.08.006",
                        "title":  "Обнаружение доступных общих сетевых каталогов",
                        "group":  "Сканирование сетевой инфраструктуры"
                    },
                    {
                        "id":  "8acb32c9-3af9-47e1-b3c8-81e39c95157a",
                        "code":  "СПА.08.007",
                        "title":  "Обнаружение доступных директорий веб-сайтов",
                        "group":  "Сканирование сетевой инфраструктуры"
                    },
                    {
                        "id":  "2c1368f2-39cd-40b5-90ef-7b3d3b0d260b",
                        "code":  "СПА.08.008",
                        "title":  "Обнаружение существующих доменных имен (DNS-имен)",
                        "group":  "Сканирование сетевой инфраструктуры"
                    },
                    {
                        "id":  "369ec853-fda4-41ff-aa76-915f7f8d8785",
                        "code":  "СПА.09.001",
                        "title":  "Получение данных о пользователях и группах",
                        "group":  "Изучение информации о системы"
                    },
                    {
                        "id":  "13393a9b-a95c-4151-a1b9-425a3ead3f2e",
                        "code":  "СПА.09.002",
                        "title":  "Получение данных об аппаратном обеспечении",
                        "group":  "Изучение информации о системы"
                    },
                    {
                        "id":  "6366caeb-d26d-4888-b2ac-3d28e41505cd",
                        "code":  "СПА.09.003",
                        "title":  "Получение данных о процессах",
                        "group":  "Изучение информации о системы"
                    },
                    {
                        "id":  "d6c15b72-3bcc-4ee8-82ad-a9950cff637d",
                        "code":  "СПА.09.004",
                        "title":  "Получение данных о настройках безопасности",
                        "group":  "Изучение информации о системы"
                    },
                    {
                        "id":  "6c768bfa-fc68-4b1f-b433-f7d571ade1c9",
                        "code":  "СПА.09.005",
                        "title":  "Получение данных о настройках сети",
                        "group":  "Изучение информации о системы"
                    },
                    {
                        "id":  "f9d41cca-fbaf-4e30-ae10-1a24946add59",
                        "code":  "СПА.09.006",
                        "title":  "Поиск файлов и каталогов",
                        "group":  "Изучение информации о системы"
                    },
                    {
                        "id":  "f66c62e5-19a4-4e06-985b-b2c355349f1b",
                        "code":  "СПА.09.007",
                        "title":  "Получение данных об установленном программном обеспечении",
                        "group":  "Изучение информации о системы"
                    },
                    {
                        "id":  "bf9d2381-e5b4-44a6-bf86-a8def45d3c8f",
                        "code":  "СПА.09.008",
                        "title":  "Получение данных о пользователях и системах путем рассылки спам-сообщений",
                        "group":  "Изучение информации о системы"
                    },
                    {
                        "id":  "47b663e4-bb0d-47ba-93af-523e4adf1506",
                        "code":  "СПА.10.001",
                        "title":  "Атака типа \"человек посередине\" через HTTP-запросы",
                        "group":  "Атака типа \"Человек посередине\""
                    },
                    {
                        "id":  "1067b9b8-1ede-4338-a016-a99df02ad741",
                        "code":  "СПА.10.002",
                        "title":  "Атака типа \"человек посередине\" через TLS/SSL-запросы",
                        "group":  "Атака типа \"Человек посередине\""
                    },
                    {
                        "id":  "fc9d7caf-689e-417f-8a90-e8ffe11f01db",
                        "code":  "СПА.10.003",
                        "title":  "Атака типа \"человек посередине\" через DNS-сервер",
                        "group":  "Атака типа \"Человек посередине\""
                    },
                    {
                        "id":  "9e424377-d770-4e2e-acb3-82a220e6f1e4",
                        "code":  "СПА.10.004",
                        "title":  "Атака типа \"человек посередине\" путем создания поддельной точки доступа",
                        "group":  "Атака типа \"Человек посередине\""
                    },
                    {
                        "id":  "f6e98a67-7c6d-466a-a219-87852974adb8",
                        "code":  "СПА.10.005",
                        "title":  "Атака типа \"человек посередине\" путем навязывания использования поддельного Proxy-сервера",
                        "group":  "Атака типа \"Человек посередине\""
                    },
                    {
                        "id":  "4f6a6ddc-bfc7-4b36-b321-926e0d4882b9",
                        "code":  "СПА.10.006",
                        "title":  "Атака типа человек посередине путем подмены ответов на широковещательные запросы разрешения сетевых имен (LLMNR, mDNS, NetBIOS)",
                        "group":  "Атака типа \"Человек посередине\""
                    },
                    {
                        "id":  "ca3237d3-a989-46aa-815e-1c23d4b88a69",
                        "code":  "СПА.10.007",
                        "title":  "Атаки на уровне каналов и сети, приводящие к изменению маршрутов",
                        "group":  "Атака типа \"Человек посередине\""
                    },
                    {
                        "id":  "a60868af-c31d-45d1-84f5-7c283b68916f",
                        "code":  "СПА.11.001",
                        "title":  "Применение скрытых каналов по времени",
                        "group":  "Применение скрытых каналов"
                    },
                    {
                        "id":  "41fede86-9dae-4687-9447-fe8bd95bb6b3",
                        "code":  "СПА.11.002",
                        "title":  "Применение скрытых каналов по памяти",
                        "group":  "Применение скрытых каналов"
                    },
                    {
                        "id":  "0952e5f6-3fb6-4540-a3fe-cd295c19438b",
                        "code":  "СПА.11.003",
                        "title":  "Применение скрытых каналов, организованных через подключаемый носитель",
                        "group":  "Применение скрытых каналов"
                    },
                    {
                        "id":  "3a0b95fc-17ce-4713-a21a-44a0f4a4589c",
                        "code":  "СПА.11.004",
                        "title":  "Туннелирование с использованием стандартных протоколов (ssh, ipsec)",
                        "group":  "Применение скрытых каналов"
                    },
                    {
                        "id":  "38dfda02-da1f-45fc-8dd5-c1c6bff3cda4",
                        "code":  "СПА.11.005",
                        "title":  "Туннелирование путем инкапсуляции в другие протоколы (dns, smb)",
                        "group":  "Применение скрытых каналов"
                    },
                    {
                        "id":  "c75d8c43-9d50-42a8-ab06-8ea8a3a45ef0",
                        "code":  "СПА.11.006",
                        "title":  "Реализация своего сетевого стека (аналог TCP/IP)",
                        "group":  "Применение скрытых каналов"
                    },
                    {
                        "id":  "a27c8b6b-0a95-44e1-bac0-6eaf4ecb6e41",
                        "code":  "СПА.12.001",
                        "title":  "Считывание нажатий клавиш на клавиатуре",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "ecf806d0-e927-40cd-8f4c-1e1cacc32a64",
                        "code":  "СПА.12.002",
                        "title":  "Снятие видео с экрана",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "d1d2ee65-5242-427f-9947-f8a5afb90ff2",
                        "code":  "СПА.12.003",
                        "title":  "Снятие изображения с монитора",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "e8700f54-4e69-4ce4-ae19-f32b84abee9b",
                        "code":  "СПА.12.004",
                        "title":  "Снятие изображения с веб-камеры",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "4dba6f56-8e47-47fa-920e-2c5286c5c160",
                        "code":  "СПА.12.005",
                        "title":  "Считывание нажатий виртуальной клавиатуры",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "96a60a30-00fd-4f44-a6f8-d3c836fdaa9e",
                        "code":  "СПА.12.006",
                        "title":  "Снятие информации, выводимой на печать",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "95c8620b-a01d-4992-9246-8fd01ad5fa96",
                        "code":  "СПА.12.007",
                        "title":  "Снятие звука с микрофона",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "b75f8592-2396-43ed-a927-16caeaefdab6",
                        "code":  "СПА.12.008",
                        "title":  "Визуальное считывание информации",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "1a6bdc2b-3dee-4fd6-b5ab-dcc124207ccb",
                        "code":  "СПА.12.009",
                        "title":  "Считывание информации о положении курсора мыши на экране монитора",
                        "group":  "Считывание вводимой и выводимой информации"
                    },
                    {
                        "id":  "29529db6-9b0a-4bb3-b5ed-cae277825bc2",
                        "code":  "СПА.13.001",
                        "title":  "Целенаправленная рассылка через рассылку рекламных писем (спам-сообщений)",
                        "group":  "Реализация социальной инженерии"
                    },
                    {
                        "id":  "f61e80a6-dfe7-4ac4-98b6-fbcf13ea4586",
                        "code":  "СПА.13.002",
                        "title":  "Атаки через социальные сети",
                        "group":  "Реализация социальной инженерии"
                    },
                    {
                        "id":  "aaf47b36-58b2-4f0c-a63f-dc881c171f02",
                        "code":  "СПА.13.003",
                        "title":  "Веб-фишинг",
                        "group":  "Реализация социальной инженерии"
                    },
                    {
                        "id":  "0a019a95-881e-489b-8b08-677722937264",
                        "code":  "СПА.13.004",
                        "title":  "Почтовый фишинг",
                        "group":  "Реализация социальной инженерии"
                    },
                    {
                        "id":  "d5f0a896-3e7b-41d3-9a31-8266fc52c7e4",
                        "code":  "СПА.13.005",
                        "title":  "Рассылка SMS или сообщений в мессенджерах",
                        "group":  "Реализация социальной инженерии"
                    },
                    {
                        "id":  "4d714c8b-f96c-486b-a9fa-f8bded62b008",
                        "code":  "СПА.13.006",
                        "title":  "Атака путем звонка по телефону",
                        "group":  "Реализация социальной инженерии"
                    },
                    {
                        "id":  "a3343a1a-cb2a-458a-9de4-137bb3ab6c4f",
                        "code":  "СПА.13.007",
                        "title":  "Атака с использованием Deepfake",
                        "group":  "Реализация социальной инженерии"
                    },
                    {
                        "id":  "ca2175d1-3977-4710-90cf-39c38c807ad2",
                        "code":  "СПА.13.008",
                        "title":  "Подброс съемных устройств",
                        "group":  "Реализация социальной инженерии"
                    },
                    {
                        "id":  "93822c2b-c4a6-4a94-a4f9-2d7d2068ac97",
                        "code":  "СПА.14.001",
                        "title":  "Атака типа \"отказ в обслуживании\" в прикладном программном обеспечении (web-приложения, почтовые сервисы и иные)",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "37f7034c-1b96-408b-9b23-1845dbbd1e37",
                        "code":  "СПА.14.002",
                        "title":  "Атака типа \"отказ в обслуживании\" на канал передачи данных (атаки фрагментированными пакетами, smurf- атаки, SYN-flood)",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "5af25277-d7a2-4d91-85d2-a98dbd8d33f3",
                        "code":  "СПА.14.003",
                        "title":  "Распределенная атака типа \"отказ в обслуживании\" на канал передачи данных",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "fcee908f-5039-4c22-81be-9df10089206a",
                        "code":  "СПА.14.004",
                        "title":  "Распределенная атака типа «отказ в обслуживании» в прикладном программном обеспечении",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "f17a0eef-a01e-4283-8256-5b1db2f40b0a",
                        "code":  "СПА.14.005",
                        "title":  "Остановка сервиса",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "dabb07ed-dbdc-4eef-89e6-1a1f9a457e06",
                        "code":  "СПА.14.006",
                        "title":  "Перезагрузка или выключение сервера",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "debe703f-a5c8-4d89-b882-c5d8ad23e6a7",
                        "code":  "СПА.14.007",
                        "title":  "Блокировка пользователей",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "24d426d8-0a9f-4c51-8df6-a1b280a495f0",
                        "code":  "СПА.14.008",
                        "title":  "Множественный запуск программного обеспечения",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "c9c9e014-5de7-4326-94cd-5110b0fc45c9",
                        "code":  "СПА.14.009",
                        "title":  "Переполнение почтового сервера за счет рассылки спам-сообщений",
                        "group":  "Атака типа \"отказ в обслуживании\""
                    },
                    {
                        "id":  "8862c030-f737-4909-b7a9-5da326742682",
                        "code":  "СПА.15.001",
                        "title":  "Шифрование данных с применением вирусов-шифровальщиков",
                        "group":  "Шифрование данных"
                    },
                    {
                        "id":  "a35f1039-4bc7-43f4-a072-1257014cb3ae",
                        "code":  "СПА.15.002",
                        "title":  "Шифрование данных встроенными средствами",
                        "group":  "Шифрование данных"
                    },
                    {
                        "id":  "c057b275-40b7-45a2-9b33-5eaca3f171aa",
                        "code":  "СПА.16.001",
                        "title":  "Выход за пределы виртуальной инфраструктуры",
                        "group":  "Нарушение изоляции"
                    },
                    {
                        "id":  "aab62ac1-ecb4-4b2f-be2e-2824092eab92",
                        "code":  "СПА.16.002",
                        "title":  "Нарушение изоляции процессов",
                        "group":  "Нарушение изоляции"
                    },
                    {
                        "id":  "bd0a2103-0f3d-4b77-b486-87578a84d4cc",
                        "code":  "СПА.16.003",
                        "title":  "Нарушение сетевой изоляции",
                        "group":  "Нарушение изоляции"
                    },
                    {
                        "id":  "1f3cc9e8-8286-4015-999b-739ac0e211ef",
                        "code":  "СПА.16.004",
                        "title":  "Выход за пределы контейнера",
                        "group":  "Нарушение изоляции"
                    },
                    {
                        "id":  "632bb702-6565-4f68-bb77-2c614be5ed70",
                        "code":  "СПА.16.005",
                        "title":  "Выход за пределы замкнутой программной среды",
                        "group":  "Нарушение изоляции"
                    },
                    {
                        "id":  "bada87f8-9f45-4653-94a9-0c5dd8c95562",
                        "code":  "СПА.17.001",
                        "title":  "Перебор паролей к учетной записи",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "ceace093-0702-458f-8071-426c5c71e2d0",
                        "code":  "СПА.17.002",
                        "title":  "Перебор пользователей к паролю (Password Spraying)",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "7631f0de-0b81-4ec1-8eb7-8b175f31ab2b",
                        "code":  "СПА.17.003",
                        "title":  "Перебор утекших пар пользователь/пароль (Credential Stuffing)",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "c5b474ba-b3bc-4631-a22e-ac4576475aca",
                        "code":  "СПА.17.004",
                        "title":  "Перебор ключей доступа (API ключи, сессионные ключи и т.д.)",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "27110ff8-d350-44bb-a7a7-33033a658696",
                        "code":  "СПА.17.005",
                        "title":  "Перебор одноразовых кодов или ключей",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "e475d167-179a-4501-ac01-4f5fd112f432",
                        "code":  "СПА.17.006",
                        "title":  "Восстановление аутентификационной информации из аппаратных хранилищ",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "15f5e62d-4733-4630-b2e8-aa5583d1e785",
                        "code":  "СПА.17.007",
                        "title":  "Восстановление аутентификационной информации из программных хранилищ",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "e3a60f11-d380-45b1-a813-23521e11b59f",
                        "code":  "СПА.17.008",
                        "title":  "Восстановление аутентификационной информации из сетевого трафика",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "0b608718-2959-4582-a47e-adf63a38710b",
                        "code":  "СПА.17.009",
                        "title":  "Восстановление аутентификационной информации из исходного кода/конфигурационных файлов",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "53bb6d30-8e0d-4a1b-aeef-3fe32585d444",
                        "code":  "СПА.17.010",
                        "title":  "Восстановление аутентификационной информации из журналов приложений",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "a129e159-282d-4ab9-aef5-64614b993932",
                        "code":  "СПА.17.011",
                        "title":  "Перехват одноразовых паролей",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "a4e0fc0f-2c93-4705-86bd-9fbe373ae86f",
                        "code":  "СПА.17.012",
                        "title":  "Восстановление пароля из ранее полученной аутентификационной информации",
                        "group":  "Подбор (восстановление) аутентификационной информации"
                    },
                    {
                        "id":  "e5ca91ba-7a4e-4668-a4de-d093b831e397",
                        "code":  "СПА.18.001",
                        "title":  "Доступ без авторизации",
                        "group":  "Использование недостатков механизмов разграничения доступа"
                    },
                    {
                        "id":  "57501c9d-669c-40ee-8aa5-8ee1e57d44f1",
                        "code":  "СПА.18.002",
                        "title":  "Использование ошибок или отсутствия проверки прав доступа",
                        "group":  "Использование недостатков механизмов разграничения доступа"
                    },
                    {
                        "id":  "2cebb54c-c464-45f2-9a0b-5a57f0c67a76",
                        "code":  "СПА.19.001",
                        "title":  "Модификация операционной системы путем загрузки с внешнего носителя",
                        "group":  "Модификации ОС (подмена системных файлов, внедрение вредоносного кода в системные процессы и ядро ОС)"
                    },
                    {
                        "id":  "d69fa8bd-7949-458d-a083-be92b8f2ea06",
                        "code":  "СПА.19.002",
                        "title":  "Модификация операционной системы из гипервизора",
                        "group":  "Модификации ОС (подмена системных файлов, внедрение вредоносного кода в системные процессы и ядро ОС)"
                    },
                    {
                        "id":  "466b3677-f5dd-4f24-b3e5-85352e81be26",
                        "code":  "СПА.19.003",
                        "title":  "Модификация операционной системы в момент загрузки операционной системы, используя руткиты",
                        "group":  "Модификации ОС (подмена системных файлов, внедрение вредоносного кода в системные процессы и ядро ОС)"
                    },
                    {
                        "id":  "6cf1e83a-3b47-410a-91f0-7f3b2823feff",
                        "code":  "СПА.19.004",
                        "title":  "Изменение (подмена, удаление) системных файлов операционной системы",
                        "group":  "Модификации ОС (подмена системных файлов, внедрение вредоносного кода в системные процессы и ядро ОС)"
                    },
                    {
                        "id":  "bb092a03-4a9a-4554-8dbc-5cd37edf8eeb",
                        "code":  "СПА.19.005",
                        "title":  "Модификация операционной системы при помощи руткитов (пользовательского и уровня ядра)",
                        "group":  "Модификации ОС (подмена системных файлов, внедрение вредоносного кода в системные процессы и ядро ОС)"
                    },
                    {
                        "id":  "a06f2e33-df5d-4c21-8c99-0d239d826481",
                        "code":  "СПА.20.001",
                        "title":  "Сбор данных перебором веб-страниц скриптом",
                        "group":  "Автоматический сбор человеко-читаемых данных"
                    },
                    {
                        "id":  "bd8af8a2-c495-41a4-9177-e78d8cf8e30a",
                        "code":  "СПА.20.002",
                        "title":  "Сбор данных перебором веб-страниц браузером",
                        "group":  "Автоматический сбор человеко-читаемых данных"
                    },
                    {
                        "id":  "9aa5c3a1-2ba8-4373-a6f8-4403cb2cc236",
                        "code":  "СПА.20.003",
                        "title":  "Сбор данных путем эмуляции мобильного приложения",
                        "group":  "Автоматический сбор человеко-читаемых данных"
                    },
                    {
                        "id":  "1ac85edf-0b2f-45af-a9f9-eaa6632a17fe",
                        "code":  "СПА.20.004",
                        "title":  "Сбор данных используя API интерфейс",
                        "group":  "Автоматический сбор человеко-читаемых данных"
                    },
                    {
                        "id":  "6357b92b-b16e-4cae-a9cb-103bc5f94e1e",
                        "code":  "СПА.21.001",
                        "title":  "Повреждение загрузочной области",
                        "group":  "Повреждение данных"
                    },
                    {
                        "id":  "22d95525-e818-4819-9292-edc66dc3a7d0",
                        "code":  "СПА.21.002",
                        "title":  "Затирание данных (wiping)",
                        "group":  "Повреждение данных"
                    },
                    {
                        "id":  "842d544f-0ead-470c-9108-14246d5dce7a",
                        "code":  "СПА.21.003",
                        "title":  "Искажение данных",
                        "group":  "Повреждение данных"
                    },
                    {
                        "id":  "a076b451-1742-430e-865d-5f3a5d4553b3",
                        "code":  "СПА.22.001",
                        "title":  "SQL-инъекция",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "2592074d-f6a0-4ea2-8b73-b30a09fc3ae2",
                        "code":  "СПА.22.002",
                        "title":  "Инъекция в шаблон на сервере (SSTI)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "5e499a73-c7e6-4652-9fb5-5b14410a5c93",
                        "code":  "СПА.22.003",
                        "title":  "Межсайтовый скриптинг (XSS) с запросами через сервер",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "819c6417-ee2d-4937-a423-fe9c840766ce",
                        "code":  "СПА.22.004",
                        "title":  "Межсайтовый скриптинг (XSS) без участия сервера",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "c2c1ba7a-0b29-4b4c-a3a1-1dcdce3f5b13",
                        "code":  "СПА.22.005",
                        "title":  "Инъекция системных команд (OS injection)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "8c79dafc-0602-4704-a20c-d686eb01022f",
                        "code":  "СПА.22.006",
                        "title":  "Обход механизмов разграничения доступа",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "11d194bf-622a-4266-836e-95837a898cd5",
                        "code":  "СПА.22.007",
                        "title":  "Нелегитимная отправка (подделка) запросов от имени пользователя (CSRF)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "7060666e-2a83-4b26-ad3b-23f568bc4fbe",
                        "code":  "СПА.22.008",
                        "title":  "Нелегитимная отправка (подделка) запросов от имени сервера (SSRF)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "906107e1-169d-4311-8de6-bbd6b17a891f",
                        "code":  "СПА.22.009",
                        "title":  "Раскрытие чувствительной информации о пользователях",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "7b312750-48cc-416c-899c-38a1863423ed",
                        "code":  "СПА.22.010",
                        "title":  "Раскрытие чувствительной информации о приложении и инфраструктуре",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "aa3af208-dce5-4dcc-a214-e3013ed19dbe",
                        "code":  "СПА.22.011",
                        "title":  "Ошибки конфигурирования функций безопасности",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "8a990d64-9f5a-4523-9eea-2a9df1851ed0",
                        "code":  "СПА.22.012",
                        "title":  "Использование недостатков, связанных с небезопасной десериализацией",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "5d265a2b-7fd4-4e57-bc1e-3ab197f2bee3",
                        "code":  "СПА.22.013",
                        "title":  "Использование уязвимых библиотек и компонентов",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "c20f4de7-0823-43b7-8555-f2a7a52ebb13",
                        "code":  "СПА.22.014",
                        "title":  "Использование недостатков слабой реализации регистрации событий и мониторинга",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "4f789a8c-b135-449f-8276-ea7b929fc1ac",
                        "code":  "СПА.22.015",
                        "title":  "Манипуляция с временными данными (cache)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "f8a12b42-3869-4f1c-9815-fe0518014ee6",
                        "code":  "СПА.22.016",
                        "title":  "Получение чувствительной информации со страниц веб-приложения или из ответов сервера",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "f5a89cbf-9e07-446c-ba88-0d1e76282ba8",
                        "code":  "СПА.22.017",
                        "title":  "Атака на XML процессор (XML External Entity)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "95c3570f-8b53-4e64-b2fe-f55f1cc50211",
                        "code":  "СПА.22.018",
                        "title":  "Подключение локальных файлов (LFI-атака)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "45fc5659-7b58-467d-8eba-7d2e9e21e45e",
                        "code":  "СПА.22.019",
                        "title":  "Подключение удаленных файлов (RFI-атака)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "0a39283c-0a97-40d9-a547-9bfabcc41ab9",
                        "code":  "СПА.22.020",
                        "title":  "Выход за пределы каталога (Path Traversal)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "19ec4bb8-4925-4d34-832d-09745490d62f",
                        "code":  "СПА.22.021",
                        "title":  "Заражение кеша",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "97f2ed4b-fb55-4858-a68f-d13ce7ac5ab4",
                        "code":  "СПА.22.022",
                        "title":  "Подмена действий пользователя (Clickjacking)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "314c166a-1696-4c22-b7cf-6a18dce53f26",
                        "code":  "СПА.22.023",
                        "title":  "Захват сеанса пользователя (Session Hijacking)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "7103d006-bcad-409b-9aaa-0e3fd4280c3d",
                        "code":  "СПА.22.024",
                        "title":  "Расщепление HTTP-ответа/запроса",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "9608f168-733e-4b97-81b2-00a989c87e3c",
                        "code":  "СПА.22.025",
                        "title":  "Межсайтовая трассировка (XST-атака)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "ee41e192-c6f3-4514-8682-1d976d52a2fc",
                        "code":  "СПА.22.026",
                        "title":  "Изменение параметров HTTP (HPP-атака)",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "634f7da5-464f-4f7a-a6e7-491354d31b0c",
                        "code":  "СПА.22.027",
                        "title":  "Открытое перенаправление",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "b1f7a9e1-49ef-4200-9ecc-8aac790ac0f6",
                        "code":  "СПА.22.028",
                        "title":  "Переполнение буфера",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "ae4a7ea5-a166-4397-98ef-cabc4be69d22",
                        "code":  "СПА.22.029",
                        "title":  "Загрузка произвольных файлов",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "f1d57681-1ce6-4c09-9dc0-cd28980cdc0e",
                        "code":  "СПА.22.030",
                        "title":  "Нарушение логики работы приложения",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "39635c14-4be9-499c-b079-77bdf070978d",
                        "code":  "СПА.22.031",
                        "title":  "Использование недостатков механизма завершения сессии",
                        "group":  "Атака на Веб-приложение"
                    },
                    {
                        "id":  "922e84f6-d048-4c91-a35c-91a0303d5732",
                        "code":  "СПА.23.001",
                        "title":  "Подмена прошивки (микропрограммы)",
                        "group":  "Модификация (подмена) прошивки (микропрограммы)"
                    },
                    {
                        "id":  "5bd24a02-7953-4381-ab1f-54551b577a53",
                        "code":  "СПА.23.002",
                        "title":  "Модификация прошивки (микропрограммы)",
                        "group":  "Модификация (подмена) прошивки (микропрограммы)"
                    },
                    {
                        "id":  "d45f1187-bd26-4046-867d-af1a52c90ff7",
                        "code":  "СПА.24.001",
                        "title":  "Кража носителей информации",
                        "group":  "Физическое воздействие"
                    },
                    {
                        "id":  "9f316793-116b-42c9-b32f-80fdf20f5e15",
                        "code":  "СПА.24.002",
                        "title":  "Внесение изменений в конфигурацию на уровне оборудования",
                        "group":  "Физическое воздействие"
                    },
                    {
                        "id":  "644eae91-c3ec-406f-85da-c86de06dd32d",
                        "code":  "СПА.24.003",
                        "title":  "Уничтожение оборудования",
                        "group":  "Физическое воздействие"
                    },
                    {
                        "id":  "db611257-83e1-41ee-8542-97da57ee6699",
                        "code":  "СПА.25.001",
                        "title":  "Атаки на механизмы идентификации участников системы распределенного реестра",
                        "group":  "Атаки на системы с распределенным реестром"
                    },
                    {
                        "id":  "f88931b5-4b0a-45fb-b45a-51a4fcc28853",
                        "code":  "СПА.25.002",
                        "title":  "Атаки на протоколы достижения консенсуса",
                        "group":  "Атаки на системы с распределенным реестром"
                    },
                    {
                        "id":  "0d6f7069-001f-40f1-8b15-ecdeee1e7c6f",
                        "code":  "СПА.25.003",
                        "title":  "Атаки на смарт-контракты",
                        "group":  "Атаки на системы с распределенным реестром"
                    },
                    {
                        "id":  "6ba0b9b7-2af3-4202-8b0e-f263ab98b3a1",
                        "code":  "СПА.25.004",
                        "title":  "Атаки на услуги системы с распределенным реестром",
                        "group":  "Атаки на системы с распределенным реестром"
                    }
                ],
    "scenarios":  [
                      {
                          "id":  "dc426709-442c-4d1c-8294-b346c31257f3",
                          "code":  "",
                          "title":  "С1.3 Реализация отказа в обслуживании инженерной станции ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Отказ в обслуживании инженерной станции ЦДП",
                                            "threat_code":  "УТП:08",
                                            "threat_title":  "Угроза отказа в обслуживании"
                                        }
                                    ]
                      },
                      {
                          "id":  "69832b32-33a4-45f3-89ff-03867e4bad1b",
                          "code":  "",
                          "title":  "С1.4 Повреждение содержимого жестких дисков инженерной станции ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Повреждение содержимого жестких дисков инженерной станции ЦДП",
                                            "threat_code":  "УТП:07",
                                            "threat_title":  "Угроза удаления информационных ресурсов"
                                        }
                                    ]
                      },
                      {
                          "id":  "a0e45d46-6da5-45a3-9e51-ffd0bb53423c",
                          "code":  "",
                          "title":  "С1.1 Реализация отказа в обслуживании АРМ управления ТП ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ управления ТП ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Отказ в обслуживании АРМ управления ТП ЦДП",
                                            "threat_code":  "УТП:08",
                                            "threat_title":  "Угроза отказа в обслуживании"
                                        }
                                    ]
                      },
                      {
                          "id":  "081e8566-b6d7-42b2-b4fd-7c20859bbe9a",
                          "code":  "",
                          "title":  "С1.7 Несанкционированное изменение алгоритмов контроля и управления ходом ТП на уровне ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение доступа к учетным записям инженерной станции ЦДП",
                                            "threat_code":  "УТП:01",
                                            "threat_title":  "Угроза утечки информации"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Несанкционированное изменение алгоритмов контроля и управления ходом ТП",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "54104c13-0cb0-4fea-87f0-88fb2c267a41",
                          "code":  "",
                          "title":  "С1.6 Повреждение содержимого жестких дисков сервера РСУ ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к серверу РСУ ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Повреждение содержимого жестких дисков сервера РСУ ЦДП",
                                            "threat_code":  "УТП:07",
                                            "threat_title":  "Угроза удаления информационных ресурсов"
                                        }
                                    ]
                      },
                      {
                          "id":  "cc2c19cb-865b-40c7-b4a8-e7a01e1b5ba8",
                          "code":  "",
                          "title":  "С1.5 Реализация отказа в обслуживании сервера РСУ ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к серверу РСУ ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Отказ в обслуживании сервера РСУ ЦДП",
                                            "threat_code":  "УТП:08",
                                            "threat_title":  "Угроза отказа в обслуживании"
                                        }
                                    ]
                      },
                      {
                          "id":  "43170a92-7b33-4f0b-bb11-ff08bd7c87cd",
                          "code":  "",
                          "title":  "С1.17 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к серверу РСУ ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "2d32fc28-4d4f-4912-b93b-541ed5c8cd14",
                          "code":  "",
                          "title":  "С1.15 Несанкционированное изменение конфигурации ПЛК внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "e5910c3d-25c5-4855-bd8e-a02dd8cae691",
                          "code":  "",
                          "title":  "С1.11 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  6,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к серверу РСУ ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  6,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "39c236fb-1c03-4245-ae70-edd41ed608e9",
                          "code":  "",
                          "title":  "С1.16 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ оператора технологического участка",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "7f0fe75a-3903-42cc-9586-a4b947352387",
                          "code":  "",
                          "title":  "С1.19 Несанкционированное изменение конфигурации ПЛК внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ оператора технологического участка",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "dd9f24c6-5de5-4d4e-a92a-c4ba97df13ac",
                          "code":  "",
                          "title":  "С1.21 Несанкционированное изменение конфигурации ПЛК внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  3,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к инженерной станции ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "1fcea458-187c-4592-af10-8076723577d8",
                          "code":  "",
                          "title":  "С2.3 Несанкционированное изменение алгоритмов контроля и управления ходом ТП внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для локальных систем управления",
                          "step_count":  3,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение доступа к учетным записям АРМ управления ТП",
                                            "threat_code":  "УТП:01",
                                            "threat_title":  "Угроза утечки информации"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Несанкционированное изменение алгоритмов контроля и управления ходом ТП",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "0b56acdf-4610-4b7d-a41b-f5caaedca9f9",
                          "code":  "",
                          "title":  "С2.2 Повреждение содержимого жестких дисков АРМ управления ТП внутренним нарушителем.",
                          "scenario_type":  "Типовые сценарии для локальных систем управления",
                          "step_count":  2,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ управления ТП ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Повреждение содержимого жестких дисков АРМ управления ТП",
                                            "threat_code":  "УТП:07",
                                            "threat_title":  "Угроза удаления информационных ресурсов"
                                        }
                                    ]
                      },
                      {
                          "id":  "e0cb3177-b60a-4026-84f2-9fdf672f3240",
                          "code":  "",
                          "title":  "С2.1 Реализация отказа в обслуживании АРМ управления ТП внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для локальных систем управления",
                          "step_count":  2,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Отказ в обслуживании АРМ управления ТП",
                                            "threat_code":  "УТП:08",
                                            "threat_title":  "Угроза отказа в обслуживании"
                                        }
                                    ]
                      },
                      {
                          "id":  "9675fce8-6495-4c86-b769-f4a95fc45bff",
                          "code":  "",
                          "title":  "С2.7 Несанкционированное изменение конфигурации ПЛК внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для локальных систем управления",
                          "step_count":  3,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "1b9ca8c7-1f42-4b35-839a-485726743d97",
                          "code":  "",
                          "title":  "С2.5 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для локальных систем управления",
                          "step_count":  3,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "0b8de72f-a7ff-420a-85df-b576f23a44a4",
                          "code":  "",
                          "title":  "С2.4 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для локальных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "5d5b4906-c953-43b5-84b6-26772d81d609",
                          "code":  "",
                          "title":  "С1.10 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  6,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ оператора технологического участка",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  6,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "91367c16-7681-4f7a-a326-802e5052069f",
                          "code":  "",
                          "title":  "С1.9 Несанкционированное изменение алгоритмов контроля и управления ходом ТП на уровне ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к серверу РСУ",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение доступа к учетным записям сервера РСУ",
                                            "threat_code":  "УТП:01",
                                            "threat_title":  "Угроза утечки информации"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Несанкционированное изменение алгоритмов контроля и управления ходом ТП",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "725abd54-7ede-4a7f-ae60-0aacb4f45f6b",
                          "code":  "",
                          "title":  "С1.8 Несанкционированное изменение алгоритмов контроля и управления ходом ТП на уровне ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ управления ТП ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение доступа к учетным записям АРМ управления ТП ЦДП",
                                            "threat_code":  "УТП:01",
                                            "threat_title":  "Угроза утечки информации"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Несанкционированное изменение алгоритмов контроля и управления ходом ТП",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "fd3c94b8-7930-48ed-adcf-25867894e70d",
                          "code":  "",
                          "title":  "С2.6 Несанкционированное изменение конфигурации ПЛК внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для локальных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "515a1650-7f7d-4914-a5ed-8da26a5dff84",
                          "code":  "",
                          "title":  "С1.14 Несанкционированное изменение конфигурации ПЛК внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  6,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к серверу РСУ ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:02",
                                            "threat_title":  "Угроза получения информационных ресурсов из недоверенного или скомпрометированного источника"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  6,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "7c937eed-e23b-47fa-9b2a-1a6c3d3801a4",
                          "code":  "",
                          "title":  "С1.13 Несанкционированное изменение конфигурации ПЛК внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  6,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ оператора технологического участка",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  6,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "3bf20a4d-433c-46df-9a45-06ab2af2f500",
                          "code":  "",
                          "title":  "С1.2 Повреждение содержимого жестких дисков АРМ управления ТП ЦДП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ управления ТП ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Повреждение содержимого жестких дисков АРМ управления ТП ЦДП",
                                            "threat_code":  "УТП:07",
                                            "threat_title":  "Угроза удаления информационных ресурсов"
                                        }
                                    ]
                      },
                      {
                          "id":  "b5b0aec9-9489-4255-8af4-b353f2158070",
                          "code":  "",
                          "title":  "С3.8 Несанкционированное изменение алгоритмов контроля и управления ходом ТП внешним нарушителем.",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение доступа к учетным записям АРМ управления ТП",
                                            "threat_code":  "УТП:01",
                                            "threat_title":  "Угроза утечки информации"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Несанкционированное изменение алгоритмов контроля и управления ходом ТП",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "fac0b7bf-c56a-4c08-91b5-ac28c31a5a76",
                          "code":  "",
                          "title":  "С3.7 Несанкционированное изменение алгоритмов контроля и управления ходом ТП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение доступа к учетным записям инженерной станции",
                                            "threat_code":  "УТП:01",
                                            "threat_title":  "Угроза утечки информации"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Несанкционированное изменение алгоритмов контроля и управления ходом ТП",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        }
                                    ]
                      },
                      {
                          "id":  "02ef6efd-df1a-42d8-8313-49a2b84684bd",
                          "code":  "",
                          "title":  "С3.6 Повреждение содержимого жестких дисков промышленного сервера внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к промышленному серверу",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Повреждение содержимого жестких дисков промышленного сервера",
                                            "threat_code":  "УТП:07",
                                            "threat_title":  "Угроза удаления информационных ресурсов"
                                        }
                                    ]
                      },
                      {
                          "id":  "d1e413f0-145d-4ebe-a6db-a0990dcd9102",
                          "code":  "",
                          "title":  "С3.11 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  6,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к промышленному серверу",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  6,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "fdb07936-a5ff-43d5-9224-c7338d7570f5",
                          "code":  "",
                          "title":  "С3.10 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  6,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  6,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "97d02377-939f-47a4-8225-8e0849143d8c",
                          "code":  "",
                          "title":  "С3.9 Несанкционированное изменение алгоритмов контроля и управления ходом ТП внешним нарушителем.",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к промышленному серверу",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение доступа к учетным записям промышленного сервера",
                                            "threat_code":  "УТП:01",
                                            "threat_title":  "Угроза утечки информации"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Несанкционированное изменение алгоритмов контроля и управления ходом ТП",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "6bec727d-52c7-47fd-9d14-a0ec9e839a28",
                          "code":  "",
                          "title":  "С3.3 Реализация отказа в обслуживании инженерной станции внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Отказ в обслуживании инженерной станции",
                                            "threat_code":  "УТП:08",
                                            "threat_title":  "Угроза отказа в обслуживании"
                                        }
                                    ]
                      },
                      {
                          "id":  "dba5d9bd-9397-45bb-87cb-2e75ffaca343",
                          "code":  "",
                          "title":  "С3.18 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  3,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "8c5cc17d-9e6c-455d-902f-80955a32ea83",
                          "code":  "",
                          "title":  "С3.19 Несанкционированное изменение конфигурации ПЛК внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "5d4306aa-67b2-438d-bcba-16b7c790f230",
                          "code":  "",
                          "title":  "С3.1 Реализация отказа в обслуживании АРМ управления ТП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Отказ в обслуживании АРМ управления ТП",
                                            "threat_code":  "УТП:08",
                                            "threat_title":  "Угроза отказа в обслуживании"
                                        }
                                    ]
                      },
                      {
                          "id":  "e272a648-9274-4bc5-b853-8fbd888cb721",
                          "code":  "",
                          "title":  "С3.2 Повреждение содержимого жестких дисков АРМ управления ТП внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Повреждение содержимого жестких дисков АРМ управления ТП",
                                            "threat_code":  "УТП:07",
                                            "threat_title":  "Угроза удаления информационных ресурсов"
                                        }
                                    ]
                      },
                      {
                          "id":  "3e2d85d9-c00a-47e0-a3a0-5895775b207c",
                          "code":  "",
                          "title":  "С3.17 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к промышленному серверу",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "41c0599e-9201-43fe-a02c-a7dd7732c02d",
                          "code":  "",
                          "title":  "С3.20 Несанкционированное изменение конфигурации ПЛК внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к промышленному серверу",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "fab9fd21-9a20-4957-8cff-641de948328a",
                          "code":  "",
                          "title":  "С3.21 Несанкционированное изменение конфигурации ПЛК внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  3,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "54c9467f-c86d-40d0-93ce-9c4e3db05dff",
                          "code":  "",
                          "title":  "С3.16 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "37532ff4-ca64-4046-ab77-a6b9363fbd4e",
                          "code":  "",
                          "title":  "С1.20 Несанкционированное изменение конфигурации ПЛК внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к серверу РСУ ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "5c287ce9-85fa-4f2f-9a6e-dd06626195db",
                          "code":  "",
                          "title":  "С1.18 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внутренним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  3,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Получение НСД к инженерной станции ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "2386c67a-a0d9-481d-bf76-ddf7820ce219",
                          "code":  "",
                          "title":  "С1.12 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для распределенных систем управления",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции ЦДП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "6acf3c8b-cf0f-4116-960e-8498787c4d1b",
                          "code":  "",
                          "title":  "С3.14 Несанкционированное изменение конфигурации ПЛК внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  6,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к промышленному серверу",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  6,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "5f7944db-8f53-4c59-8e68-f3da0d7c8dd2",
                          "code":  "",
                          "title":  "С3.13 Несанкционированное изменение конфигурации ПЛК внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  6,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к АРМ управления ТП",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Использование недостатков конфигурации сетевого оборудования для подключения к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  6,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      },
                      {
                          "id":  "fa5b4321-43d4-4969-b361-47e98f24471c",
                          "code":  "",
                          "title":  "С3.12 Несанкционированная загрузка в ПЛК некорректного программного обеспечения управления и контроля внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Несанкционированная загрузка в ПЛК некорректного программного обеспечения",
                                            "threat_code":  "УТП:06",
                                            "threat_title":  "Угроза несанкционированной подмены"
                                        }
                                    ]
                      },
                      {
                          "id":  "193a8026-2dd2-46db-a0fa-6463f0291795",
                          "code":  "",
                          "title":  "С3.5 Реализация отказа в обслуживании промышленного сервера внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к промышленному серверу",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Отказ в обслуживании промышленного сервера",
                                            "threat_code":  "УТП:08",
                                            "threat_title":  "Угроза отказа в обслуживании"
                                        }
                                    ]
                      },
                      {
                          "id":  "2c3a29d6-7678-468a-98d9-33ec1003e939",
                          "code":  "",
                          "title":  "С3.4 Повреждение содержимого жестких дисков инженерной станции внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  4,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Повреждение содержимого жестких дисков инженерной станции",
                                            "threat_code":  "УТП:07",
                                            "threat_title":  "Угроза удаления информационных ресурсов"
                                        }
                                    ]
                      },
                      {
                          "id":  "40acd917-5e91-4ead-a57d-778b0b573dbc",
                          "code":  "",
                          "title":  "С3.15 Несанкционированное изменение конфигурации ПЛК внешним нарушителем",
                          "scenario_type":  "Типовые сценарии для систем диспетчерского контроля и сбора данных (SCADA-систем)",
                          "step_count":  5,
                          "steps":  [
                                        {
                                            "step_number":  1,
                                            "description":  "Сбор данных об архитектуре АСУ ТП и корпоративной сети предприятия, получение сведений, необходимых для проведения атаки",
                                            "threat_code":  "УТП:10",
                                            "threat_title":  "Угроза несанкционированного сбора данных об автоматизированной системе управления"
                                        },
                                        {
                                            "step_number":  2,
                                            "description":  "Получение НСД к компоненту корпоративной сети предприятия",
                                            "threat_code":  "УТП:04",
                                            "threat_title":  "Угроза несанкционированного доступа"
                                        },
                                        {
                                            "step_number":  3,
                                            "description":  "Получение НСД к инженерной станции",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  4,
                                            "description":  "Получение НСД к ПЛК",
                                            "threat_code":  "УТП:03",
                                            "threat_title":  "Угроза удаленного несанкционированного подключения к компонентам АСУ ТП"
                                        },
                                        {
                                            "step_number":  5,
                                            "description":  "Изменение конфигурации ПЛК",
                                            "threat_code":  "УТП:05",
                                            "threat_title":  "Угроза несанкционированной модификации (искажения)"
                                        }
                                    ]
                      }
                  ],
    "violators":  [
                      {
                          "id":  "9aa27520-ff4a-497c-b151-dc9648d4ca16",
                          "title":  "Нарушитель, обладающий базовыми возможностями",
                          "description":  "Имеет возможность при реализации угроз безопасности информации использовать только известные уязвимости, скрипты и инструменты. Имеет возможность использовать средства реализации угроз (инструменты), свободно распространяемые в сети Интернет и разработанные другими лицами, имеют минимальные знания механизмов их функционирования, доставки и выполнения вредоносного программного обеспечения, эксплойтов. Обладает базовыми компьютерными знаниями и навыками на уровне пользователя. Имеет возможность реализации угроз за счет физических воздействий на технические средства обработки и хранения информации, линий связи и обеспечивающие системы систем и сетей при наличии физического доступа к ним. Таким образом, нарушители с базовыми возможностями имеют возможность реализовывать только известные угрозы, направленные на известные (документированные) уязвимости, с использованием общедоступных инструментов."
                      },
                      {
                          "id":  "d9374957-d874-4a87-b57d-300444582f05",
                          "title":  "Нарушитель, обладающий базовыми повышенными возможностями",
                          "description":  "Обладает всеми возможностями нарушителей с базовыми возможностями. Имеет возможность использовать средства реализации угроз (инструменты), свободно распространяемые в сети Интернет и разработанные другими лицами, однако хорошо владеют этими средствами и инструментами, понимают, как они работают и могут вносить изменения в их функционирование для повышения эффективности реализации угроз. Оснащен и владеет фреймворками и наборами средств, инструментов для реализации угроз безопасности информации и использования уязвимостей. Имеет навыки самостоятельного планирования и реализации сценариев угроз безопасности информации. Обладает практическими знаниями о функционировании систем и сетей, операционных систем, а также имеют знания защитных механизмов, применяемых в программном обеспечении, программно-аппаратных средствах. Таким образом, нарушители с базовыми повышенными возможностями имеют возможность реализовывать угрозы, в том числе направленные на неизвестные (недокументированные) уязвимости, с использованием специально созданных для этого инструментов, свободно распространяемых в сети «Интернет». Не имеют возможностей реализации угроз на физически изолированные сегменты систем и сетей."
                      },
                      {
                          "id":  "ee06e222-4513-4007-97ad-9af2a64194cf",
                          "title":  "Нарушитель, обладающий средними возможностями",
                          "description":  "Обладает всеми возможностями нарушителей с базовыми повышенными возможностями. Имеет возможность приобретать информацию об уязвимостях, размещаемую на специализированных платных ресурсах (биржах уязвимостей). Имеет возможность приобретать дорогостоящие средства и инструменты для реализации угроз, размещаемую на специализированных платных ресурсах (биржах уязвимостей). Имеет возможность самостоятельно разрабатывать средства (инструменты), необходимые для реализации угроз (атак), реализовывать угрозы с использованием данных средств. Имеет возможность получения доступа к встраиваемому программному обеспечению аппаратных платформ, системному и прикладному программному обеспечению, телекоммуникационному оборудованию и другим программно-аппаратным средствам для проведения их анализа. Обладает знаниями и практическими навыками проведения анализа программного кода для получения информации об уязвимостях. Обладает высокими знаниями и практическими навыками о функционировании систем и сетей, операционных систем, а также имеет глубокое понимание защитных механизмов, применяемых в программном обеспечении, программно-аппаратных средствах. Имеет возможность реализовывать угрозы безопасности информации в составе группы лиц. Таким образом, нарушители со средними возможностями имеют возможность реализовывать угрозы, в том числе на выявленные ими неизвестные уязвимости, с использованием самостоятельно разработанных для этого инструментов. Не имеют возможностей реализации угроз на физически изолированные сегменты систем и сетей."
                      },
                      {
                          "id":  "492409b5-82f0-4130-9bf0-d3f0e898d983",
                          "title":  "Нарушитель, обладающий высокими возможностями",
                          "description":  "Обладает всеми возможностями нарушителей со средними возможностями. Имеет возможность получения доступа к исходному коду встраиваемого программного обеспечения аппаратных платформ, системного и прикладного программного обеспечения, телекоммуникационного оборудования и других программно-аппаратных средств для получения сведений об уязвимостях «нулевого дня». Имеет возможность внедрения программных (программно-аппаратных) закладок или уязвимостей на различных этапах поставки программного обеспечения или программно-аппаратных средств. Имеет возможность создания методов и средств реализации угроз с привлечением специализированных научных организаций и реализации угроз с применением специально разработанных средств, в том числе обеспечивающих скрытное проникновение. Имеет возможность реализовывать угрозы с привлечением специалистов, имеющих базовые повышенные, средние и высокие возможности. Имеет возможность создания и применения специальных технических средств для добывания информации (воздействия на информацию или технические средства), распространяющейся в виде физических полей или явлений. Имеет возможность долговременно и незаметно для операторов систем и сетей реализовывать угрозы безопасности информации. Обладает исключительными знаниями и практическими навыками о функционировании систем и сетей, операционных систем, аппаратном обеспечении, а также осведомлены о конкретных защитных механизмах, применяемых в программном обеспечении, программно-аппаратных средствах атакуемых систем и сетей. Таким образом, нарушители с высокими возможностями имеют практически неограниченные возможности реализовывать угрозы, в том числе с использованием недекларированных возможностей, программных, программно-аппаратных закладок, встроенных в компоненты систем и сетей."
                      }
                  ],
    "object_threats_map":  {
                               "ОА.007":  [
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.004":  [
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.008":  [
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.014":  [
                                              "",
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.009":  [
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.010":  [
                                              "",
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.011":  [
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.001":  [
                                              "",
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.005":  [
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.012":  [
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.002":  [
                                              "",
                                              "",
                                              "",
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.006":  [
                                              "",
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.013":  [
                                              "",
                                              "",
                                              "",
                                              ""
                                          ],
                               "ОА.003":  [
                                              "",
                                              "",
                                              "",
                                              "",
                                              "",
                                              ""
                                          ]
                           }
};

function getItThreats() {
    return itThreats;
}

function getAsutpCatalog() {
    return asutpCatalog;
}

function getInfluenceObjects() {
    return asutpCatalog.objects || [];
}

function getAsutpThreats() {
    return asutpCatalog.threats || [];
}

function getAsutpScenarios() {
    return asutpCatalog.scenarios || [];
}

function getAsutpMethods() {
    return asutpCatalog.methods || [];
}

function getObjectThreatsMap() {
    return asutpCatalog.object_threats_map || {};
}

function getThreatsForObject(oaCode) {
    if (!oaCode) return asutpCatalog.threats || [];
    var map = asutpCatalog.object_threats_map || {};
    var codes = map[oaCode];
    if (!codes || codes.length === 0) return asutpCatalog.threats || [];
    var res = [];
    var allTh = asutpCatalog.threats || [];
    for (var i = 0; i < allTh.length; i++) {
        if (codes.indexOf(allTh[i].code) !== -1) {
            res.push(allTh[i]);
        }
    }
    return res;
}